[
  {
    "ticker": "2020.OL",
    "company_name": "2020 Bulkers Ltd.",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "2020 Bulkers Ltd. owns and operates large dry bulk vessels worldwide. The company operates six scrubber fitted 208,000 deadweight tonnage Newcastlemax dry bulk vessels. 2020 Bulkers Ltd. was incorporated in 2017 and is based in Hamilton, Bermuda.",
    "description_length": 246
  },
  {
    "ticker": "ABG.OL",
    "company_name": "ABG Sundal Collier Holding ASA",
    "sector": "Financial Services",
    "industry": "Capital Markets",
    "original_description": "ABG Sundal Collier Holding ASA, together with its subsidiaries, provides investment banking, stock broking, and corporate advisory services in Norway, Sweden, Denmark, and internationally. It operates through Corporate Financing, M&A and Advisory, and Brokerage and Research segments. The company offers corporate financing services for corporate clients for raising capital through equity or debt financing. It also provides advisory services in mergers, acquisitions, and sales, as well as various real asset transactions and other advisory services. In addition, the company offers research and brokerage services comprising secondary security brokerage and research advisory services. ABG Sundal Collier Holding ASA was founded in 1984 and is headquartered in Oslo, Norway.",
    "description_length": 777
  },
  {
    "ticker": "ABL.OL",
    "company_name": "ABL Group ASA",
    "sector": "Industrials",
    "industry": "Specialty Business Services",
    "original_description": "ABL Group ASA, an investment holding company, provides energy, and marine and engineering consultancy services to renewables, maritime, and oil and gas industries worldwide. It offers technical due diligence; owner's engineering; project development; geotechnical and geophysical; HSEQ and risk consulting; marine operations and engineering; marine design, upgrade, and conversion; site investigations; clean shipping; engineering and design, jack-up and wind farm installation vessel support; advanced analysis and simulation; digital; subsea cables; and client reps and secondment services. The company also provides asset management, maintenance, inventory, and data optimization solutions; marine surveys, inspections, and audits, including vessel and marine assurance, rig inspections, industry standard audit, vessel condition surveys, pre-purchase survey, and dynamic positioning, as well as marine warranty survey services. In addition, it offers marine casualty management comprising marine salvage and wreck removal consultancy, hull and machinery claims, and P&I claims services; and expert witness and litigation support services. Further, the company provides software solutions, such as EFFIO, a cloud-based data build and optimization software for asset management strategy; ePAV, a data collection, audit, and verification software; emiTr, an emissions tracking software; iQx, a plug-and-play drilling software; hiQbe, a technology that produces qualitative data and enables game-changing efficiencies in velocity modelling; and AssetVoice, an automated workflow and real-time asset tracking software, as well as AquaSafe, a dashboard solution for crystal clear data presentation in water-related sectors. The company was formerly known as AqualisBraemar LOC ASA and changed its name to ABL Group ASA in June 2022. The company was incorporated in 2014 and is headquartered in London, the United Kingdom.",
    "description_length": 1919
  },
  {
    "ticker": "AFG.OL",
    "company_name": "AF Gruppen ASA",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "original_description": "AF Gruppen ASA, a contracting and industrial company, provides civil engineering, construction, energy and environment, and property and offshore services in Norway and Sweden. It offers civil engineering services, including construction of various projects, such as roads, railways, bridges, port facilities, airports, tunnels, foundation work, renovation and construction of concrete structures, power and energy plants, and onshore facilities for oil and gas; and concrete technology, groundwork and earthmoving, geomatics and surveying, and project support services. The company also operates as a turnkey contractor for the development and planning to buildings comprising residential, commercial, public buildings, and rehabilitation and rebuilding, as well as offers extension work services. In addition, it provides energy solutions, which includes energy performing contracting, technical turnkey contract, local power supply, and technical services and maintenance; and energy solutions for existing and new buildings. Further, the company manages construction and decommissioning projects, including removal and recycling of offshore installations; offers turnkey services in the areas of cooling and ventilation for onshore and offshore installations, rigs, and ships, as well as offshore wind services; and operates as a contractor for demolition and environmental clean-up services for buildings and structures, such as blasting, dredging, handling of contaminated bulk material, and removal of shipwrecks. Additionally, it provides office spaces on rental basis, and sale of homes. AF Gruppen ASA was founded in 1985 and is headquartered in Oslo, Norway.",
    "description_length": 1669
  },
  {
    "ticker": "AKVA.OL",
    "company_name": "AKVA group ASA",
    "sector": "Industrials",
    "industry": "Farm & Heavy Construction Machinery",
    "original_description": "AKVA group ASA designs, purchases, manufactures, assembles, sells, and installs technology products; and provides rental and consulting services for the aquaculture industry. The company operates in three segments: Sea Based Technology (SBT), Digital, and Land Based Technology (LBT). The SBT segment offers nets, plastic pens, steel pens, mooring, special nets, remotely operating vehicles systems, net cleaning, marine engineering, lab services, boats, additional equipment, pipes, feed barges, feed systems, lights, camera, sensors, and deep farming solutions such as nautilus, tubenet, and opticage. This segment also provides PE-boats for the fish-farming, diving, and the oil and gas service industries. The Digital segment provides monitoring and reporting solutions under the brand the AKVA Fishtalk, AKVA connect, AKVA Submerged, and AKVA ecosystem names. The LBT segment includes design, engineering, tanks, piping, feeding systems, software, cameras, and sensors, as well as provides water quality conditions for fresh and seawater operations. It operates in Norway, Europe, Canada, China, Chile, Iceland, Russia, and internationally. The company was incorporated in 1982 and is headquartered in Klepp Stasjon, Norway. AKVA group ASA is a subsidiary of Egersund Group AS.",
    "description_length": 1282
  },
  {
    "ticker": "AMSC.OL",
    "company_name": "AMSC ASA",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "AMSC ASA does not have significant operations. Previously, the company invested in maritime assets and companies in the United States. The company was formerly known as American Shipping Company ASA and changed its name to AMSC ASA in October 2022. AMSC ASA was founded in 2005 and is headquartered in Lysaker, Norway.",
    "description_length": 318
  },
  {
    "ticker": "AGLX.OL",
    "company_name": "Agilyx ASA",
    "sector": "Industrials",
    "industry": "Waste Management",
    "original_description": "Agilyx ASA, together with its subsidiaries, provides plastic waste solutions in Europe, the United States, and the Asia pacific. The company operates through two segments, Agilyx and Cyclyx. It offers Styrenyx, a recycling technology that uses catalyst-free depolymerization to recycle polystyrene waste; Cyclyx which supplies custom-formulated feedstock derived from plastic waste; Plastyx, a feedstock supplier; and TruStyrenyx, a technology platform for the recycling of polystyrene. The company also licenses its patented conversion technology and sells its patented equipment to industry players. Agilyx ASA was founded in 2004 and is headquartered in Tigard, Oregon.",
    "description_length": 672
  },
  {
    "ticker": "AIRX.OL",
    "company_name": "Airthings ASA",
    "sector": "Industrials",
    "industry": "Electrical Equipment & Parts",
    "original_description": "Airthings ASA, a hardware-enabled software company, engages in the development of products and systems for monitoring indoor air quality, radon, and energy efficiency worldwide. It operates through Consumer, Business, and Professional segments. The Consumer segment sells air quality sensors to private customers through retail and e-commerce. The Business segment provides air quality solutions to schools, office buildings, and other commercial buildings. The Professional segment sells measurement solutions, which enable inspectors and certified radon professionals to measure, analyze, and report on buildings; and offers rental of products and calibration services. In addition, it offers digital radon detectors, as well as smart indoor air quality monitors and solutions. The company provides its products under the View Plus, View Pollution, View Radon, Wave Plus, Wave Radon, Wave Mini, House Kit, Hub, Corentium Home, Plus, and Pro brands. Airthings ASA was incorporated in 2008 and is headquartered in Oslo, Norway.",
    "description_length": 1027
  },
  {
    "ticker": "AKAST.OL",
    "company_name": "Akastor ASA",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "Akastor ASA operates as an oilfield services investment company in Norway and internationally. It operates HMH, AKOFS Offshore, DDW Offshore, and Other holdings. The company offers vessel-based subsea well construction and intervention services to the oil and gas industry. Its HMH segments offer delivery capabilities, capital, renowned industry expertise and delivers the full range of offshore drilling equipment products and packages at scale. The AKOFS Offshore segment provides vessel-based subsea well construction and intervention services to the oil and gas industry, covering all phases from conceptual development to project execution, and offshore operations. Its DDW Offshore three Anchor Handling Tug Supply AHTS vessels, operate and support clients on a world-wide basis, and handling, towing, and supply services. The other holding segment offer joint venture fon energy services, equity instruments. It also includes anchor-handling, towing, and supply services to offshore oil and gas fields. In addition, the company offers a range of offshore drilling equipment products and packages. It owns offshore vessels and anchor handling tug supply vessels. Akastor ASA was founded in 1841 and is based in Bærum, Norway.",
    "description_length": 1232
  },
  {
    "ticker": "AKER.OL",
    "company_name": "Aker ASA",
    "sector": "Industrials",
    "industry": "Conglomerates",
    "original_description": "Aker ASA operates as an industrial investment company in Norway, Europa, North America, South America, and internationally. The company operates in two segments: Industrial Holdings and Financial Investments. It is involved in exploration and production of oil and gas; provision of solutions, products, and engineering services to the energy industry; development of renewable energy and green technologies; and provision of vessels to global offshore energy markets. In addition, the company develops and supplies krill-based products, and health and nutrition products; harvests krill for ingredients for human and animal nutrition; and farms salmon. Further, it offers Cognite Data Fusion, which collects, structures, and models industrial data throughout the value chain that enables users to share data between partners and suppliers in real time; and digital twin software for the digital representation of physical assets. Additionally, the company provides other listed investments, cash holdings, asset management, interest-bearing receivables, and other equity investments and assets, as well as engages in real estate activities. The company was founded in 1841 and is based in Lysaker, Norway. Aker ASA operates as a subsidiary of TRG Holding AS.",
    "description_length": 1259
  },
  {
    "ticker": "AKRBP.OL",
    "company_name": "Aker BP ASA",
    "sector": "Energy",
    "industry": "Oil & Gas E&P",
    "original_description": "Aker BP ASA explores for, develops, and produces oil and gas on the Norwegian Continental Shelf. The company was formerly known as Det norske oljeselskap ASA and changed its name to Aker BP ASA in October 2016. Aker BP ASA was founded in 2001 and is based in Lysaker, Norway.",
    "description_length": 275
  },
  {
    "ticker": "AKBM.OL",
    "company_name": "Aker BioMarine ASA",
    "sector": "Consumer Defensive",
    "industry": "Packaged Foods",
    "original_description": "Aker BioMarine ASA, a biotech innovator, develops and supplies krill-derived products for consumer health and wellness worldwide. It operates through three segments: Human Health Ingredients (HHI), Consumer Health Products, and Emerging Business. The Human Health Ingredients segment sells B2B krill oil supplements for humans under the Superba Krill brand; supplements for brain health under the LYSOVETA brand; and marine-origin DHA omega-3 from microalgae under the Revervia brand name, as well as advanced phospholipid technology under PL+ name. The Consumer Health Products segment sells processed and packaged krill, fish, and plants derived raw materials to retailers in the United States. The Emerging Business segment offers krill oil under Kori brand name. The company provides protein solutions under the Understory brand; biostimulants under KRBNX brand; and a therapeutic candidate based on omega-3 to manage and treat cardiometabolic diseases under CaPre brand name, as well as delivers circular products utilizing recycled industrial and marine plastic waste under AION name. Aker BioMarine ASA was founded in 2006 and is headquartered in Lysaker, Norway. Aker BioMarine ASA is a subsidiary of Aker ASA.",
    "description_length": 1218
  },
  {
    "ticker": "ACC.OL",
    "company_name": "Aker Carbon Capture ASA",
    "sector": "Industrials",
    "industry": "Pollution & Treatment Controls",
    "original_description": "Aker Carbon Capture ASA operates as a carbon capture company. The company operates a carbon capture plant; and engages in the downstream processing and management of CO2. It also offers aftermarket support services to industrial plant owners and operators across various industries to reduce and remove CO2 emissions. The company operates carbon capture plants under the Just Catch, Big Catch, Just Catch Offshore, and Mobile Test Unit brands. It operates in Norway, Denmark, Sweden, the United Kingdom, the Netherlands, India, and the United States. Aker Carbon Capture ASA was incorporated in 2020 and is headquartered in Lysaker, Norway.",
    "description_length": 640
  },
  {
    "ticker": "AKH.OL",
    "company_name": "Aker Horizons ASA",
    "sector": "Utilities",
    "industry": "Utilities - Renewable",
    "original_description": "Aker Horizons ASA, through its subsidiaries, develops and invests in renewable energy and green technology private and public companies worldwide. It operates through Aker Carbon Capture; Asset Development; Mainstream Renewable Power; Aker Horizons and holdings; and Other segments. The company offers modular and capture units for reducing and removing carbon dioxide emissions of various industries, including the cement, bio and waste-to-energy, gas-to-power and blue hydrogen segments. It also develops, owns, and operates industrial-scale hydrogen projects for industries, such as shipping, steel, and fertilizers; and operates onshore and offshore wind and solar power generation. It operates in Australia, Norway, Korea, Ireland, Chile, South Africa, Indonesia, Colombia, the united states, UK, Germany, and internationally. The company was incorporated in 2020 and is based in Lysaker, Norway. Aker Horizons ASA operates as a subsidiary of Aker Capital ASA.",
    "description_length": 965
  },
  {
    "ticker": "AKSO.OL",
    "company_name": "Aker Solutions ASA",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "Aker Solutions ASA provides solutions, products, systems, and services to the oil and gas industry in Norway, the United States, Brazil, the United Kingdom, Malaysia, Angola, Brunei, Canada, India, and internationally. The company operates in two segments, Renewables and Field Development; and Life Cycle. It offers field planning, feasibility, and concept studies; specialist engineering, project management, and procurement services; floater designs, offshore wind, as well as engages in design, delivery, and construction of oil and gas production, and receiving and processing facilities. The company provides carbon capture, utilization and storage, hydropower, and offshore wind solutions. Further, it designs and constructs jackets for construction services and offers electrification services; and designs and constructs offshore oil and gas production facilities and onshore receiving and processing facilities. Additionally, the company provides maintenance, modifications, decommissioning, asset integrity management, hook-up, and completion solutions. The company was founded in 1841 and is headquartered in Fornebu, Norway.",
    "description_length": 1137
  },
  {
    "ticker": "ARCH.OL",
    "company_name": "Archer Limited",
    "sector": "Energy",
    "industry": "Oil & Gas Drilling",
    "original_description": "Archer Limited, together with its subsidiaries, provides various oilfield products and services to the oil and gas industry in Norway, Argentina, the United Kingdom, and internationally. It operates in four segments: Platform Operations, Well Services, Renewables, and Land Drilling. The company offers platform drilling and workover, platform plug and abandonment, MODU Management, modular rigs, rentals, drill pipe pool, project management and consulting, construction and installations, and inspection services. It also provides well services, including coiled tubing, oiltools, wireline, well construction and completion, well intervention and workover, well P&A and slot recovery, surface solutions, geothermal, and CCUS. In addition, the company offers land drilling services, including drilling rigs and workover services. Further, the company provides renewable energy, such as geothermal drilling, district heating, carbon storage, floating offshore wind, wind power, and hydropower services. The company was formerly known as Seawell Limited and changed its name to Archer Limited in May 2011. Archer Limited was incorporated in 2007 and is headquartered in Sandnes, Norway.",
    "description_length": 1184
  },
  {
    "ticker": "AZT.OL",
    "company_name": "ArcticZymes Technologies ASA",
    "sector": "Healthcare",
    "industry": "Biotechnology",
    "original_description": "ArcticZymes Technologies ASA, a life sciences company, develops, manufactures, and commercializes recombinant enzymes for use in molecular research, in vitro diagnostics, and biomanufacturing. The company offers shrimp alkaline phosphatase for cleanup prior to Sanger sequencing and next generation sequencing processes; cod UNG for use in viral and other molecular diagnostic assays for the removal of contaminating dU-DNA; salt active nucleases for the removal of nucleic acids during manufacturing of viral vectors, recombinant proteins, and other reagents; and double-strand specific DNases and derived kits for the removal of double stranded DNA. It also provides DNA/RNA polymerases for technology development for life science, molecular diagnostics, NGS, and synthetic biology; proteinase for microbiological diagnostics and liquid biopsies; and ligases for joining nucleic acids. The company serves the molecular tools, such as research and diagnostics, and biomanufacturing markets. It operates in Norway, Germany, Lithuania, France, Italy, the United Kingdom, rest of Europe, the United States, and internationally. The company was formerly known as Biotec Pharmacon ASA and changed its name to ArcticZymes Technologies ASA in June 2020. ArcticZymes Technologies ASA was founded in 1990 and is headquartered in Tromsø, Norway.",
    "description_length": 1336
  },
  {
    "ticker": "AFK.OL",
    "company_name": "Arendals Fossekompani ASA",
    "sector": "Industrials",
    "industry": "Conglomerates",
    "original_description": "Arendals Fossekompani ASA, an industrial investment company, provides cyber secure satellite and mobile communications in Norway, Europe, Asia, and North America. It operates through AFK Vannkraft, Group Management, NSSL Global, ENRX, Tekna, AFK Eiendom, and Alytic segments. The company offers voice and data services, and IT support services; and airtime, projects, hardware, and service to the maritime sector, the military and government sector, large international corporations, and the energy sector. It also generates power through hydropower plants; and owns a portfolio of companies. In addition, it offers wireless induction charging solutions to the automotive, renewable energy/wind energy, pipe fabrication, electronics, and cable and mechanical engineering; materials and plasma systems; and high-purity metal powders for applications, such as 3D printing in the aerospace, medical and consumer electronics sectors, as well as optimized induction plasma systems for industrial research and production. Further, the company is involved in property investments. Additionally, it owns and develops various residential and commercial properties. Arendals Fossekompani ASA was founded in 1896 and is headquartered in Arendal, Norway.",
    "description_length": 1242
  },
  {
    "ticker": "ARR.OL",
    "company_name": "Arribatec Group ASA",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "original_description": "Arribatec Group ASA, a software and consulting company, provides digital business solutions in Norway, Europe, the Americas, and internationally. It operates through five segments: Enterprise Architecture and Business Process Management, Cloud Services, Business Services, Marine, and Hospitality. It offers software and services to support corporate governance. It also offers cloud services, including consulting, outsourcing, and end-to-end cloud services. In addition, it engages in the development, implementation, and consulting of the asset management system solutions. Further, the company provides IT services, which comprise IT operation, security, network, backup, cloud solutions, Microsoft 365, GDPR, datacenter, and hardware; and offers solutions for businesses, including ERP systems, integrations, health checks, develops, HR and payroll, financial and project planning, bank solutions, and travel and expenses. Additionally, it provides solutions for self-check-in/check-out and payments for the hospitality industry. Its solutions include QualiWare, a management system that structures and visualizes processes, activities, regulations, and requirements; Unit4 solutions; RamBase, an ERP business solution that gives control over the value chain; Power BI solutions; Hypergene, a business management tool; Adra Suite that integrates with other financial systems; CatalystOne and Pagero that ensures compliance with legal and electronic billing requirements; and Vena, a planning platform that empowers and inspires finance, operations, and business. The company also offers various products, including SAP, Microsoft, Orbus Software, Semine, Prophix, and Creatio. Arribatec Group ASA was incorporated in 1998 and is headquartered in Oslo, Norway.",
    "description_length": 1764
  },
  {
    "ticker": "ATEA.OL",
    "company_name": "Atea ASA",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "original_description": "Atea ASA provides IT infrastructure and related solutions for businesses and public sector organizations in the Nordic countries and Baltic regions. The company offers data center and networking solutions comprising cloudtrack, continuity planning, backup as a service, managed data center, cloud intelligence service, and disaster recovery services. It is also involved in software licensing and cloud solutions. In addition, the company provides business intelligence, Internet of Things, artificial intelligence, and machine learning services. Further, it offers IT security lifecycle management, and digital workplace solutions, as well as information security and managed IT security services. Atea ASA was founded in 1968 and is headquartered in Oslo, Norway.",
    "description_length": 765
  },
  {
    "ticker": "ASAS.OL",
    "company_name": "Atlantic Sapphire ASA",
    "sector": "",
    "industry": "",
    "original_description": "",
    "description_length": 0
  },
  {
    "ticker": "ASA.OL",
    "company_name": "Atlantic Sapphire ASA",
    "sector": "Consumer Defensive",
    "industry": "Farm Products",
    "original_description": "Atlantic Sapphire ASA, together with its subsidiaries, engages in the production and sale of land-based salmon in Denmark and the United States. The company offers its product under Bluehouse Salmon, and Sapphire Salmon brand name. It serves retailers, restaurants, and other customers. The company was incorporated in 2010 and is headquartered in Vikebukt, Norway.",
    "description_length": 365
  },
  {
    "ticker": "AURG.OL",
    "company_name": "Aurskog Sparebank",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Aurskog Sparebank provides various banking products and services for individuals and corporate customers in Norway. The company offers savings accounts; and mortgage, car, construction, and green business loans, as well as bank guarantee, overdraft, and leasing services; and credit cards. It also provides insurance products, including liability, work machine, data attack, farm building, crop operating equipment, property damage, health, homeowners, home, craftsman, commercial vehicle, business, personnel, travel, and occupational injury insurance products, as well as insurance of goods during transport. In addition, the company provides pension, foreign payment, and mobile and online banking services. It operates through its branches in Bjørkelangen, Årnes, Jessheim, Askim, Gjøvik, Nannestad, and Sørumsand in Norway. Aurskog Sparebank was founded in 1846 and is headquartered in Aurskog, Norway.",
    "description_length": 907
  },
  {
    "ticker": "AUSS.OL",
    "company_name": "Austevoll Seafood ASA",
    "sector": "Consumer Defensive",
    "industry": "Farm Products",
    "original_description": "Austevoll Seafood ASA, a seafood company, produces and sells salmon and trout, whitefish, and pelagic in Norway, the European Union, the United Kingdom, Eastern Europe, Africa, North America, Asia, and South America. The company owns and operates fishing vessels; and sells and distributes various fish species and processed fish products. It also produces white fish products, fish meals, and fish oils; omega-3 oil; and canned and frozen fish products. The company was incorporated in 1981 and is based in Storebø, Norway. Austevoll Seafood ASA is a subsidiary of Laco AS.",
    "description_length": 574
  },
  {
    "ticker": "AUTO.OL",
    "company_name": "AutoStore Holdings Ltd.",
    "sector": "Technology",
    "industry": "Computer Hardware",
    "original_description": "AutoStore Holdings Ltd. provides robotic and software technology in Norway, Germany, Europe, the United States, Asia, and internationally. It offers controllers, robots, grids, bins, and ports. The company offers robots, including R5, R5+, R5 Pro, and R5+ Pro under the Red Line names; AutoStore Bin Lift Grid-to-Grid (G2G) configuration; AutoStore Grid; AutoStore Multi-Temperature Solution, a storage solution for frozen and chilled environments; Grid Bracer; controller module for warehouse operations; QubIt fulfillment software and platform; and Unify Analytics data platform. It also provides CarouselAI, an automated robotic picking workstation solution; VersaPort, a cost-effective workstation; ConveyorPort, a workstation to access bins in the AutoStore grid; CarouselPort that maintains workstation productivity and coordination between robot and man; SwingPort, a work space outside of the storage are; RelayPort workstation; PickUpPort which provides frictionless in-store pickup options; FusionPort workstation; and FusionPort Staging. In addition, the company offers installation, maintenance, and training of personnel services. It serves grocery, retail, third party logistic, industrials, and healthcare industries. The company was formerly known as AutoStore NewCo Ltd. and changed its name to AutoStore Holdings Ltd. in October 2021. AutoStore Holdings Ltd. was founded in 1996 and is headquartered in Nedre Vats, Norway.",
    "description_length": 1441
  },
  {
    "ticker": "ACR.OL",
    "company_name": "Axactor ASA",
    "sector": "Financial Services",
    "industry": "Credit Services",
    "original_description": "Axactor ASA, through its subsidiaries, operates as a debt management and collection company in Sweden, Finland, Germany, Italy, Norway, and Spain. It operates through two segments: Non-performing Loans and Third-Party Collection. The Non-performing Loans segment invests in portfolios of non-performing loans collected through amicable or legal proceedings. Its Third-Party Collection segment provides debt collection services on behalf of third-party clients, which applies amicable and legal proceedings to collect the non-performing loans. This segment also involved in helping creditors to prepare documentation for future legal proceedings against debtors; and handling of invoices between the invoice date and the default date and sending out reminders. Axactor ASA was incorporated in 1982 and is headquartered in Oslo, Norway.",
    "description_length": 834
  },
  {
    "ticker": "B2I.OL",
    "company_name": "B2 Impact ASA",
    "sector": "Financial Services",
    "industry": "Credit Services",
    "original_description": "B2 Impact ASA, together with its subsidiaries, provides various debt solutions. Its business consists of purchase, management, and collection of unsecured and secured non-performing loans. The company also provides debt purchase and collection; and telemarketing, fraud prevention, and credit information services. It operates in Norway, Sweden, Denmark, Finland, Norway, Estonia, Latvia, Lithuania, Poland, Spain, the Czech Republic, Italy, France, Romania, Greece, Cyprus, Slovenia, Croatia, and Serbia. The company was formerly known as B2Holding SAS and changed its name to B2 Impact ASA in September 2023. B2 Impact ASA was incorporated in 2008 and is headquartered in Oslo, Norway.",
    "description_length": 687
  },
  {
    "ticker": "BEWI.OL",
    "company_name": "BEWI ASA",
    "sector": "Consumer Cyclical",
    "industry": "Packaging & Containers",
    "original_description": "BEWI ASA, together with its subsidiaries, produces, markets, and sells packaging, components, and insulation solutions in Norway and internationally. The company operates through Insulation & Construction, Packaging & Components, and Circular segments. The Insulation & Construction segment develops and manufactures insulation solutions for the building and construction industry, including foundations, walls, roofs, and ceilings for domestic housing and industrial buildings, as well as infrastructure projects; and offers insulation boards from polyisocyanurate and mineral wool sandwich panels. The Packaging & Components segment develops and manufactures standard and customized packaging solutions, including boxes for transportation of fresh fish, and protective packaging for pharmaceuticals and electronics; and delivers technical components to various industries, such as automotive components and components to heating, ventilation, and air condition systems. The Circular segment produces recycled general-purpose polystyrene; offers various solutions within waste management; collects, recycles, and trades used materials; and operates collection stations in various countries. The company operates in Sweden, Finland, Denmark, Norway, Iceland, the Netherlands, Belgium, Portugal, Spain, Poland, Germany, the United Kingdom, France, Lithuania, Czech Republic, Switzerland, Austria, the United States, and Canada. BEWI ASA was founded in 1980 and is headquartered in Trondheim, Norway. BEWI ASA operates as a subsidiary of BEWI Invest AS.",
    "description_length": 1551
  },
  {
    "ticker": "BWE.OL",
    "company_name": "BW Energy Limited",
    "sector": "Energy",
    "industry": "Oil & Gas E&P",
    "original_description": "BW Energy Limited, together with its subsidiaries, engages in the exploration and production of oil and gas properties. The company holds interests in various shallow- and deep-water assets located in Gabon, Brazil, and Namibia. BW Energy Limited was founded in 2016 and is based in Hamilton, Bermuda. BW Energy Limited is a subsidiary of Bw Group Limited.",
    "description_length": 356
  },
  {
    "ticker": "BWLPG.OL",
    "company_name": "BW LPG Limited",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "BW LPG Limited, an investment holding company, engages in ship owning and chartering activities worldwide. It operates through Shipping and Product Services segments. The company engages in the transportation of liquefied petroleum gas (LPG); provision of integrated LPG delivery services, as well as management services; wholesale and trade of LPG; and investment in commercial enterprises. As of December 31, 2024, it owned and operated a fleet of 55 vessels, including 53 very large gas carriers (of which 29 were owned), 2 large gas carriers time chartered in by product services, and 8 VLGCs owned by BW LPG India Pte. Ltd. The company was formerly known as BW Gas LPG Holding Limited and changed its name to BW LPG Limited in September 2013. BW LPG Limited was founded in 1935 and is headquartered in Singapore.",
    "description_length": 817
  },
  {
    "ticker": "BWO.OL",
    "company_name": "BW Offshore Limited",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "BW Offshore Limited engages in the engineering of offshore production solutions in the Americas, Europe, Africa, Asia, and the Pacific. It operates through Floating Production, Storage, and Offloading (FPSO); and Floating Wind segments. The company builds, owns, and operates FPSO assets for oil and gas industries. It also provides engineering, procurement, construction, and installation services for FPSO vessels and floating offshore wind energy projects. BW Offshore Limited was founded in 1982 and is based in Hamilton, Bermuda.",
    "description_length": 534
  },
  {
    "ticker": "BGBIO.OL",
    "company_name": "BerGenBio ASA",
    "sector": "Healthcare",
    "industry": "Biotechnology",
    "original_description": "BerGenBio ASA, a clinical-stage biopharmaceutical company, engages in the development of medicines to treat drug resistant, metastatic cancers, and respiratory disease in Norway. It develops BGBIL025, a JAK2 inhibitor indicated, which is in Ph1b/2a for treatment of the bone marrow disorder myelofibrosis. The company was incorporated in 2007 and is based in Bergen, Norway.",
    "description_length": 374
  },
  {
    "ticker": "BIEN.OL",
    "company_name": "Bien Sparebank ASA",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Bien Sparebank ASA operates as a savings bank that provides a range of banking and financial products and services to individuals and business customers in Norway and internationally. It operates through Retail Market and Corporate Market segments. The company offers bank, BSU, mutual funds, and retirement savings; business, tax withholding, investment, deposit, currency, agricultural, and client accounts, as well as group account systems; pension schemes; car and mortgage loans; loans for motorcycles, motorhomes, and ATVs; senior loans; bank guarantees, overdrafts, construction and business loans, leasing solutions, and factoring and invoice management; insurance products for company and employees, cars and other vehicles, agriculture, house and belongings, travel, life and health, and animals; and payment solutions. It also provides bank, credit, and value cards; bankID; foreign payment; eInvoice, in-store cash services, payment terminals, and nets customer portals; and mobile and online banking services. Bien Sparebank ASA was founded in 1885 and is based in Oslo, Norway.",
    "description_length": 1091
  },
  {
    "ticker": "BNOR.OL",
    "company_name": "BlueNord ASA",
    "sector": "Energy",
    "industry": "Oil & Gas E&P",
    "original_description": "BlueNord ASA, an oil and gas company, engages in the production and development of resources that support the energy transition towards net zero in Norway, Denmark, the Netherlands, and the United Kingdom. The company is involved in the exploration and oil and gas infrastructure activities. Its asset portfolio includes the Dan, Halfdan, Gorm, and Tyra hubs; and producing fields on the Danish continental shelf. The company was formerly known as Norwegian Energy Company ASA and changed its name to BlueNord ASA in April 2023. BlueNord ASA was founded in 2005 and is headquartered in Oslo, Norway.",
    "description_length": 599
  },
  {
    "ticker": "BONHR.OL",
    "company_name": "Bonheur ASA",
    "sector": "Industrials",
    "industry": "Conglomerates",
    "original_description": "Bonheur ASA, together with its subsidiaries, engages in the renewable energy, wind service, and cruise businesses in the United Kingdom, Norway, Europe, Asia, the Americas, Africa, and Internationally. The company operates through four segments: Renewable Energy, Wind Service, Cruise, and Other Investments. The Renewable Energy segment develops, constructs, and operates wind farms with an installed capacity of 804.9 megawatts (MW). The Wind Service segment owns and operates three self-propelled jack-up vessels for the transportation, installation, and service of offshore and onshore wind turbines; and offers installation and blade repair services to onshore and offshore wind turbine industry, as well as marine transportation services for offshore wind turbine components. The Cruise segment owns and operates three ocean cruise ships and provides cruise holidays. The Other Investments segment offers publications and PR software services under DN Media Group; software as-a-service under NHST Marketing Technology comprising MyNewsDesk; and invests in real estate properties, bonds, and shares. Bonheur ASA was founded in 1848 and is headquartered in Oslo, Norway.",
    "description_length": 1175
  },
  {
    "ticker": "BOR.OL",
    "company_name": "Borgestad ASA",
    "sector": "Industrials",
    "industry": "Building Products & Equipment",
    "original_description": "Borgestad ASA focuses on real estate and refractory in Norway. The company also develops and manages real estate properties. It operates Agora Bytom, a shopping center and a rental area, as well as a parking garage with parking spaces in Poland. Borgestad ASA was founded in 1904 and is headquartered in Lysaker, Norway.",
    "description_length": 320
  },
  {
    "ticker": "BRG.OL",
    "company_name": "Borregaard ASA",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "original_description": "Borregaard ASA engages in the development, production, and marketing of specialized biochemicals and biomaterials in Norway, rest of Europe, Asia, the United States, and internationally. It operates in three segments: BioSolutions, BioMaterials, and Fine Chemicals. The company develops, produces, and sells biopolymers and biovanillin for agrochemicals, batteries, industrial binders, and construction, as well as to flavour and fragrance companies, and food and beverage industry. It also develops, produces, and sells speciality cellulose for use as a raw material in the production of cellulose ethers, cellulose acetate, and other specialty products; and cellulose fibrils for industrial applications. In addition, the company provides fine chemical intermediates for contrast agents; and advanced bioethanol products. Borregaard ASA was incorporated in 2012 and is headquartered in Sarpsborg, Norway.",
    "description_length": 906
  },
  {
    "ticker": "BOUV.OL",
    "company_name": "Bouvet ASA",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "original_description": "Bouvet ASA provides IT and digital communication consultancy services for public and private sectors in Norway, Sweden, and internationally. The company was incorporated in 1995 and is headquartered in Oslo, Norway.",
    "description_length": 215
  },
  {
    "ticker": "BMA.OL",
    "company_name": "Byggma ASA",
    "sector": "Industrials",
    "industry": "Building Products & Equipment",
    "original_description": "Byggma ASA, together with its subsidiaries, manufactures and supplies building materials in Norway, the United Kingdom, Sweden, Finland, Denmark, and internationally. It operates through Panels, Beams, Windows, and Lighting segments. The company offers pre-painted ceilings and wall panels under the Huntonit brand; I-beams for use in ceilings, walls, and floors for wood-based buildings under the Masonite brand; and particle boards, boards, and structural panels for use in buildings, interior ceilings, and wall panels under the Forestia brand. It also provides doors and windows for new buildings, extensions, and rehabilitations under the Uldal brand; and a range of lighting products, such as decorative home lighting, lampshades, and professional functional lighting products under the Aneta Lighting brand. In addition, the company develops, manufactures, and distributes MDF panels for walls, ceilings, bathrooms, and kitchens under the Smartpanel brand. It sells its products through dealers and electrical wholesalers. The company was founded in 1997 and is headquartered in Vennesla, Norway. Byggma ASA is a subsidiary of Investor As.",
    "description_length": 1146
  },
  {
    "ticker": "CAVEN.OL",
    "company_name": "CAVENDISH HYDROGEN ASA",
    "sector": "Utilities",
    "industry": "Utilities - Regulated Gas",
    "original_description": "Cavendish Hydrogen ASA, a hydrogen fueling company, engages in development, production, marketing, sale, installation, commissioning, and service of equipment for fueling hydrogen to on-road vehicles in Denmark, the United States, South Korea, and Austria. The company's product includes the H2Station, which consists of various types of hydrogen fueling stations that provide fuel for fuel cell electric vehicles (FCEV), including cars, vans, buses, and trucks. It also offers project execution, site engineering, installation, commissioning, operation support, and maintenance services, as well as sale of spare parts. Cavendish Hydrogen ASA was founded in 2003 and is headquartered in Oslo, Norway.",
    "description_length": 701
  },
  {
    "ticker": "CADLR.OL",
    "company_name": "Cadeler A/S",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "original_description": "Cadeler A/S, together with its subsidiaries, engages in offshore wind farm installation, operations, and maintenance services in Denmark. The company engages in the transportation, installation, and maintenance of offshore wind turbine generators and platform topsides/substations; maintenance of offshore structures and platforms; offshore construction, decommissioning, accommodation, and crane support within the renewable space; heavy lift and project cargo; and salvage assistance, as well as transport and installation of wind turbine foundations; and marine and engineering operations. It also owns and operates five offshore jack-up windfarm installation vessels. Cadeler A/S was incorporated in 2008 and is headquartered in Copenhagen, Denmark.",
    "description_length": 753
  },
  {
    "ticker": "CAPSL.OL",
    "company_name": "Capsol Technologies ASA",
    "sector": "Industrials",
    "industry": "Pollution & Treatment Controls",
    "original_description": "Capsol Technologies ASA provides carbon capture technology solutions using hot potassium carbonate solvent in the Europe, the United States, and internationally. The company's products portfolio comprises Capsol end-of-pipe (EOP), a flexible EOP carbon capture solution; CapsolGo, a carbon capture demonstration unit; and CapsolGT, that consists of gas turbines with carbon capturing solutions. Its products are used in various segments, including cement, Energy-from-waste, Bio-energy, Gas turbines, and Other industries. The company was formerly known as CO2 Capsol AS and changed its name to Capsol Technologies ASA in June 2023. Capsol Technologies ASA was founded in 2014 and is based in Oslo, Norway.",
    "description_length": 706
  },
  {
    "ticker": "CRNA.OL",
    "company_name": "Circio Holding ASA",
    "sector": "Healthcare",
    "industry": "Biotechnology",
    "original_description": "Circio Holding ASA, a biotechnology company, develops novel circular RNA and immunotherapy medicines. The company is developing TG01, a cancer vaccine targeting driver mutations, which is in three clinical trials for multiple myeloma, and pancreatic and lung cancer; and circVec circRNA vector platform, a modular genetic cassette for biogenesis of multifunctional circRNAs in human cells. It has a collaboration with Certest Biotec, S.L. for formulation of circVec. The company was formerly known as Targovax ASA and changed its name to Circio Holding ASA in May 2023. The company was incorporated in 2010 and is based in Oslo, Norway.",
    "description_length": 636
  },
  {
    "ticker": "CLOUD.OL",
    "company_name": "Cloudberry Clean Energy ASA",
    "sector": "Utilities",
    "industry": "Utilities - Renewable",
    "original_description": "Cloudberry Clean Energy ASA operates as a renewable energy company in Norway, Denmark, Switzerland, and Sweden. It operates through Projects, Commercial, and Asset Management segments. The company engages in the ownership, development, management, and operation of hydropower plants and wind farms, as well as solar power and energy storage projects. Cloudberry Clean Energy ASA was founded in 2017 and is based in Oslo, Norway.",
    "description_length": 428
  },
  {
    "ticker": "CMBTO.OL",
    "company_name": "Cmb.Tech NV",
    "sector": "Energy",
    "industry": "Oil & Gas Midstream",
    "original_description": "Cmb.Tech NV engages in marine transportation business in Belgium. It operates through three divisions: Marine, H2 Infra, and H2 Industry. The Marine division owns and operates fleet of crude oil tankers, bulk carriers, container ships, chemicals, offshore wind support vessels, tugboats, and ferries. The H2 Infra division develops and secures green molecule supplies; and produces and distributes green hydrogen and ammonia. The H2 Industry division provides scalable dual-fuel industrial applications. The company was formerly known as Euronav NV and changed its name to Cmb.Tech NV in October 2024. Cmb.Tech NV was incorporated in 2003 and is headquartered in Antwerp, Belgium. Cmb.Tech NV is a subsidiary of CMB NV.",
    "description_length": 719
  },
  {
    "ticker": "CONTX.OL",
    "company_name": "ContextVision AB (publ)",
    "sector": "Healthcare",
    "industry": "Health Information Services",
    "original_description": "ContextVision AB (publ), a software company, provides image analysis and imaging for medical systems in South Korea, China, Japan, the United States, and internationally. The company offers image quality solutions for ultrasound, as well as its Rivent platform comprising Rivent, a 2D image enhancement; Rivent Plus, a premium 2D image enhancement product; Rivent 3D, a solution for improving image quality of 3D ultrasound; and Rivent Mobile, a 2D image enhancement for handheld devices for diagnostics in various fields, including radiology, cardiology, women's health, veterinary medicine, and point of-care applications. It also provides Altumira platform, which features scatter correction and improves radiography by enabling radiation dose reduction while enhancing image quality, such as Altumira for static applications; and Altumira Plus for dynamic applications. In addition, the company offers image quality solutions for MRI including GOPView MRI2Plus for the requirements of each application, sequence type, and protocol; and implementation projects, software updates, and upgrades and product support services. It has a strategic clinical development partnership with the University of Washington School of Medicine for collecting medical imaging data to identify a multiparametric biomarker for the screening and staging of the liver disease MASLD; and research partnership with AMRA Medical to develop AI-powered, organ-specific imaging solutions that enable MASLD screening and physiological quantification. ContextVision AB (publ) was incorporated in 1989 and is headquartered in Stockholm, Sweden.",
    "description_length": 1617
  },
  {
    "ticker": "DNB.OL",
    "company_name": "DNB Bank ASA",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "DNB Bank ASA provides financial services to individuals and businesses in Norway and internationally. The company offers savings, current, currency, client, tax withholding, and pension accounts; fixed rate and security deposits; home and cabin mortgages, construction and fixed-rate loans, car and consumer loans, business loans, and refinancing; home equity credit lines; car, house, home contents, travel, personal, and non-life insurance products; payment services; and online and mobile banking services, as well as cards. It also provides overdraft facilities; leasing services; factoring, supply chain, and receivable purchase financing services; bank guarantees; secure trading, documentary collection, and letter of credit services; investment banking services, such as mergers and acquisitions, equity and debt capital market, loans, bonds, convertible bonds, direct lending, and other private placements; and private financing and commodities, as well as equity trading, foreign exchange, research, share and stock market, securities, and risk advisory services. In addition, the company offers treasury management, working capital, trade finance, equipment financing, real estate broking, and corporate finance services. DNB Bank ASA was founded in 1822 and is headquartered in Oslo, Norway.",
    "description_length": 1303
  },
  {
    "ticker": "DNO.OL",
    "company_name": "DNO ASA",
    "sector": "Energy",
    "industry": "Oil & Gas E&P",
    "original_description": "DNO ASA engages in the exploration, development, and production of oil and gas assets in the Middle East, the North Sea, and West Africa. The company holds75% operating interests in the Tawke and Peshkabir fields located in the Kurdistan; and 9% interest in Côte d'Ivoire's Block CI-27 located in West Africa. It also holds licenses in reservoirs, including in the Cretaceous, Jurassic and Triassic formations; and 85 offshore licenses in Norway, seven offshore licenses in the UK, and one offshore license in the Netherlands. DNO ASA was formerly known as DNO International ASA and changed its name to DNO ASA in June 2014. The company was incorporated in 1971 and is headquartered in Oslo, Norway.",
    "description_length": 699
  },
  {
    "ticker": "DOFG.OL",
    "company_name": "DOF Group ASA",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "original_description": "DOF Group ASA owns and operates a fleet of offshore and subsea vessels. The company operates through DOF Subsea Group, DOF Denmark, DOF Rederi & Iceman, Norskan Offshore, and Corporate segments. It operates a fleet of platform supply vessels (PSVs) that are used to transport freight to/from offshore platforms; anchor handling tug support (AHTS) vessels; Construction Support Vessels (CSV); Remote Operated Vehicles (ROV); Autonomous Underwater Vehicles (AUV); and subsea vessels. The company provides subsea services, including project management, engineering, construction and installation, decommissioning/field abandonment, saturation and air diving, tow, morring and repair, renewables, and survey and positioning, as well as inspection, repair, and maintenance services. In addition, it offers marine management services, such as crewing, mobilization, maintenance, and project and new building services. The company operates a fleet of 6 PSVs, 18 CSVs, and 28 AHTSs, as well as 78 remotely operated vehicles and autonomous underwater vehicles. It operates in Brazil, the United States, Australia, the United Kingdom, Norway, Angola, Mauritania, Guyana, Trinidad and Tobago, the Netherlands, Canada, Israel, the Philippines, Argentina, and internationally. DOF Group ASA was founded in 1981 and is headquartered in Storebø, Norway.",
    "description_length": 1338
  },
  {
    "ticker": "EIOF.OL",
    "company_name": "Eidesvik Offshore ASA",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "Eidesvik Offshore ASA provides services to the offshore supply, subsea, and offshore wind market in Norway. It operates through Supply, Subsea/Offshore Renewables, and Other segments. The company offers services to the offshore oil industry. It also provides shipping services for subsea work for the oil industry, as well as various services for the offshore renewable market. In addition, the company is involved in the provision of cargo supply and transportation of pipes between onshore bases and offshore oilfields; owns and operates a fleet of subsea construction vessels; and construction and module handling, inspections, and maintenance and repair of subsea installation. The company was founded in 2004 and is headquartered in Bømlo, Norway. Eidesvik Offshore ASA is a subsidiary of Eidesvik Invest AS.",
    "description_length": 813
  },
  {
    "ticker": "EMGS.OL",
    "company_name": "Electromagnetic Geoservices ASA",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "Electromagnetic Geoservices ASA, together with its subsidiaries, provides electromagnetic (EM) surveying technology and services to the offshore oil and gas exploration industry. It is involved in the planning, acquisition, processing, modelling, interpretation, and integration of EM data to increase exploration success. The company also uses its patented EM survey method to find hydrocarbons in offshore reservoirs. In addition, it engages in the provision of controlled-source EM surveying and magnetotelluric surveying; imaging and interpretation; rental of software and cluster; and training services, as well as consulting services. The company operates in Europe, the Middle East, Africa, Norway, North and South America, Asia, and the Pacific Ocean. Electromagnetic Geoservices ASA was incorporated in 2002 and is headquartered in Oslo, Norway.",
    "description_length": 854
  },
  {
    "ticker": "ELK.OL",
    "company_name": "Elkem ASA",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "original_description": "Elkem ASA engages in the provision of advanced material solutions worldwide. It operates through Silicones, Silicon Products, and Carbon Solutions segments. The company offers silicones polymers, including silicone oils, compounds, emulsions, grease, and resins, as well as chlorosilanes, heat cured rubber silicone, liquid silicone rubber, and RTV-1 and RTV-2 silicones. It also provides silicon-based materials comprising silicon, silicon powder/micronized silicon, silica fume/ micro-silica, ferrosilicon, and grain refiners. In addition, the company offers foundry alloys, such as preconditioners, recarburizers, conditioners, nodularizers, inserts, and inoculants; and carbon-based materials comprising carbon electrodes, furnace tapping materials, electrode paste, ramming paste, prebaked electrodes, and furnace lining materials, as well as polymer additives, and oilfield and refractories specialty products. It offers its products to electronics, aerospace, healthcare, personal care, packaging, airbag coating, chemicals, aluminium, electronics, automotive, specialty steel, solar, construction, refractories, oil and gas, ferroalloys, silicon, and aluminium industries. The company was founded in 1904 and is based in Oslo, Norway. Elkem ASA operates as a subsidiary of Bluestar Elkem International Co., Ltd. S.A.",
    "description_length": 1324
  },
  {
    "ticker": "ELABS.OL",
    "company_name": "Elliptic Laboratories ASA",
    "sector": "Technology",
    "industry": "Software - Infrastructure",
    "original_description": "Elliptic Laboratories ASA, an artificial intelligence (AI) software company, engages in the provision of AI virtual smart sensors for the smartphone, laptop, Internet of Things, and automotive markets in Norway, the United States, China, South Korea, Taiwan, and Japan. The company offers AI Virtual Human Presence Sensor, a presence-detection solution used to improve the security of data stored on devices and to allow intuitive responses based on natural human interaction; AI Virtual Proximity Sensor that enables exquisite full-screen devices; and AI Virtual Connection Sensor that allows to pair and authenticate smart devices in the same room. It also provides AI Virtual Position Sensor which automatically detects the location of an external display in relation to a laptop; AI Virtual Gesture Sensor that enables touchless user interactions; AI Virtual Breathing sensor that enables to track person's breathing; and AI Virtual heart Sensor that tracks a person's heart rate. The company was incorporated in 2006 and is headquartered in Oslo, Norway.",
    "description_length": 1059
  },
  {
    "ticker": "ELMRA.OL",
    "company_name": "Elmera Group ASA",
    "sector": "Utilities",
    "industry": "Utilities - Regulated Electric",
    "original_description": "Elmera Group ASA, together with its subsidiaries, engages in the purchase, sale, and portfolio management of electrical power to households, private and public companies, and municipalities in Norway, Sweden, and Finland. The company operates through Consumer, Business, and Nordic segments. It sells electrical power and related services to private and business consumers. The company also sells EV chargers and PV panels, as well as provides, mobile services, power sale, payment solutions services, and related services. In addition, it manages, researches, and develops products and services related to electrical power; and provides mobile phone services to private customers. The company was formerly known as Fjordkraft Holding ASA and changed its name to Elmera Group ASA in April 2022. Elmera Group ASA was founded in 2001 and is headquartered in Bergen, Norway.",
    "description_length": 871
  },
  {
    "ticker": "ELO.OL",
    "company_name": "Elopak ASA",
    "sector": "Consumer Cyclical",
    "industry": "Packaging & Containers",
    "original_description": "Elopak ASA manufactures and supplies paper-based packaging solutions for liquid food in Europe, the Middle East, Africa, Asia, the Americas, and internationally. It offers Pure-Pak cartons for chilled and aseptic liquid food; D-PAK cartons for non food products for personal and home care; and filling equipment. It also offers standard flexo, super flexo, UV-flexo, and offset litho printing services, as well as digital print proofs and machine print proofs on paper board. Further, it provides machines and equipment through spare part webshop. Elopak ASA was founded in 1957 and is based in Oslo, Norway.",
    "description_length": 608
  },
  {
    "ticker": "ENDUR.OL",
    "company_name": "Endúr ASA",
    "sector": "Industrials",
    "industry": "Conglomerates",
    "original_description": "Endúr ASA, together with its subsidiaries, operates as a supplier of construction and maintenance projects, services, and solutions for marine infrastructure businesses in Norway and the Norwegian Continental Shelf, Sweden, and internationally. The company operates through three segments: Infrastructure, Aquaculture Solutions, and Other. It constructs and maintains facilities for land-based aquaculture, quays, harbors, dams, bridges, tunnels, groundworks, railways, and other specialized concrete and steel projects. The company also offers maritime, engine, and ship maintenance and repair services; maintenance and repair services for ships, marine vessels, and related equipment; solutions for water quality and fish health; and marine infrastructure construction services, as well as other adjacent services, including hydrographical, dredging, rentals, inspections, and diving. In addition, it produces concrete feed barges for the aquaculture industry. The company serves public and private sector. Endúr ASA is based in Lysaker, Norway.",
    "description_length": 1047
  },
  {
    "ticker": "ENSU.OL",
    "company_name": "Ensurge Micropower ASA",
    "sector": "Technology",
    "industry": "Electronic Components",
    "original_description": "Ensurge Micropower ASA provides energy storage solutions for wearable devices, connected sensors, and other applications in the United States, Europe, and Asia. The company offers solid-state lithium battery technology that enables it to produce rechargeable micro batteries. Its products are used in hearables, medical wearables, sports and fitness wearables, and home and industrial connected devices. The company was formerly known as Thin Film Electronics ASA and changed its name to Ensurge Micropower ASA in June 2021. Ensurge Micropower ASA was founded in 2005 and is headquartered in Oslo, Norway.",
    "description_length": 605
  },
  {
    "ticker": "ENTRA.OL",
    "company_name": "Entra ASA",
    "sector": "Real Estate",
    "industry": "Real Estate Services",
    "original_description": "Entra ASA develops real estate properties in Oslo, Bergen, Drammen, Sandvika, and Stavanger. It owns and operates office and commercial property. The company was founded in 2000 and is headquartered in Oslo, Norway.",
    "description_length": 215
  },
  {
    "ticker": "ENVIP.OL",
    "company_name": "Envipco Holding N.V.",
    "sector": "Industrials",
    "industry": "Pollution & Treatment Controls",
    "original_description": "Envipco Holding N.V., together with its subsidiaries, develops, manufactures, assembles, leases, sells, markets, and services a line of reverse vending machines (RVMs) in the Netherlands, the United States, North America, and Europe. It offers RVMs for convenience stores; Flex, a solution to recycle empty drinks packages; Flex Tri to collect PET bottles, cans, and glass bottles; Optima, a solution for retailers or redemption centers; Envipco Ultra model for the standard-size retail location; HDS model for larger return centers, such as sizable supermarkets, hypermarkets, and redemption centers; Envipco Modula for supermarkets and hypermarkets; and Envipco Quantum for supermarkets, hypermarkets, and municipal recycling centers. Envipco Holding N.V. was incorporated in 1998 and is headquartered in Amersfoort, the Netherlands.",
    "description_length": 835
  },
  {
    "ticker": "EQNR.OL",
    "company_name": "Equinor ASA",
    "sector": "Energy",
    "industry": "Oil & Gas Integrated",
    "original_description": "Equinor ASA, an energy company, engages in the exploration, production, transportation, refining, and marketing of petroleum and other forms of energy in Norway and internationally. It operates through Exploration & Production Norway; Exploration & Production International; Exploration & Production USA; Marketing, Midstream & Processing; Renewables; and Other segments. The company develops carbon capture and storage projects; provides transportation solutions, including pipelines, shipping, trucking, and rail; and develops and explores for renewable energy, such as offshore wind, green hydrogen, and solar power. The company was formerly known as Statoil ASA and changed its name to Equinor ASA in May 2018. Equinor ASA was incorporated in 1972 and is headquartered in Stavanger, Norway.",
    "description_length": 794
  },
  {
    "ticker": "EQVA.OL",
    "company_name": "Eqva ASA",
    "sector": "Utilities",
    "industry": "Utilities - Renewable",
    "original_description": "Eqva ASA, provides technical solutions and services to maritime and land based industries in Norway and internationally. It operates in four segments: Industrial Solutions; Renewables; Real Estate; and Other. The company provides technical installations to the land-based and maritime industry; and develops and operates small-scale hydropower plants. It engages in real estate business. The company was formerly known as Havyard Group ASA and changed its name to Eqva ASA in November 2022. The company was incorporated in 1999 and is headquartered in Kvinnherad, Norway.",
    "description_length": 571
  },
  {
    "ticker": "EPR.OL",
    "company_name": "Europris ASA",
    "sector": "Consumer Defensive",
    "industry": "Discount Stores",
    "original_description": "Europris ASA operates as a discount variety retailer in Norway. It sells own brand and branded merchandise, including laundry and cleaning, pet food and accessories, storage, confectionery and snacks, home and interior, candles, yarn, toys, and seasonal items, as well as groceries, toys, and do it yourself (DIY) products. The company also offers its products through online shopping. Europris ASA was founded in 1992 and is based in Rolvsøy, Norway. The company operates as a subsidiary of Crystal Turquoise BV.",
    "description_length": 513
  },
  {
    "ticker": "FRO.OL",
    "company_name": "Frontline plc",
    "sector": "Energy",
    "industry": "Oil & Gas Midstream",
    "original_description": "Frontline plc, a shipping company, engages in the ownership and operation of oil and product tankers worldwide. The company owns and operates oil and product tankers, such as very large crude carriers (VLCCs), Suezmax tankers, and LR2/Aframax tankers. As of December 31, 2024, it operated a fleet of 81 vessels, including 41 VLCCs, 22 Suezmax tankers, and 18 LR2/Aframax tankers. The company is also involved in the charter, purchase, and sale of vessels. Frontline plc was founded in 1985 and is based in Limassol, Cyprus.",
    "description_length": 523
  },
  {
    "ticker": "GENT.OL",
    "company_name": "Gentian Diagnostics ASA",
    "sector": "Healthcare",
    "industry": "Medical Devices",
    "original_description": "Gentian Diagnostics ASA develops, manufactures, and sells biochemical reagents for use in medical diagnostics and research in the United States, Asia, and Europe. The company offers in-vitro diagnostic reagents for clinical chemistry analyzers, such as Gentian Circulating Calprotectin Immunoassay, a turbidimetric assay used for the measurement of calprotectin in plasma and serum for detection and assessment of inflammation; Gentian Cystatin C Immunoassay test kit, a GFR marker for the diagnosis and therapeutic control of renal function and chronic kidney disease; Gentian Retinol-Binding Protein Immunoassay for detection of retinol-binding protein in human serum and plasma; and Canine CRP Immunoassay test kit, a particle-enhanced turbidimetric immunoassay for quantitative determination of canine C-reactive protein in dog plasma and serum. It also develops NT-proBNP Immunoassay, an aid in the diagnosis, monitoring, and assessment of severity in individuals suspected of having congestive heart failure, which is in product development phase. In addition, the company provides faecal calprotectin immunoassay turbo that offers results of calprotectin concentration in stool supporting diagnosis of inflammatory bowel disease; and faecal pancreatic elastase immunoassay turbo, which allows analysis of pancreatic elastase in stool to aid in diagnosis of pancreatic exocrine insufficiency. Gentian Diagnostics ASA was founded in 2001 and is headquartered in Moss, Norway.",
    "description_length": 1480
  },
  {
    "ticker": "GJF.OL",
    "company_name": "Gjensidige Forsikring ASA",
    "sector": "Financial Services",
    "industry": "Insurance - Property & Casualty",
    "original_description": "Gjensidige Forsikring ASA, together with its subsidiaries, provides general insurance and pension products in Norway, Sweden, Denmark, Finland, Latvia, Lithuania, and Estonia. It operates in four segments: General Insurance Private, General Insurance Commercial, General Insurance Sweden, and Pension. The company offers motor, property, travel, accident and health, general liability, natural perils, agriculture, leisure craft, valuables, medical treatment and expense, disability, income protection, workers' compensation, motor vehicle liability, marine, aviation, transport, fire and other damage to property, assistance, other non-life, and life insurance products, as well as non-proportional non-life reinsurance products. It also provides defined contribution occupational pension schemes for businesses, including disability pension, spouse/cohabitant pension, and child's pension; and individual pension savings agreements. The company sells its products to private individuals, commercial and agricultural customers, and private and commercial markets through various distribution channels comprising customer service centres, office channel, call center, Internet, partners, agents, and external brokers. Gjensidige Forsikring ASA was founded in 1816 and is headquartered in Oslo, Norway.",
    "description_length": 1301
  },
  {
    "ticker": "GOD.OL",
    "company_name": "Goodtech ASA",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "original_description": "Goodtech ASA provides control systems, digitization, and production solutions for production companies in Norway, Sweden, Finland, Europe, and internationally. The company provides a range of in-house developed and partner-driven technologies and customized solutions for energy storage and management, digital transformation maturity, control system for wind power, asset monitoring, manufacturing execution system, technical audit services, business intelligence, cyber security management system, food production line, data hub for industrialized IT/OT architecture, commercial analysis, and WIZX providing data storage and cloud solutions, digital production system, and feasibility study services. It also offers robotic systems for handling, controlling, and logistics of bulk materials under the Portabulk brand; power and electrical, automation, and system integration solutions to industry and power distributors; constructs and rehabilitates transformer stations. The company was founded in 1913 and is headquartered in Oslo, Norway.",
    "description_length": 1043
  },
  {
    "ticker": "GSF.OL",
    "company_name": "Grieg Seafood ASA",
    "sector": "Consumer Defensive",
    "industry": "Farm Products",
    "original_description": "Grieg Seafood ASA, through its subsidiaries, operates as a fish farming company in Norway, the United Kingdom, rest of Europe, the United States, Canada, Asia, and internationally. It engages in the farming, production, and sale of Atlantic salmon. The company was incorporated in 1988 and is based in Bergen, Norway. Grieg Seafood ASA operates as a subsidiary of Grieg Aqua AS.",
    "description_length": 378
  },
  {
    "ticker": "GYL.OL",
    "company_name": "Gyldendal ASA",
    "sector": "Communication Services",
    "industry": "Publishing",
    "original_description": "Gyldendal ASA, through its subsidiaries, engages in the publishing of books in Norway. It also develops, produces, and publishes content, including learning materials for kindergarten, primary school, upper secondary school, students, and other professional market; and sells paper books, e-books, audiobooks, and digital books, and other goods, as well as provides streaming services. The company operates through physical bookstores and online bookstore. Gyldendal ASA was founded in 1925 and is headquartered in Oslo, Norway. Gyldendal ASA operates as a subsidiary of Erik Must AS.",
    "description_length": 584
  },
  {
    "ticker": "HAFNI.OL",
    "company_name": "Hafnia Limited",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Hafnia Limited owns and operates oil product tankers in Bermuda. It operates through Long Range II, Long Range I, Medium Range (MR), Handy size, and Specialized segments. The company transports clean and dirty, refined oil products, vegetable oil, and easy chemicals to national and international oil companies, and chemical companies, as well as trading and utility companies; and owns and operates 207 vessels. It provides ship owning, ship-management, investment, management, corporate support, and agency office services. In addition, the company provides chartering services. Hafnia Limited is based in Singapore.",
    "description_length": 618
  },
  {
    "ticker": "HGSB.OL",
    "company_name": "Haugesund Sparebank",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Haugesund Sparebank, a savings bank, provides various financial products and services to individuals and corporate customers in Norway. Its personal banking products and services include current, deposit, and association accounts; mortgage and consumer loans, as well as car, boat and other vehicle loans; savings accounts, shares and funds, pension savings accounts, and savings for children and young people; vehicle, boat and leisure, house and contents, and life and health insurance plans; and bank and credit cards, mobile and watch payments, payment apps, and online and mobile banking services. The company's corporate banking products and services, such as business loans, overdrafts, agricultural credit, construction loans, agricultural loans, leasing solutions, and bank guarantees; current accounts, payment solutions, online business services, and savings and investment products; and insurance and pension plans. It also offers real estate agency, securities trading, and mobile and online banking services. The company was incorporated in 1928 and is headquartered in Haugesund, Norway.",
    "description_length": 1102
  },
  {
    "ticker": "HAVI.OL",
    "company_name": "Havila Shipping ASA",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Havila Shipping ASA, together with its subsidiaries, engages in the shipping business. It operates and manages offshore service vessels primarily in Norway, the United Kingdom, Denmark, Belgium, the Netherlands, Iceland, Tunisia, the Marshall Islands, and the United States. The company operates a fleet of vessels, including anchor handling vessels, platform supply vessels, rescue recovery vessel, and subsea vessels. Its subsea vessels are used for under water construction work, as well as for support for under water operations; and rescue recovery vessels are used to offer security services, such as oil spill preparedness, fire protection, rescue operation, and recovery at oil installations. In addition, the company offers renewable energy services comprising cable repair, trenching and ploughing, mooring and towing, daughter craft operations, and equipment and goods transportation services. The company was founded in 2003 and is headquartered in Fosnavåg, Norway. Havila Shipping ASA is a subsidiary of Havila Holding AS.",
    "description_length": 1036
  },
  {
    "ticker": "HERMA.OL",
    "company_name": "Hermana Holding ASA",
    "sector": "Financial Services",
    "industry": "Asset Management",
    "original_description": "Hermana Holding ASA was incorporated in 2023 and is headquartered in Oslo, Norway. Hermana Holding ASA operates as a subsidiary of Magnora ASA.",
    "description_length": 143
  },
  {
    "ticker": "HEX.OL",
    "company_name": "Hexagon Composites ASA",
    "sector": "Consumer Cyclical",
    "industry": "Packaging & Containers",
    "original_description": "Hexagon Composites ASA, together with its subsidiaries, provides alternative fuel systems and solutions to commercial vehicles and gas distribution companies worldwide. The company operates in Hexagon Agility and Hexagon Digital Wave segments. It also offers cylinder testing and monitoring technologies. The company was founded in 1985 and is headquartered in Ålesund, Norway.",
    "description_length": 377
  },
  {
    "ticker": "HPUR.OL",
    "company_name": "Hexagon Purus ASA",
    "sector": "Industrials",
    "industry": "Industrial Distribution",
    "original_description": "Hexagon Purus ASA provides hydrogen and battery energy storage solutions. The company offers hydrogen high-pressure type 4 cylinders, stationary storage, refueling and distribution systems and high-pressure gas bundles, as well as hydrogen fuel storage systems, battery systems, and vehicle integration services for fuel cell electric and battery electric vehicles. The company serves passenger vehicle, medium- and heavy-duty, light-duty, distribution systems, bus, stationary storage, maritime, rail, aerospace, aviation, off-highway vehicles, vehicle integration, and refueling system markets. It operates in Norway, Europe, North America, Asia, Australia/Oceania, and internationally. Hexagon Purus ASA was incorporated in 2017 and is headquartered in Oslo, Norway.",
    "description_length": 769
  },
  {
    "ticker": "HSHP.OL",
    "company_name": "Himalaya Shipping Ltd.",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Himalaya Shipping Ltd. provides dry bulk shipping services worldwide. The company serves major commodity trading, commodity and energy transition, and multi-modal transport companies. As of December 31, 2024, it owned and operated through a fleet of 12 Newcastlemax dry bulk vessels, each with capacity in the range of 210,000 dead weight tons. The company was incorporated in 2021 and is based in Hamilton, Bermuda.",
    "description_length": 416
  },
  {
    "ticker": "HBC.OL",
    "company_name": "Hofseth BioCare ASA",
    "sector": "Consumer Defensive",
    "industry": "Packaged Foods",
    "original_description": "Hofseth BioCare ASA produces and sells health nutritional products for humans and pets in Norway, the United Kingdom, France, Belgium, Italy, Germany, rest of Europe, Japan, Asia, and the United States. The company offers ProGo, a bioactive peptide for weight management and metabolic health; OmeGo, a salmon oil that provides a full spectrum of fatty acids and omegas; CalGo and NT-II, which are calcium collagen complexes that support joint and bone health; CollaGo; and PetGo, a non-soluble protein. Hofseth BioCare ASA was founded in 2000 and is headquartered in Ålesund, Norway.",
    "description_length": 583
  },
  {
    "ticker": "HYPRO.OL",
    "company_name": "HydrogenPro ASA",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "original_description": "HydrogenPro ASA engages in designing and delivering green hydrogen technology and systems in Norway, Europe, the United States, and the Asia Pacific. It offers high-pressure alkaline electrolyzers and gas separation units. The company serves synthetic aviation fuel, refinery/decarbonization, power to gas, balancing the grid, steel production, fertilizer/ammonia, and shipping markets. HydrogenPro ASA was incorporated in 2013 and is headquartered in Porsgrunn, Norway.",
    "description_length": 470
  },
  {
    "ticker": "HAUTO.OL",
    "company_name": "Höegh Autoliners ASA",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Höegh Autoliners ASA provides ocean transportation services within the roll-on roll-off (RoRo) cargoes on deep sea and short sea markets in Norway. It operates in two segments, Shipping Services and Logistics Services. Its services include automotive; breakbulk; truck, buses, and trailers; railcars and tramways; mining equipment; agricultural machinery; machinery shipping; construction equipment; power equipment; boats, and yachts shipping; and ocean transportation. The company offers equipment handling, and project cargo logistic services. In addition, it is involved in terminal, management, ship owning, and ship contracts services. As of December 31, 2024, the company operates a fleet of 38 vessels. The company was founded in 1927 and is headquartered in Oslo, Norway.",
    "description_length": 780
  },
  {
    "ticker": "HSPG.OL",
    "company_name": "Høland og Setskog Sparebank",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Høland og Setskog Sparebank provides banking services for the personal and corporate markets in Norway. It offers savings and pension accounts; consumer loans, business loans, mortgage loans, car loans, and loans for motorbikes, ATVs, motorhomes, caravans, snowmobiles, and boats; and refinancing, credit cards, mobile and online banking, bank guarantee, overdrafts, leasing, and factoring and invoice sales, as well as insurance products. The company was formerly known as Holand Sparebank and changed its name to Høland og Setskog Sparebank in 2010. Høland og Setskog Sparebank was founded in 1849 and is headquartered in Bjørkelangen, Norway.",
    "description_length": 645
  },
  {
    "ticker": "IDEX.OL",
    "company_name": "IDEX Biometrics ASA",
    "sector": "Technology",
    "industry": "Software - Application",
    "original_description": "IDEX Biometrics ASA, together with its subsidiaries, designs, develops, and sells fingerprint authentication solutions in Norway, Europe, the Middle East, Africa, the Americas, and the Asia-Pacific regions. The company's fingerprint authentication solutions are used primarily in contactless smart cards that includes financial payment, access control, and digital identity, as well as card-based devices for the storage of digital currencies. It offers IDEX digital access card a multifactor authentication solution; IDEX pay card; IDEX bio java card platform, a fingerprint biometric authentication solution; and IDEX Bio sensor system for biometric algorithms and proprietary silicon technology. It primarily serves smart card manufacturers and similar solution integrators. The company was incorporated in 1996 and is headquartered in Oslo, Norway.",
    "description_length": 852
  },
  {
    "ticker": "IWS.OL",
    "company_name": "Integrated Wind Solutions ASA",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "original_description": "Integrated Wind Solutions ASA, through its subsidiaries, provides offshore wind services in the United Kingdom, the Netherlands, Taiwan, Poland, Belgium, Greece, France, Denmark, Norway, and internationally. It operates through IWS Fleet and IWS Services. The IWS Fleet segment owns and operates construction and service operation vessels. The IWS Services segment provides design, engineering, construction, operation, and management services for onshore and offshore wind industry. The company also provides asset management consulting and advisory, and commercial and technical management services. Integrated Wind Solutions ASA was incorporated in 2020 and is based in Oslo, Norway.",
    "description_length": 686
  },
  {
    "ticker": "IOX.OL",
    "company_name": "Interoil Exploration and Production ASA",
    "sector": "Energy",
    "industry": "Oil & Gas E&P",
    "original_description": "Interoil Exploration and Production ASA, together with its subsidiaries, operates as an upstream oil exploration and production company in Argentina and Colombia. It engages in the acquisition, exploration, development, and operation of oil and natural gas properties. The company's portfolio includes two producing concessions in Colombia; and one exploration and seven production concessions in Argentina. Interoil Exploration and Production ASA was incorporated in 2005 and is headquartered in Oslo, Norway.",
    "description_length": 510
  },
  {
    "ticker": "ITERA.OL",
    "company_name": "Itera ASA",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "original_description": "Itera ASA, together with its subsidiaries, provides digital solutions for businesses and organizations in Norway, Sweden, Ukraine, Denmark, the Czech Republic, Iceland, Poland, and Slovakia. It offers data, artificial intelligence and analytics, development and architecture, test and quality assurance solutions, as well as cloud and application services. The company provides a range of services in the design, digital strategy, consulting and execution, customer experience, cloud transformation, and technology areas. It serves banking and insurance, energy and utilities, industry and manufacturing, defense, health and public services, technology and communication, and products and retail industries. The company was founded in 1989 and is headquartered in Oslo, Norway.",
    "description_length": 777
  },
  {
    "ticker": "JIN.OL",
    "company_name": "Jinhui Shipping and Transportation Limited",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Jinhui Shipping and Transportation Limited, an investment holding company, engages in ship chartering and owning activities in China, Singapore, Japan, Norway, the United Arab Emirates, South Korea, Switzerland, and internationally. The company engages in money lending; property investment activities; and provision of ship management and shipping agent services. It operates a fleet of 25 owned vessels and 8 chartered-in vessels. The company was founded in 1987 and is based in Hong Kong, Hong Kong. Jinhui Shipping and Transportation Limited operates as a subsidiary of Jinhui Holdings Company Limited.",
    "description_length": 606
  },
  {
    "ticker": "JAREN.OL",
    "company_name": "Jæren Sparebank",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Jæren Sparebank engages in providing various financial products and services to individuals and businesses in Norway. It offers checking and savings accounts, and pension accounts. The company also provides deposits; vehicle loans, mortgages, personal loans, and refinancing services; and bank guarantees, construction loans, overdrafts, leasing, and business loans. In addition, it offers car, personal, animal, health, home, private, business, employee, and agricultural insurance products, as well as online and mobile banking, credit and debit cards, payment solutions, digital identification, and asset management services. The company is headquartered in Bryne, Norway.",
    "description_length": 675
  },
  {
    "ticker": "KMCP.OL",
    "company_name": "KMC Properties ASA",
    "sector": "Real Estate",
    "industry": "Real Estate Services",
    "original_description": "KMC Properties ASA does not have significant operations. Previously, it operated as a real estate company. KMC Properties ASA was founded in 2020 and is headquartered in Trondheim, Norway.",
    "description_length": 188
  },
  {
    "ticker": "KID.OL",
    "company_name": "Kid ASA",
    "sector": "Consumer Cyclical",
    "industry": "Specialty Retail",
    "original_description": "Kid ASA, together with its subsidiaries, operates as a home textile retailer in Norway, Sweden, Finland, and Estonia. It designs, sources, markets, and sells a range of home and interior products, including textiles, curtains, bed linens, home accessories, decorations, furniture, and other interior products through retail stores and online platforms. The company offers products for bedroom, bathroom, easter, beds, outdoor spaces, table settings, kitchenware, office accessories, children room, loungewear and accessories, and sun protection, as well as lamps, pillows and blankets, and carpets. It offers its products under the Kid Interior and Hemtex brands. The company was formerly known as Nordisk Tekstil Holding AS and changed its name to Kid ASA. Kid ASA was founded in 1937 and is headquartered in Gullaug, Norway.",
    "description_length": 826
  },
  {
    "ticker": "KIT.OL",
    "company_name": "Kitron ASA",
    "sector": "Technology",
    "industry": "Electronic Components",
    "original_description": "Kitron ASA operates as an electronics manufacturing services provider in Norway, Sweden, Denmark, Lithuania, Germany, Poland, the Czech Republic, India, China, Malaysia, and the United States. The company manufactures and sells electronics that are embedded in the customer's own products; and box-built electronic products. It also provides electronics manufacturing services, including automated assembly of printed circuit boards and higher-level system integration; development services, such as product development, product management, and re-engineering services; and industrialization services, including prototype manufacturing, evaluation of new products, component engineering and database, test development, design and build of high-level assembly lines, and environmental durability testing. In addition, the company offers sourcing and procurement services; logistics and distribution; redesign, repair, and maintenance; product deployment services; cable harness manufacturing and components analysis; and resilience testing services. It markets its services to the connectivity, electrification, industry, medical devices, and defense/aerospace sectors. Kitron ASA was founded in 1962 and is headquartered in Billingstad, Norway.",
    "description_length": 1244
  },
  {
    "ticker": "KCC.OL",
    "company_name": "Klaveness Combination Carriers ASA",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Klaveness Combination Carriers ASA owns and operates combination carriers for the dry bulk shipping and product tanker industries in the Middle East, Australia, Oceania, North East Asia, South America, North America, Europe, Africa, Southeast Asia, and South Asia. The company's vessels transport caustic coda solution, floating fertilizer, molasses, clean petroleum products, heavy liquid cargoes, and various types of dry bulk commodities. It owns and operates eight CABU vessels, three CABU newbuild contracts and eight CLEANBU vessels. The company was formerly known as Klaveness Combination Carriers AS and changed its name to Klaveness Combination Carriers ASA in February 2019. The company was incorporated in 2018 and is headquartered in Oslo, Norway. Klaveness Combination Carriers ASA is a subsidiary of Rederiaksjeselskapet Torvald Klaveness.",
    "description_length": 853
  },
  {
    "ticker": "KOMPL.OL",
    "company_name": "Komplett ASA",
    "sector": "Consumer Cyclical",
    "industry": "Internet Retail",
    "original_description": "Komplett ASA operates as an online retailer of electronics products in Norway, Sweden, and Denmark. It operates through three segments: Business to Consumer (B2C), Business to Business (B2B), and Distribution. The company offers components, gaming, brown goods, peripherals, white goods and home, handheld and accessories, and PCs. It also serves the private consumer market for electronics, technology products, and consumer goods through online shops, selling products sourced from third-party brands and its own private labels under the NetOnNetm, Komplett, and Webhallen brands, as well as through Komplett.no, Komplett.se, Komplett.dk., Webhallen.com, NetOnNet.se, and NetOnNet.no; and retail stores. In addition, the company operates online market for corporate customers focusing on the small and medium sized enterprises, and small office/home office segments; offers its products through its web shops Komplettbedrift.no and Komplettforetag.se for digital customers; and sells its products under the Ironstone brand. Further, it is involved in large-scale distribution contracts for sale of mobile and IT products to resellers and other big entities which are operated under the Itegra brand and through the websites Itegra.no and Itegra.se. The company was formerly known as Norkom ASA and changed its name to Komplett ASA in December 2002. Komplett ASA was founded in 1991 and is headquartered in Sandefjord, Norway.",
    "description_length": 1427
  },
  {
    "ticker": "KOA.OL",
    "company_name": "Kongsberg Automotive ASA",
    "sector": "Consumer Cyclical",
    "industry": "Auto Parts",
    "original_description": "Kongsberg Automotive ASA develops, manufactures, and sells products to the automotive industry worldwide. The company operates through Drive Control Systems (DCS) and Flow Control Systems (FCS) segments. The Drive Control Systems (DCS) segment engages in the designing and manufacturing of products for the automotive and the off-highway industry, including pneumatic and electric actuation systems for gear control and clutch actuation; steering column modules; and pedals and throttles for off-highway applications. The Flow Control Systems (FCS) segment designs and manufactures products for both the automotive and commercial vehicle markets, as well as industrial applications. This segment's portfolio includes couplings for air brake and air suspension systems; and clean powertrain fluid assemblies, as well as chassis and battery coolant solutions. It serves original equipment manufacturers (OEMs) and Tier 1 suppliers in commercial vehicle, off-highway, and passenger car markets. The company was formerly known as Kongsberg Automotive Holding ASA and changed its name to Kongsberg Automotive ASA in August 2014. Kongsberg Automotive ASA was founded in 1957 and is based in Kongsberg, Norway.",
    "description_length": 1203
  },
  {
    "ticker": "KOG.OL",
    "company_name": "Kongsberg Gruppen ASA",
    "sector": "Industrials",
    "industry": "Aerospace & Defense",
    "original_description": "Kongsberg Gruppen ASA, together with its subsidiaries, provides high-tech systems and solutions primarily to customers in the maritime and defense markets. The Kongsberg Maritime segment offers integrated solutions, including ship design, development of systems for autonomous/remotely controlled vessels, and for its electro product portfolio; product and technology development, supply chain operations, and project delivery of bridge systems, automation and safety, and sensing solutions; propulsion systems, maneuvering systems, and handling systems; and support services and spare parts to ships, as well as energy solutions. The Kongsberg Defence & Aerospace segment provides various systems and services to the defence industry. It provides air defence and combat systems, sonars, and navigation for marine vessels and submarines, as well as integrated command and control systems; remote control weapon stations for land-based vehicles and marine vessels; remote tower solutions for airports; products for military tactical communication; naval strike and air-to-surface missiles; and components and services to the space industry, as well as port monitoring systems. This segment also offers lightweight composite and titanium components for F-35 combat aircraft, as well as maintenance and lifecycle services for military and civil capabilities. The Kongsberg Discovery segment offers subsea positioning and communication technologies; sustainable management technologies; and technologies that provides its customers with information about position, speed, acceleration, and heading, as well as uncrewed platforms deliver autonomous underwater and surface vessels for research, defence, and commercial use. The Other segment focuses on digitalization within the oil and gas, and renewable energy markets. It operates primarily in Norway, Europe, North America, South America, Asia, Australia, and Africa. Kongsberg Gruppen ASA was founded in 1814 and is headquartered in Kongsberg, Norway.",
    "description_length": 2000
  },
  {
    "ticker": "LINK.OL",
    "company_name": "LINK Mobility Group Holding ASA",
    "sector": "Communication Services",
    "industry": "Telecom Services",
    "original_description": "LINK Mobility Group Holding ASA, together with its subsidiaries, provides mobile and communication-platform-as-a-service solutions. It operates through four segments: Northern Europe, Western Europe, Central Europe, and Global Messaging. The company provides Xenioo, a platform to automate conversations between companies and people across a range of text and voice channels; a marketing platform that offers customer engagement, marketing automation, and email and SMS marketing services; long numbers that sends and receives messages; and short codes, a memorable short mobile number to allow inbound communications to flow. Its solutions are used in baking and finance, retail and ecommerce, logistics, advertising and marketing, travel and tourism, and healthcare industries, as well as government and public sectors. The company was founded in 2001 and is headquartered in Oslo, Norway.",
    "description_length": 891
  },
  {
    "ticker": "LSG.OL",
    "company_name": "Lerøy Seafood Group ASA",
    "sector": "Consumer Defensive",
    "industry": "Packaged Foods",
    "original_description": "Lerøy Seafood Group ASA produces, processes, markets, sells, and distributes seafood products. It operates in three segments: Wildcatch; Farming; and Value-Added Processing, Sales, and Distribution. It offers salmon and trout, whole fish, fillets, portions, smoked, graved, block, cured, ready-to-eat, and ready-to-cook products. The company also catches and processes various whitefish, including fresh and frozen options, as well as products comprising shrimp, crab, and mussels. In addition, it provides seaweed products and value-added products, such as breaded fish, burgers, patties, and other ready-to-cook or ready-to-eat seafood products; and crustaceans and molluscs, seaweed, and fresh and frozen consequence products for industrial processing. The company markets its products primarily under the Norway Seafoods, Arctic Supreme, Fjord Trout, Aurora Salmon, Fossen, Sea Eagle, Lerøy, and M?r brands to supermarkets, restaurants, canteens, hotels, wholesalers, retailers, food service companies, and industrial customers. It operates in the European Union, Norway, Asia, rest of Europe, the United States, Canada, and internationally. The company was founded in 1899 and is headquartered in Bergen, Norway. Lerøy Seafood Group ASA is a subsidiary of Austevoll Seafood ASA.",
    "description_length": 1283
  },
  {
    "ticker": "LIFE.OL",
    "company_name": "Lifecare ASA",
    "sector": "Healthcare",
    "industry": "Medical Devices",
    "original_description": "Lifecare ASA, together with its subsidiaries, operates as a medical sensor company that develops technology for sensing and monitoring of various body analytes in Norway. The company develops Sencell, a micro sensor for monitoring glucose levels in patients with diabetes and for veterinary applications. It also develops and manufactures a nanostrain biosensor, an ultra-small device that measures pressure, temperature, force, or various other performance indicators in live tissue; and medical devices that remove subdermal implants. Lifecare ASA was founded in 2006 and is headquartered in Bergen, Norway.",
    "description_length": 609
  },
  {
    "ticker": "MPCC.OL",
    "company_name": "MPC Container Ships ASA",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "MPC Container Ships ASA owns and operates a portfolio of container vessels. The company focuses on small-to mid-size vessels that are chartered out on time-charter contracts to global and regional liner shipping companies serving intra-regional trade lanes. It operates a fleet of 59 vessels with an aggregate capacity of approximately 140,894 twenty-foot equivalent units. MPC Container Ships ASA was incorporated in 2017 and is based in Oslo, Norway.",
    "description_length": 452
  },
  {
    "ticker": "MGN.OL",
    "company_name": "Magnora ASA",
    "sector": "Utilities",
    "industry": "Utilities - Renewable",
    "original_description": "Magnora ASA operates as a renewable energy development company in Norway, Sweden, South Africa and the United Kingdom. The company focuses on developing wind, solar photovoltaic (PV), and battery storage projects. It serves renewable energy operators, investment and oil companies, and global marine contractors. The company was formerly known as Sevan Marine ASA and changed its name to Magnora ASA in October 2018. Magnora ASA was incorporated in 2001 and is based in Oslo, Norway.",
    "description_length": 483
  },
  {
    "ticker": "MEDI.OL",
    "company_name": "Medistim ASA",
    "sector": "Healthcare",
    "industry": "Medical Devices",
    "original_description": "Medistim ASA develops, produces, services, leases, and distributes medical devices for cardiac and vascular surgery in the United States, Asia, Europe, and internationally. The company offers MiraQ Cardiac, a system that combines ultrasound imaging and transit time flow measurement (TTFM) in a single system for cardiac surgery; MiraQ Vascular, a system that combines ultrasound imaging and TTFM in a single system for vascular surgery; MiraQ Ultimate that combines TTFM and ultrasound imaging in a single system for cardiac, vascular, and transplant surgery; and imaging probes for intraoperative use. It also provides QuickFit TTFM probes, which are designed to hold the vessel and ensure precise measurements on various types of vessel grafts; Vascular TTFM probes for locking slide mechanism designed to secure the vessel while minimizing the manipulation; ultrasound imaging probes; and Doppler probes that are used to search for intramural coronary arteries or to locate the position and quantify the degree of a stenosis. In addition, the company distributes and sells third party medical equipment. Medistim ASA was founded in 1984 and is headquartered in Oslo, Norway.",
    "description_length": 1178
  },
  {
    "ticker": "MELG.OL",
    "company_name": "Melhus Sparebank",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Melhus Sparebank, a savings bank, provides various banking products and services to businesses, agriculture customers, and private individuals in Norway. The company offers bank, Boligsparing for Ungdom, mutual fund, and retirement saving accounts. It offers insurance services for car and other vehicles, including electric scooter, motorcycle, moped, boat, caravan, motorhome, ATV, tractor, snowmobile, trailer, and veteran cars; house and belongings, consisting of household items, travel, cottages, valuable items, drones, online, young, and Oak Plus; life and health for child, disabled, critical illness, and accident; and dogs, cats, and horses insurance services. In addition, the company provides car, mortgage, motorcycle, motorhomes, and ATVs loan products, as well as leasing services. Further is offers credit and bank cards, payment, online and mobile banking, and other daily banking services. The company was founded in 1840 and is headquartered in Melhus, Norway.",
    "description_length": 980
  },
  {
    "ticker": "MORLD.OL",
    "company_name": "Moreld ASA",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "Moreld ASA provides integrated solutions for the energy, marine, and industrial sectors in Norway and internationally. It operates through Moreld Apply, Ocean Installer, and Global Maritime segments. The company undertakes marine and subsea construction works; and offers a range of services, such as subsea umbilicals, risers, flowlines, moorings, offshore renewables, and carbon capture and storage, as well as inspection, repair, and maintenance services. It also provides subsea installation services for offshore oil and gas developments; maintenance and modification services for offshore oil and gas platforms; support services for renewable energy projects, including carbon capture, hydrogen, and offshore wind; and full offshore project lifecycle from engineering and design, consultancy, geoscience, and marine operation support solutions. The company was formerly known as Moreld AS and changed its name to Moreld ASA in June 2025. The company was incorporated in 2021 and is headquartered in Stavanger, Norway.",
    "description_length": 1023
  },
  {
    "ticker": "MOBA.OL",
    "company_name": "Morrow Bank ASA",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Morrow Bank ASA provides unsecured financing to private individuals in Norway, Finland, Sweden, Netherlands, and Germany. The company offers deposit products, consumer loans, credit cards, and point of sale finance products. It also provides payment, travel and cancellation, purchase insurance products, as well as ID theft services. The company was formerly known as Komplett Bank ASA and changed its name to Morrow Bank ASA in April 2023. Morrow Bank ASA was incorporated in 2012 and is headquartered in Lysaker, Norway.",
    "description_length": 523
  },
  {
    "ticker": "MOWI.OL",
    "company_name": "Mowi ASA",
    "sector": "Consumer Defensive",
    "industry": "Farm Products",
    "original_description": "Mowi ASA, a seafood company, produces and sells Atlantic salmon products worldwide. It operates through three segments: Feed, Farming, and Sales & Marketing. The company is involved in the salmon feed production, salmon farming and primary processing, and seafood secondary processing activities. It offers whole fish, plain and marinated fillets and steaks, hot- and cold-smoked salmon, and burgers and patties, as well as breaded, gravad, and sushi products. The company was formerly known as Marine Harvest ASA and changed its name to Mowi ASA in December 2018. Mowi ASA was founded in 1964 and is based in Bergen, Norway.",
    "description_length": 625
  },
  {
    "ticker": "MULTI.OL",
    "company_name": "Multiconsult ASA",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "original_description": "Multiconsult ASA, together with its subsidiaries, engages in the provision of engineering design, consultancy, and architecture services in Norway, Sweden, Denmark, Poland, and internationally. It operates through Region Oslo; Region Norway; Architecture; and International segments. The company offers multidisciplinary consultancy services in the areas, including design, planning, project supervision and management, geotechnical and environmental site surveys, and verification and control; and provides analysis and due diligence, design and construction management, environmental services and HSE, geology and geotechnical study, green bond, hydrometry and hydrological field work, lenders advisory, renewable energy tender, and river basin management services. It serves buildings and properties, cities and society, industry, oil and gas, renewable energy, rail and transportation, and water and environment sectors. The company was founded in 1908 and is headquartered in Oslo, Norway.",
    "description_length": 994
  },
  {
    "ticker": "NEXT.OL",
    "company_name": "NEXT Biometrics Group ASA",
    "sector": "Technology",
    "industry": "Scientific & Technical Instruments",
    "original_description": "NEXT Biometrics Group ASA, together with its subsidiaries, provides fingerprint sensor technology in Asia, Europe, Africa, and North America. The company offers fingerprint sensors, sensor modules, and readers; and touchpads, face recognition software, and development kits. It sells its products to laptop and notebook, banking and finance, access control, and government ID sectors. The company also sells its fingerprint sensor technology hardware and software to distributors and original equipment manufacturers of electronic components. NEXT Biometrics Group ASA was founded in 2000 and is headquartered in Oslo, Norway.",
    "description_length": 626
  },
  {
    "ticker": "NORCO.OL",
    "company_name": "NORCONSULT ASA",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "original_description": "Norconsult ASA provides consultancy services with focus on community planning, engineering design, and architecture in the Nordics and internationally. The company offers consultancy services for the planning and engineering design of construction and real estate projects, such as residential, office, and industrial buildings; hospitals, healthcare buildings, and care homes; schools and educational buildings; sports facilities; cultural buildings; laboratory buildings, terminal buildings for airports and railway stations; and fire and police stations. It also provides infrastructure services for water, geoscience and environment, and transport industries. In addition, the company offers construction engineering, execution, and land acquisition services for renewable energy industry; and consultancy, project development, engineering design, and execution of various construction, renovation and modification projects with industrial installations. Further, it provides IT consulting services and solutions for project management, infrastructure, and property, as well as recruitment and staffing services. The company was founded in 1929 and is headquartered in Sandvika, Norway.",
    "description_length": 1190
  },
  {
    "ticker": "NRC.OL",
    "company_name": "NRC Group ASA",
    "sector": "Industrials",
    "industry": "Railroads",
    "original_description": "NRC Group ASA, together with its subsidiaries, operates as a rail infrastructure company in Norway, Sweden, and Finland. It offers groundwork services, including excavations, transport, masses sorting, and ditching, as well as water and drainage systems; and signaling systems, digital telecom systems, electro, tracks, and station buildings and terminals, as well as catenary systems comprising wires, masts, switches, and return current systems. The company also provides concrete work, recycling, demolition, and mass transport services; steel structures; and specialized trackwork services. In addition, it engages in constructing, upgrading, and maintaining track systems, including structures, such as stations, tunnels, and bridges. The company was formerly known as Blom ASA and changed its name to NRC Group ASA in May 2015. NRC Group ASA was founded in 1966 and is headquartered in Lysaker, Norway.",
    "description_length": 908
  },
  {
    "ticker": "NAPA.OL",
    "company_name": "Napatech A/S",
    "sector": "Technology",
    "industry": "Communication Equipment",
    "original_description": "Napatech A/S provides programmable smart network interface cards and infrastructure processing units for cloud, enterprise, and telecom datacenter networks in the Americas and internationally. The company provides Link Capture Software that enables packet capture with nanosecond timestamping and replay with precise inter-frame gap control; Link Inline Software provides a processing architecture which offloads and accelerates flow aware application dataplanes; Link-Virtualization Software, offloads and accelerates the Open vSwitch data plane to enhance CPU efficiency and network performance; Link-Storage Software, a solution for storage and network offload, virtualized cloud, and cloud-native or bare-metal server virtualization; Link-Security Software, offloads the TLS protocol from the host CPU to an IPU while maintaining full software compatibility at the application level; and Link Programmable, which enables end users and OEMs to deploy FPGA computation solutions. It also provides capture products, including NT400D11, NT200A02, NT100A01. NT50B01, NT40A11, and N3070X SmartNIC; inline products, such as NT200A02; and F2070X IPU. In addition, the company offers solutions for 5G user plane function, cyber security, telecom, cloud and data centers, financial services, infrastructure and defense, network management, and virtualization. Napatech A/S was incorporated in 2003 and is headquartered in Copenhagen, Denmark.",
    "description_length": 1436
  },
  {
    "ticker": "NAVA.OL",
    "company_name": "Navamedic ASA",
    "sector": "Healthcare",
    "industry": "Medical Distribution",
    "original_description": "Navamedic ASA, a pharmaceutical company, develops, produces, markets, and sells pharmaceuticals and related products in Norway, Sweden, Denmark, Finland, the Netherlands, and internationally. The company's product portfolio includes prescription and non-prescription pharmaceuticals, as well as medical nutrition products, medical devices, food supplements, and cosmetics. It offers medical nutrition products for various therapeutic areas, including phenylketonuria, homocystinuria, maple syrup urine disease, tyrosinemia, methylmalonic and propionic acidemia, glutaric aciduria, isovaleric acidemia, and urea cycle disorders, as well as products for glycogen storage diseases, fat metabolism, renal, malnutrition, and ketogenic diet. In addition, the company provides consumer health products consisting of non-prescription drugs and health care products for pain relief, cough and cold, gastro, obesity, women's health, and others primarily through pharmacies and drugstores; prescription medicines covering obesity, Parkinson's disease, urology, and cardiology; and antibiotics. It sells, markets, and distributes its products to hospitals, patients, and pharmacies. The company was formerly known as Glucomed AS and changed its name to Navamedic ASA in 2004. Navamedic ASA was incorporated in 2002 and is based in Oslo, Norway.",
    "description_length": 1332
  },
  {
    "ticker": "NKR.OL",
    "company_name": "Nekkar ASA",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "original_description": "Nekkar ASA operates as an industrial company builder in Europe, Turkey, Asia, Australia, New Zealand, North America, the United Arab Emirates, Africa, the United States, South America, India, Norway, and internationally. It operates through Syncrolift, Intellilift, Techano Oceanlift, Globetech, and Other segments. The company offers shiplifting systems for launching and retrievals of vessels, and transfer systems for moving vessels around the yard; FastDocking products for operations during docking and maintenance of vessels; and shiplift and transfer system and the upgrade of a ship transfer system. It also provides load handling and lifting equipment, including cranes, winches, fish crowding systems, fish transfer systems, and offshore wind load handling cranes for the aquaculture and offshore energy industry; FiiZK closed cage solutions to avoid sea lice and enables waste collection from the harvest process; and SkyWalker, a wind turbine installation tool. In addition, the company develops industrial software solutions for digitalizing workflows through automation and remotely controlled systems for drilling and offshore load handling; and offers information and communication technology infrastructure, connectivity, and support services. The company was formerly known as TTS Group ASA and changed its name to Nekkar ASA in July 2019. Nekkar ASA founded in 1966 and is headquartered in Kristiansand, Norway.",
    "description_length": 1430
  },
  {
    "ticker": "NEL.OL",
    "company_name": "Nel ASA",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "original_description": "Nel ASA, a hydrogen company, provides solutions to produce, store, and distribute hydrogen from renewable energy in Norway and internationally. It operates in Nel Alkaline Electrolyser and Nel PEM Electrolyser segments. The Nel Alkaline Electrolyser segment supplies hydrogen production equipment based on alkaline water electrolysis technology. The Nel PEM Electrolyser segment supplies hydrogen production equipment based on proton exchange membrane (PEM) water electrolysis technology. The company was formerly known as DiaGenic ASA and changed its name to Nel ASA in October 2014. Nel ASA was founded in 1927 and is headquartered in Oslo, Norway.",
    "description_length": 650
  },
  {
    "ticker": "NORBT.OL",
    "company_name": "Norbit ASA",
    "sector": "Technology",
    "industry": "Scientific & Technical Instruments",
    "original_description": "Norbit ASA provides technology solutions to customers in a range of industries. It operates through Oceans, Connectivity, and Product Innovation and Realization segments. The company offers multibeam sonar systems, including integrated bathymetric systems, bathymetry systems, advanced monitoring systems for dredging, construction and renewables, forward looking wide area imaging, advanced imaging systems for obstacle avoidance/MCM, and above water laser products under the NORBIT WINGHEAD, NORBIT WBMS, NORBIT NORdredge, and NORBIT FLS names; and GuardPoint 70, GuardPoint 100, GuardPoint 200, and GuardPoint 400 intruder detection sonar, NORTrace sonar performance prediction software, and mine detection and classification solutions. It also provides SeaCOP, a sensor integration platform and user interface common operational picture for emergency response; Securus system, a multipurpose camera system for the maritime environment; SeaView multi-sensor systems for shore-based installations; and SeaDarQ, oil spill detection radar. In addition, the company offers Intelligent Traffic Systems, including CEN dedicated short-range communication (DSRC) based connectivity devices and solutions for smart tachographs, satellite-based truck tolling, battery-operated DSRC OBUs, and tailored solutions with GNSS and GSM antennas; iData that specializes in vehicle monitoring, tailored reporting, fleet management, and fuel control; and Connected Solutions for asset and vehicle monitoring, tracking, and management.Norbit ASA was founded in 1995 and is headquartered in Trondheim, Norway.",
    "description_length": 1590
  },
  {
    "ticker": "NOM.OL",
    "company_name": "Nordic Mining ASA",
    "sector": "Basic Materials",
    "industry": "Other Industrial Metals & Mining",
    "original_description": "Nordic Mining ASA, together with its subsidiaries, engages in the exploration, extraction, and production of industrial minerals and metals in Norway and internationally. The company primarily explores for rutile, garnet, quartz, and seabed minerals. Its flagship project is the Engebø project located in the west coast of Norway. The company was incorporated in 2006 and is based in Oslo, Norway.",
    "description_length": 397
  },
  {
    "ticker": "NOD.OL",
    "company_name": "Nordic Semiconductor ASA",
    "sector": "Technology",
    "industry": "Semiconductors",
    "original_description": "Nordic Semiconductor ASA, a fabless semiconductor company, develops and sells integrated circuits for use in short- and long- range wireless applications in Europe, the Americas, and the Asia Pacific. The company offers cellular IoT that comprises NB-IoT and LTE-M; non-terrestrial networks; Wi-Fi solutions; Bluetooth low energy System-on-Chip (SoC); Bluetooth direction finding solution; DECT NR+, a non-cellular radio standard; Thread, an IP-based wireless networking protocol solution; nRF52 and nRF51 wireless SoCs; and range extenders, as well as Bluetooth LE audio, Bluetooth mesh, and Zigbee products. It also provides Matter, a Connected Home over IP solution; Amazon sidewalk; multiprotocol SoCs; Bluetooth wireless technology; security solution; Edge AI; ANT solutions, including wireless multiprotocol SoCs supporting the ANT wireless protocol; and KNX IoT. In addition, the company offers power management integrated circuits (PMIC) comprising nPM1100 PMIC, nPM1300 PMIC, nPM2100, and nPM6001 PMIC; cloud services, such as location, security, and device management services; nRF Cloud solution; and application specific integrated circuits and related consulting services. Its products are used for consumer devices, including asset tracking, audio, education, HID, smart home and remotes, gaming, virtual reality and augmented reality products, and wearables; for industrial automation, such as automotive, beacons, building automation, professional lighting, transportation, retail, and smart agriculture and metering; and healthcare devices that include connected health and sports and fitness. Nordic Semiconductor ASA was founded in 1983 and is headquartered in Trondheim, Norway.",
    "description_length": 1698
  },
  {
    "ticker": "NHY.OL",
    "company_name": "Norsk Hydro ASA",
    "sector": "Basic Materials",
    "industry": "Aluminum",
    "original_description": "Norsk Hydro ASA engages in the power production, bauxite extraction, alumina refining, aluminium smelting, and recycling activities worldwide. It operates through Hydro Bauxite & Alumina, Hydro Aluminium Metal, Hydro Metal Markets, Hydro Extrusions, and Hydro Energy segments. The Hydro Bauxite & Alumina segment engages in bauxite mining activities, production of alumina, and related commercial activities, primarily the sale of alumina. The Hydro Aluminium Metal segment is involved in the primary aluminum production casting activities. This segment principally offers extrusion ingots, foundry alloys, and sheet and standard ingots. The Hydro Metal Markets segment sells products from the company's primary metal plants; operates recyclers; and trades in physical and financial metals. The Hydro Extrusions segment offers extrusion profiles, building systems, and precision tubing products for construction, automotive and heating, and ventilation and air conditioning sectors, as well as operates recycling facilities. The Hydro Energy segment engages in the trading and wholesale business in Brazil; energy sourcing operations; and operation of power stations in Norway, as well as renewable energy production, such as wind and solar, battery materials, and green hydrogen. The company also provides extruded solutions. Norsk Hydro ASA was founded in 1905 and is headquartered in Oslo, Norway.",
    "description_length": 1400
  },
  {
    "ticker": "NSKOG.OL",
    "company_name": "Norske Skog ASA",
    "sector": "Basic Materials",
    "industry": "Paper & Paper Products",
    "original_description": "Norske Skog ASA engages in the production and sale of publication and packaging paper products in Norway, rest of Europe, North America, Asia, and Africa. It operates in Publication Paper Europe and Packaging paper segments. The company offers newsprint paper products comprising standard newsprint and other papers; magazine papers, including super calendared SC and lightweight coated LWC papers; and recycled containerboards. Its products are primarily used in magazines, periodicals, catalogues, and brochures. The company was founded in 1962 and is headquartered in Oslo, Norway.",
    "description_length": 584
  },
  {
    "ticker": "NOL.OL",
    "company_name": "Northern Ocean Ltd.",
    "sector": "Energy",
    "industry": "Oil & Gas Drilling",
    "original_description": "Northern Ocean Ltd. provides offshore contract drilling services for the oil and gas industry worldwide. The company owns and operates two semi-submersible rigs. It also invests in power generation solutions. The company was incorporated in 2017 and is based in Hamilton, Bermuda. Northern Ocean Ltd. is a subsidiary of Hemen Holding Limited.",
    "description_length": 342
  },
  {
    "ticker": "NAS.OL",
    "company_name": "Norwegian Air Shuttle ASA",
    "sector": "Industrials",
    "industry": "Airlines",
    "original_description": "Norwegian Air Shuttle ASA, together with its subsidiaries, provides air travel services in Norway and internationally. It is also involved in aircraft financing, leasing, and ownership; cargo; and other activities. The company was founded in 1993 and is headquartered in Fornebu, Norway.",
    "description_length": 287
  },
  {
    "ticker": "NYKD.OL",
    "company_name": "Nykode Therapeutics AS",
    "sector": "Healthcare",
    "industry": "Biotechnology",
    "original_description": "Nykode Therapeutics AS, a clinical-stage biopharmaceutical company, discovers and develops novel immunotherapies for the treatment of cancer and autoimmune diseases. The company develops vaccines for the treatment cancer, autoimmune, and infectious diseases. Its lead product candidates include VB10.NEO, a cancer neoantigen vaccine, which is in phase I/IIa clinical trial for the treatment of locally advanced and metastatic tumors; and VB10.16, a therapeutic vaccine, which in phase II clinical trial for the treatment of human papilloma virus 16 induced malignancies, such as cervical cancer. Nykode Therapeutics AS was founded in 2006 and is headquartered in Oslo, Norway.",
    "description_length": 676
  },
  {
    "ticker": "OKEA.OL",
    "company_name": "OKEA ASA",
    "sector": "Energy",
    "industry": "Oil & Gas E&P",
    "original_description": "OKEA ASA, an oil and gas company, engages in the development and production of oil and gas in the Norwegian Continental Shelf. The company was incorporated in 2015 and is headquartered in Trondheim, Norway.",
    "description_length": 206
  },
  {
    "ticker": "ODL.OL",
    "company_name": "Odfjell Drilling Ltd.",
    "sector": "Energy",
    "industry": "Oil & Gas Drilling",
    "original_description": "Odfjell Drilling Ltd. engages in owning and operating mobile offshore drilling units primarily in Norway and Namibia. The company operates through Own Fleet and External Fleet segments. It also offers management services to other owners of drilling units, such as operational management, regulatory requirements management, marketing, contract negotiations and client relations, and operation and mobilization preparation services. The company was founded in 1914 and is based in Aberdeen, the United Kingdom. Odfjell Drilling Ltd. operates as a subsidiary of Odfjell Partners Holding Ltd.",
    "description_length": 589
  },
  {
    "ticker": "ODF.OL",
    "company_name": "Odfjell SE",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Odfjell SE provides services for the transportation and storage of bulk liquid chemicals, acids, edible oils, and other specialty products in North America, South America, Norway, the Netherlands, rest of Europe, the Middle East, Asia, Africa, and Australasia. It operates through Chemical Tankers and Tank Terminals segments. The company owns and operates chemical tankers that offer global and regional transportation; and tank terminals, which provide storage of various chemicals and petroleum products. As of December 31, 2024, it operated through a chemical tanker fleet of 71 vessels, including 46 owned/leased, 4 operational bareboat, 14 time chartered, and 3 pool vessels. The company's terminal network consists of 459 tanks with 1.3 million cubic meters of storage capacity. Odfjell SE was incorporated in 1914 and is headquartered in Bergen, Norway.",
    "description_length": 861
  },
  {
    "ticker": "ODFB.OL",
    "company_name": "Odfjell SE",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Odfjell SE provides services for the transportation and storage of bulk liquid chemicals, acids, edible oils, and other specialty products in North America, South America, Norway, the Netherlands, rest of Europe, the Middle East, Asia, Africa, and Australasia. It operates through Chemical Tankers and Tank Terminals segments. The company owns and operates chemical tankers that offer global and regional transportation; and tank terminals, which provide storage of various chemicals and petroleum products. As of December 31, 2024, it operated through a chemical tanker fleet of 71 vessels, including 46 owned/leased, 4 operational bareboat, 14 time chartered, and 3 pool vessels. The company's terminal network consists of 459 tanks with 1.3 million cubic meters of storage capacity. Odfjell SE was incorporated in 1914 and is headquartered in Bergen, Norway.",
    "description_length": 861
  },
  {
    "ticker": "OTL.OL",
    "company_name": "Odfjell Technology Ltd.",
    "sector": "Energy",
    "industry": "Oil & Gas Drilling",
    "original_description": "Odfjell Technology Ltd., together with its subsidiaries, operates as a supplier of offshore operations, well services technology, and engineering solutions in Norway, the United Kingdom, rest of Europe, Kuwait, Malaysia, rest of Asia, and internationally. It operates through Well Services; Operations; and Projects & Engineering segments. The Well Services segment provides casing and tubular running services, including automated and conventional; drilling tool and tubular rental services; and specialist well intervention products and services for exploration wells and production. Its Operations segment engages in the production drilling and well completion on clients' rigs. This segment is also involved in the slot recovery, plug and abandonment, work-overs, and maintenance activities, as well as rig installation services; platform drilling services on fixed and floating production platforms with subsea blowout preventers; and management and performance of services on leased jack-up rigs. The Projects & Engineering segment offers engineering and integrity services, including design and engineering, and building supervision; and project management and operational support for units in operation, newbuild projects, renewal survey / SPS recertification projects, and yard stays. It offers its services to the offshore oil and gas industry. Odfjell Technology Ltd. was founded in 1973 and is headquartered in Aberdeen, the United Kingdom.",
    "description_length": 1452
  },
  {
    "ticker": "OET.OL",
    "company_name": "Okeanis Eco Tankers Corp.",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Okeanis Eco Tankers Corp., a shipping company, owns and operates tanker vessels worldwide. It operates a fleet of 14 tanker vessels comprising six modern Suezmax tankers and eight modern VLCC tankers focusing on the transportation of crude oil. Okeanis Eco Tankers Corp. was incorporated in 2018 and is based in Neo Faliro, Greece.",
    "description_length": 331
  },
  {
    "ticker": "OLT.OL",
    "company_name": "Olav Thon Eiendomsselskap ASA",
    "sector": "Real Estate",
    "industry": "Real Estate Services",
    "original_description": "Olav Thon Eiendomsselskap ASA engages in the property rental business in Norway and Sweden. It operates through Shopping Center and Commercial Property segments. The company's property portfolio comprises retail, offices, logistics, hotel properties, and residential rentals. It is also involved in the property development and management activities. The company was founded in 1958 and is based in Oslo, Norway. Olav Thon Eiendomsselskap ASA is a subsidiary of Olav Thon Gruppen AS.",
    "description_length": 483
  },
  {
    "ticker": "ORK.OL",
    "company_name": "Orkla ASA",
    "sector": "Consumer Defensive",
    "industry": "Packaged Foods",
    "original_description": "Orkla ASA operates as an industrial investment company within brands and consumer-oriented businesses in Norway, Sweden, Denmark, Finland, Iceland, the Baltics, rest of Europe, and internationally. The company offers branded products, including frozen pizza, ketchup, soups, sauces, bread toppings, and ready-to-eat meals through grocery channels, as well as food service, convenience stores, and petrol stations. It also provides confectionery, biscuit, and snack products; and spices, masalas, and food products based on dried mixes. In addition, the company offers personal care, hygiene, laundry detergent, and cleaning products; dietary supplement, oral care, sport nutrition, and weight control products; wound care products and first aid equipment; painting tools and accessories; basic and wool garments; and professional cleaning products. Further, it operates Gymgrossisten, Proteinfabrikken, Bodystore, and Fitnesstukku e-commerce portals for health and sports nutrition products, as well as restaurants. Additionally, the company supplies margarine and butter blends, bread and cake improvers and mixes, yeast, marzipan, and ice cream ingredients; produces and supplies hydropower to the Nordic power market; and develops and sells real estate properties. It offers its food products under the Grandiosa, TORO, Stabburet, Felix, Paulúns, Fun Light, Abba, Beauvais, Kalles, Den Gamle Fabrik, Hamé, and Vitana brands; confectionery and snacks under the KiMs, Nidar, Stratos, Sætre, Göteborgs Kex, OLW, Panda, Laima, Selga, Taffel, Kalev, and Nói Síríus brands; home and personal care products under the Zalo, OMO, Blenda, Jif, Define, Solidox, Dr Greve, Lano, and Bliw brands; health products under the Möller's, Jordan, Vitalab, OSL, Cederroth First Aid, Salvequick, Livol, Nutrilett, Maxim, Collett, Solidox, and CuraMed brands; and food ingredients under the Odense, Mors Hjemmebakte, KronJäst, Bakkedal, and NATURLI brands. The company was founded in 1918 and is based in Oslo, Norway.",
    "description_length": 1999
  },
  {
    "ticker": "OTEC.OL",
    "company_name": "Otello Corporation ASA",
    "sector": "Communication Services",
    "industry": "Advertising Agencies",
    "original_description": "Otello Corporation ASA, through its subsidiary, provides mobile solutions and platforms for digital payments, customer engagement, microfinance, and digital services in Norway. It provides Apps Club subscription service to mobile carriers and smartphone OEMs. The company was formerly known as Opera Software ASA and changed its name to Otello Corporation ASA in January 2018. Otello Corporation ASA was established in 1995 and is based in Oslo, Norway.",
    "description_length": 453
  },
  {
    "ticker": "OTOVO.OL",
    "company_name": "Otovo ASA",
    "sector": "Technology",
    "industry": "Solar",
    "original_description": "Otovo ASA, together with its subsidiaries, operates an online marketplace for solar installations in Norway. It operates through two segments, Marketplace and Subscription SPV. The company develops and manages an online sales platform, which provides subscription for solar panel installations and related products for private households. It operates in Europe, Norway, Sweden, Poland, Italy, Germany, Switzerland, Austria, France, the Netherlands, Belgium, Spain, Portugal, and the United Kingdom. Otovo ASA was incorporated in 2015 and is headquartered in Oslo, Norway.",
    "description_length": 571
  },
  {
    "ticker": "BAKKA.OL",
    "company_name": "P/F Bakkafrost",
    "sector": "Consumer Defensive",
    "industry": "Farm Products",
    "original_description": "P/F Bakkafrost, together with its subsidiaries, produces and sells salmon products in North America, Western Europe, Eastern Europe, Asia, and internationally. It operates through seven segments: Fishmeal, Fish Oil and Fish Feed; Freshwater Faroe Islands; Freshwater Scotland; Farming Faroe Islands; Farming Scotland; Services; and Sales & Other. The company's products include fresh and frozen whole salmon, fresh and frozen salmon fillets, fresh skin-packed salmon portions, frozen salmon portions and tails, frozen smoked salmon and salmon fillets, frozen salmon bits and pieces, frozen salmon off-cuts and belly flaps, frozen salmon heads, salmon backbones, and salmon skin. It is also involved in the production and sale of fishmeal, fish oil, and fish feed; production of eggs from breeding self-owned salmon strains; production of smolts; and on-growing of salmon. In addition, the company manages a fleet of farming service vessels; provides fish transportation, treatments, net cleaning, harvesting, freight and logistical, and heavy marine support services; converts organic waste into biogas, heating, electricity, and fertilizers; produces styrofoam boxes; and optimizes the value creation and retention from the harvested fish. P/F Bakkafrost was founded in 1968 and is headquartered in Glyvrar, Denmark.",
    "description_length": 1317
  },
  {
    "ticker": "PLSV.OL",
    "company_name": "PARATUS ENERGY SERVICES LTD.",
    "sector": "Energy",
    "industry": "Oil & Gas Drilling",
    "original_description": "Paratus Energy Services Ltd., through its subsidiaries, provides drilling services and operates a fleet of jack-up rigs under contracts in Mexico. The company also operates a fleet of pipe-laying support vessels under contracts in Brazil; and offers subsea engineering, installation, and other services, as well as well integrity and intervention, plug and abandonment, and decommissioning services to its upstream oil and gas clients. The company was incorporated in 2018 and is based in Hamilton, Bermuda.",
    "description_length": 507
  },
  {
    "ticker": "PCIB.OL",
    "company_name": "PCI Biotech Holding ASA",
    "sector": "Healthcare",
    "industry": "Biotechnology",
    "original_description": "PCI Biotech Holding ASA, a biopharmaceutical company, focuses on the development of technologies and novel therapies through its photochemical technology platform. The company's technology platform consists of a proprietary small molecule photosensitiser and a light source; and develops photochemical lysis (PCL) comprising light-triggered cell lysis, which enhances yield and purity in viral vector manufacturing, as well as photochemical internalisation (PCI), inducing light-triggered intracellular release for various therapeutic modalities. It also explores for intratumoural immunotherapy therapeutics that identifies novel treatment combinations to overcome resistance to immune-checkpoint inhibitors and safety-issues associated with treatments; and develops nucleic acid therapeutics to improve the treatment of dermatological diseases. PCI Biotech Holding ASA was incorporated in 2007 and is headquartered in Oslo, Norway.",
    "description_length": 933
  },
  {
    "ticker": "PEN.OL",
    "company_name": "Panoro Energy ASA",
    "sector": "Energy",
    "industry": "Oil & Gas E&P",
    "original_description": "Panoro Energy ASA, an independent exploration and production company, engages in the exploration, development, and production of oil and gas properties in Africa. It holds assets in Equatorial Guinea, Gabon, Tunisia, and South Africa. The company was incorporated in 2009 and is based in Oslo, Norway.",
    "description_length": 301
  },
  {
    "ticker": "PARB.OL",
    "company_name": "Pareto Bank ASA",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Pareto Bank ASA provides various banking products and services in Norway. The company accepts company and private deposits. It also offers business financing, such as acquisition, recapitalization, owner, bridging, operating and working capital, and operating loans; financing for the purchase of development plots; construction loans; financing of commercial property; bridging financing; owner financing and liquidity credits; and shipping and offshore finance. Pareto Bank ASA was incorporated in 2007 and is headquartered in Oslo, Norway.",
    "description_length": 542
  },
  {
    "ticker": "PNOR.OL",
    "company_name": "PetroNor E&P ASA",
    "sector": "Energy",
    "industry": "Oil & Gas E&P",
    "original_description": "PetroNor E&P ASA operates as an independent oil and gas exploration and production company in in the Republic of the Congo, the Gambia, and Nigeria. The company was founded in 2017 and is headquartered in Oslo, Norway.",
    "description_length": 218
  },
  {
    "ticker": "PSE.OL",
    "company_name": "Petrolia SE",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "Petrolia SE, together with its subsidiaries, engages in the rental and sale of energy service equipment to energy industry in Norway, rest of Europe, Asia, and Australia. It operates in two segments, Energy and Energy Service. The company rents drilling equipment, such as drill pipes and test tubing. It also provides casing and tubing running, drilling, and make and brake services. In addition, the company engages in the exploration and production of oil and gas. It serves energy companies, drilling contractors, and energy service companies. The company was formerly known as Petrolia E&P Holdings SE and changed its name to Petrolia SE in January 2013. Petrolia SE was founded in 1997 and is based in Limassol, Cyprus.",
    "description_length": 725
  },
  {
    "ticker": "PEXIP.OL",
    "company_name": "Pexip Holding ASA",
    "sector": "Technology",
    "industry": "Software - Application",
    "original_description": "Pexip Holding ASA, a video technology company, provides end-to-end video conferencing platform and digital infrastructure in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It offers self-hosted software application and as-a-service deployment options for enterprise video conferencing, built on its proprietary Infinity technology. The company also offers Pexip Connect Standard, which provides interoperability between traditional meeting room devices like Cisco, HP/Poly, and Avaya; Pexip Connect Essentials, a solution that connects traditional meeting room devices; Pexip Connect for Teams Rooms, a solution that lets users join any meeting, or place and receive calls to and from anyone, complete with a native experience from their teams rooms devices; Pexip Connect for Zoom Rooms, a solution that lets users join teams meeting and enjoy a native experience; and Pexip Connect for Government through FedRAMP and StateRAMP. In addition, it provides Pexip Secure Meetings for Defense, a unified communication for defense sector; Pexip Secure Meetings for Government, a solution for communication for government officials, agencies, and citizens; Pexip Secure Meetings for Justice, a secure and private communication solution for court system; Pexip Secure Meetings for Health, a solution with video visits for healthcare providers and patients; Pexip Private AI platforme, which enables AI-powered live captions and translations in secure video meetings; and Pexip Secure Scheduler for Web that offers flexible and secure scheduling of virtual meetings. Further, the company offers Pexip Video Platform Self-Hosted, a customizable and secure video platform for complete control and flexibility; Pexip Video Platform as a Service, an easy-to-use video engine solution for regulated industries; and trust centers, as well as provides professional, room management, and training services. Pexip Holding ASA was founded in 2011 and is headquartered in Oslo, Norway.",
    "description_length": 1988
  },
  {
    "ticker": "PHO.OL",
    "company_name": "Photocure ASA",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "original_description": "Photocure ASA, together with its subsidiaries, engages in the research, development, production, distribution, marketing, and sale of pharmaceutical products. It operates through Commercial Franchise and Development Portfolio segments. The company offers Hexvix/Cysview for the detection and management of bladder cancer. It also develops Cevira for the treatment of human papilloma virus-induced cervical precancerous lesions. The company has a license agreement with Asieris MediTech Co to develop and commercialize Cevira; and a strategic agreement with Richard Wolf GmbH to develop and commercialize a 4K LED high-definition reusable blue light cystoscope based on Richard Wolf's System blue technology. It sells its products to pharmaceutical wholesalers, pharmacies, and hospitals through license partners. The company operates in the Nordic countries, Germany, France, Austria, the United Kingdom, the Benelux, Italy, rest of the Europe, Canada, and the United States. Photocure ASA was founded in 1993 and is headquartered in Oslo, Norway.",
    "description_length": 1047
  },
  {
    "ticker": "POL.OL",
    "company_name": "Polaris Media ASA",
    "sector": "Communication Services",
    "industry": "Publishing",
    "original_description": "Polaris Media ASA operates as a media house and printing company in Norway and Sweden. The company provides digital advertising services. It offers prints group and external newspapers, including editorial supplements and advertisement leaflets, civil prints, and other magazines/leaflets. In addition, the company distributes newspapers, as well as parcels, mail, and other product deliveries. Polaris Media ASA was founded in 2008 and is headquartered in Trondheim, Norway.",
    "description_length": 475
  },
  {
    "ticker": "PRS.OL",
    "company_name": "Prosafe SE",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "Prosafe SE, together with its subsidiaries, owns and operates semi-submersible accommodation vessels in South America, North America, and Europe. The company is also involved in the maintenance and modification of installations on fields for the production, hook-up and commissioning of new fields, tiebacks to existing infrastructure, and decommissioning activities. It owns and operates a fleet of five semi-submersible accommodation, safety, and support vessels; and two new build accommodation vessels at the yard. The company primarily serves oil and gas industries. Prosafe SE was founded in 1972 and is based in Stavanger, Norway.",
    "description_length": 637
  },
  {
    "ticker": "PROT.OL",
    "company_name": "Protector Forsikring ASA",
    "sector": "Financial Services",
    "industry": "Insurance - Specialty",
    "original_description": "Protector Forsikring ASA, operates as a non-life insurance company, provides direct general insurance and reinsurance to the commercial lines of business, public sector, and affinity schemes. The company offers property insurance, motor insurance, personal insurance, and liability insurance. It sells its products through insurance brokers and agents. Protector Forsikring ASA was incorporated in 2003 and is headquartered in Oslo, Norway.",
    "description_length": 440
  },
  {
    "ticker": "PUBLI.OL",
    "company_name": "Public Property Invest AS",
    "sector": "Real Estate",
    "industry": "Real Estate Services",
    "original_description": "Public Property Invest ASA, a real estate company, owns, develops, operates, and rents real estate properties in Norway. The company's property portfolio, including social infrastructure properties, as well as rental of office spaces. It serves tenants within the public sector, such as the police, judiciary functions, and public health organizations. Public Property Invest ASA was incorporated in 2018 and is headquartered in Oslo, Norway.",
    "description_length": 442
  },
  {
    "ticker": "QEC.OL",
    "company_name": "Questerre Energy Corporation",
    "sector": "Energy",
    "industry": "Oil & Gas E&P",
    "original_description": "Questerre Energy Corporation, an energy technology and innovation company, engages in the acquisition, exploration, and development non-conventional oil and gas projects in Canada. It produces tight oil, oil shale, shale oil, and shale gas. The company primarily holds 40,320 acres located in Kakwa, Alberta, including 25% working interest in 10,080 acres in Kakwa Central; 50% working interest in 4,480 acres in Kakwa North; 50% interest in 22,040 acres in Kakwa West; and 50% interest in 3,840 acres in Kakwa South. It also has 100% working interest in 12, 560 acres located in Antler, Saskatchewan; and oil shale assets in Jordan and St. Lawrence Lowlands, Quebec. The company was formerly known as Westpro Equipment Ltd. and changed its name to Questerre Energy Corporation in December 2000. The company was incorporated in 1971 and is headquartered in Calgary, Canada.",
    "description_length": 873
  },
  {
    "ticker": "RECSI.OL",
    "company_name": "REC Silicon ASA",
    "sector": "Technology",
    "industry": "Semiconductor Equipment & Materials",
    "original_description": "REC Silicon ASA, together with its subsidiaries, produces and sells silicon materials for the solar and electronics industries in Norway and internationally. The company offers various Signature Silane gas, a pure form of silicon that produces product for fuel industries comprising specialty gases, including Dichlorosilane, Monochlorosilane, and Disilane for use in the manufacturing processes of flat panel displays, semiconductors, and solar cells; and solar grade polysilicon, including NextSi used for multi crystalline and monocrystalline solar ingot and wafer production in the manufacturing of solar modules. It also provides electronic grade polysilicon consisting of float zone-based devices are used in motor control and power conversion processes for hybrid and electric vehicles, wind energy, and high voltage transmission, 5G communications, high-speed trains, internet of things, and big data, as well as Czochralski for manufacturing of semiconductor wafers used in memory processors, optics, and micro electromechanical systems. The company was formerly known as Renewable Energy Corporation ASA and changed its name to REC Silicon ASA in October 2013. REC Silicon ASA was founded in 1996 and is headquartered in Lysaker, Norway.",
    "description_length": 1247
  },
  {
    "ticker": "RANA.OL",
    "company_name": "Rana Gruber ASA",
    "sector": "Basic Materials",
    "industry": "Steel",
    "original_description": "Rana Gruber ASA engages in the mining, processing, and sale of iron ore concentrate in Norway, the United Kingdom, Sweden, the United States, and internationally. The company excavates, processes, and sells iron oxide in the form of hematite that is used for metallurgical applications; magnetite to produce water treatment chemicals; and other special products, such as iron oxide pigments that is used for colorants, magnetic stripes, and chemical processes under the Colorana tradename. It markets its products to steel manufacturers, water treatment chemical producers, as well as concrete, paint, plastics, heat management, automotive, and toner production industry sectors. Rana Gruber ASA was founded in 1937 and is headquartered in Mo i Rana, Norway.",
    "description_length": 758
  },
  {
    "ticker": "REACH.OL",
    "company_name": "Reach Subsea ASA",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "Reach Subsea ASA provides subsea services in Norway and internationally. It operates in two segments, Oil & Gas and Renewable/Other. The company offers subsea services, including engineering solutions and project management for offshore operations; inspection, maintenance, and repair services, such as structural inspections, WROV operation, SCM changeout, scale squeeze operations, water injection, ready for operation, subsea equipment maintenance, repair, commissioning, and boulder clearance; asset integrity and pipeline inspection services; and construction support services, including seabed intervention, boulder clearance, touchdown monitoring, and pre-lay and post-lay surveys, as well as vessel, remotely operated vehicles (ROV), personnel, survey, and on demand engineering. It also provides geophysical, geotechnical, and environmental survey solutions for site survey, pipeline/cable route survey, ROV, seabed mapping, and pipeline inspection; surface and subsea positioning solutions to support marine construction projects; specialist survey and positioning services to support international marine construction projects, offshore cable operations, rig and mooring operations, and seabed surveys; and support services for offshore power, communication, and umbilical cables, as well as supporting operation and maintenance/inspection, repair and maintenance services. In addition, the company offers geophysical monitoring solutions for hydrocarbon producing fields offshore, including 4D gravity, seafloor subsidence monitoring, depth watch for seismic nodes, injection integrity monitoring, well drilling, and real time seismic monitoring services; and environmental monitoring services that include multi-physical monitoring services. The company was formerly known as Transit Invest ASA and changed its name to Reach Subsea ASA in December 2012. Reach Subsea ASA was incorporated in 1909 and is headquartered in Haugesund, Norway.",
    "description_length": 1951
  },
  {
    "ticker": "ROGS.OL",
    "company_name": "Rogaland Sparebank",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Rogaland Sparebank, an independent savings bank, provides a range of banking and investment products to retail and corporate customers in Norway. It operates through three segments: Retail Market, Corporate Market, and Real Estate. The company offers fixed rate deposits, deposit accounts, BSU, and tax withholding and other accounts subjected to withdrawal restrictions; child, death, income, critical illness, disability, car, home, cabin, contents, UNG, and other insurance products; and pension solutions. It also provides bank guarantee, overdrafts, leasing, construction, and business loans, factoring and invoice sales; fixed interest, mortgage, car, and other vehicle loans, as well as small loans and refinancing, and green loans; bank and credit cards; various loans and guarantees; and mobile and internet banking services. In addition, the company offers real estate brokerage services and general investment advisory services. The company was formerly known as Sandnes Sparebank and changed its name to Rogaland Sparebank in August 2024. Rogaland Sparebank was founded in 1875 and is headquartered in Sandnes, Norway.",
    "description_length": 1130
  },
  {
    "ticker": "SDSD.OL",
    "company_name": "S.D. Standard ETC Plc",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "S.D. Standard ETC Plc, an investment holding company, focuses on energy, transport, and commodities segments. The company was formerly known as S.D. Standard Drilling Plc and changed its name to S.D. Standard ETC Plc in February 2022. S.D. Standard ETC Plc was incorporated in 2010 and is headquartered in Limassol, Cyprus.",
    "description_length": 323
  },
  {
    "ticker": "ENH.OL",
    "company_name": "SED Energy Holdings Plc",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "SED Energy Holdings Plc, acquires and processes marine seismic data for the oil and gas industry in Europe, Africa, the Middle East, North and South America, and the Asia Pacific. The company offers 2D seismic; and source vessels that provide conventional undershoot, 4D repeat survey, wide azimuth, push reverse, long-term charter and vessel management, in-house source modelling and environmental decay analysis, and spot charter services. It also owns and operates tender assisted drilling rigs. In addition, the company conducts 2D, source, and niche 3D seismic surveys to support offshore exploration and development projects; manages the end-to-end process of seismic surveys; and operates specialized fleet of seismic vessels for data acquisition and operational efficiency. The company is based in Nicosia, Cyprus.",
    "description_length": 822
  },
  {
    "ticker": "SNTIA.OL",
    "company_name": "SENTIA ASA",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "original_description": "Sentia ASA engages in the construction business in Norway and Sweden. It operates through two segments: HENT and Sentia Sweden. The HENT segment offers large and complex buildings, such as schools, cultural buildings, shopping malls, etc. The Sweden segment provides hospitals, sports halls, and office buildings. Sentia ASA was incorporated in 2012 and is headquartered in Oslo, Norway.",
    "description_length": 387
  },
  {
    "ticker": "SWON.OL",
    "company_name": "SOFTWAREONE HOLDING",
    "sector": "Technology",
    "industry": "Software - Application",
    "original_description": "SoftwareOne Holding AG, together with its subsidiaries, provides software and cloud solutions in Switzerland, Germany, Austria, rest of Europe, Mauritius, South Africa, the United States, Canada, Latin America, the Asia Pacific, Dubai, and Qatar. The company develops and delivers the technology solutions that modernize applications and software in the cloud. It serves large enterprises, corporates, small and medium-sized enterprises, and public sector organizations. It has strategic agreement with ServiceNow to optimize customers' IT investments. SoftwareOne Holding AG was founded in 2000 and is headquartered in Stans, Switzerland.",
    "description_length": 639
  },
  {
    "ticker": "SAGA.OL",
    "company_name": "Saga Pure ASA",
    "sector": "Financial Services",
    "industry": "Asset Management",
    "original_description": "Saga Pure ASA, an investment company, engages in the investment and management related to industry, energy, and real estate. Its business activities also include investment, management, operation, consultancy, ownership, and other services in other businesses. The company was formerly known as Saga Tankers ASA and changed its name to Saga Pure ASA in November 2020. Saga Pure ASA was incorporated in 2010 and is headquartered in Oslo, Norway.",
    "description_length": 444
  },
  {
    "ticker": "SALM.OL",
    "company_name": "SalMar ASA",
    "sector": "Consumer Defensive",
    "industry": "Farm Products",
    "original_description": "SalMar ASA, an aquaculture company, produces and sells farmed salmon in Asia, North America, Europe, and internationally. The company operates through Fish Farming Central Norway, Fish Farming Northern Norway, Icelandic Salmon, Sales & Industry, and SalMar Aker Ocean segments. It engages in the broodstock, marine-phase farming, harvesting, processing, and smolt production activities. In addition, the company offers fish fillets and related products. SalMar ASA was incorporated in 1991 and is headquartered in Kverva, Norway.",
    "description_length": 529
  },
  {
    "ticker": "SALME.OL",
    "company_name": "Salmon Evolution ASA",
    "sector": "Consumer Defensive",
    "industry": "Farm Products",
    "original_description": "Salmon Evolution ASA, together with its subsidiaries, operates as a land-based salmon farming company in Norway and internationally. It focuses on the production of salmon meals. Salmon Evolution ASA was founded in 2017 and is headquartered in Elnesvågen, Norway.",
    "description_length": 263
  },
  {
    "ticker": "SATS.OL",
    "company_name": "Sats ASA",
    "sector": "Consumer Cyclical",
    "industry": "Leisure",
    "original_description": "Sats ASA provides fitness and training services in Norway, Sweden, Denmark, and Finland. It offers sportswear, fitness gear, bars, and energy drinks. The company operates fitness clubs under the SATS, ELIXIA, Fresh Fitness, and SATSYoga brand names. Sats ASA was founded in 1995 and is headquartered in Oslo, Norway.",
    "description_length": 316
  },
  {
    "ticker": "SCANA.OL",
    "company_name": "Scana ASA",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "original_description": "Scana ASA provides technology and services for the offshore and energy industries in Norway, other European countries, the United States, Asia, and Africa. It operates in two segments: Energy and Offshore. The company offers stress joints, mooring systems, actuators, bop, risers, maintenace, and surface treatment products; and energy storage solutions, shore power, and energy modules. It also provides product and service portfolio, including design and integration of electrical power systems, electrical infrastructure, energy storage systems, and control system. In addition, the company is involved in design and manufacturing of riser applications and specialist subsea equipment to rig servicing; ISS services; mooring systems; IMR lifecycle services for rigs and vessels; and mooring solutions and valve control systems to the shipping, energy, and aquaculture industry. Scana ASA was formerly known as Incus Investor ASA and changed its name to Scana ASA in May 2020. The company was founded in 1976 and is headquartered in Bergen, Norway.",
    "description_length": 1050
  },
  {
    "ticker": "SCATC.OL",
    "company_name": "Scatec ASA",
    "sector": "Utilities",
    "industry": "Utilities - Renewable",
    "original_description": "Scatec ASA, together with its subsidiaries, provides renewable energy solutions worldwide. The company operates through Power Production and Development & Construction segments. It produces and sells solar, wind, and hydro generated electricity. The company also develops, builds, owns, and operates solar, wind, and hydro power plants; and storage solutions. The company is also involved in the engineering, procurement, and construction, as well as operation, maintenance, and asset management of power plants. It has a total of 5 GW of renewable energy plants in operation and under construction. The company was formerly known as Scatec Solar ASA and changed its name to Scatec ASA in November 2020. Scatec ASA was incorporated in 2007 and is headquartered in Oslo, Norway.",
    "description_length": 777
  },
  {
    "ticker": "SEA1.OL",
    "company_name": "Sea1 Offshore Inc.",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "Sea1 Offshore Inc., together with its subsidiaries, owns and operates offshore support vessels for the offshore energy service industry. The company operates through Subsea Vessels; Anchor-Handling Tug Supply (AHTS) Vessels; Platform Supply Vessels (PSVs); Fast Crew & Oil Spill Recovery Vessels; and Other segments. It provides offshore vessel activities, such as anchor handling and towing, platform supply, well intervention services, subsea operations, walk-to-work, and trenching operations for windfarms. The company has a fleet of 17 vessels, which includes two offshore subsea construction vessels, two well-intervention vessels, one scientific core-drilling vessel, six anchor handling tug supply vessels, two platform supply vessels, and four fast crew and oil spill recovery vessels. It operates in the North Sea, Brazil, Australia, Canada, Southeast Asia, South America and West Africa. The company was formerly known as Siem Offshore Inc. and changed its name to Sea1 Offshore Inc. in May 2024. Sea1 Offshore Inc. was founded in 2005 and is headquartered in Kristiansand, Norway.",
    "description_length": 1092
  },
  {
    "ticker": "SBO.OL",
    "company_name": "Selvaag Bolig ASA",
    "sector": "Real Estate",
    "industry": "Real Estate - Development",
    "original_description": "Selvaag Bolig ASA, a housing development company, engages in the development, construction, and sale of residential properties in Greater Oslo, Bergen, Stavanger, Trondheim, and Stockholm. The company operates through Property Development and Other segments. It also offers project management services. The company was founded in 2008 and is headquartered in Oslo, Norway. Selvaag Bolig ASA operates as a subsidiary of Selvaag AS.",
    "description_length": 430
  },
  {
    "ticker": "SHLF.OL",
    "company_name": "Shelf Drilling, Ltd.",
    "sector": "Energy",
    "industry": "Oil & Gas Drilling",
    "original_description": "Shelf Drilling, Ltd., together with its subsidiaries, operates as a shallow water offshore drilling contractor in the Middle East, North Africa, the Mediterranean, Southeast Asia, India, West Africa, and the North Sea. The company offers equipment and services for the drilling, completion, maintenance, and decommissioning of oil and natural gas wells, and associated services using the rigs of its own fleet and related equipment. It also provides catering, additional equipment and personnel, and consumables or accommodations at the request of the customer using third party vendors. In addition, the company owns various independent-leg cantilever jack-up rigs. It serves government owned or controlled energy companies; and publicly listed global integrated oil companies or independent exploration and production companies. Shelf Drilling, Ltd. was incorporated in 2012 and is headquartered in Dubai, the United Arab Emirates.",
    "description_length": 933
  },
  {
    "ticker": "SKUE.OL",
    "company_name": "Skue Sparebank",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Skue Sparebank provides various banking products and services for individual and business in Norway. The company offers checking, business, deposit, tax withholding, client, agricultural, currency, investment, deposit, retirement, and group accounts; business, construction, consumer, car, other vehicle, and small loans, as well as mortgage, bank guarantee, factoring, overdraft, and leasing services; and home and leisure, car and other vehicles, animal, company and employees, agriculture, and travel insurance products. It also provides savings and pension products; and online and mobile banking, bank card, and payment services. The company was formerly known as Nes Prestegjelds Sparebank and changed its name to Skue Sparebank in October 2013. Skue Sparebank was founded in 1842 and is based in Geilo, Norway.",
    "description_length": 817
  },
  {
    "ticker": "SMCRT.OL",
    "company_name": "SmartCraft ASA",
    "sector": "Technology",
    "industry": "Software - Application",
    "original_description": "SmartCraft ASA provides software solutions to the construction industry in Norway, Sweden, Finland, and the United Kingdom. The company offers software, including Cordel, a SaaS solution; Bygglet, a SaaS born in the cloud solution; EL-VIS, a modular solution comprising services in the electricians' daily operations; and Congrid, a cloud-based tool for project management. It also provides Kvalitetskontroll, a cloud-based project management solution and quality assurance platform; El-verdi, a digital sales tool for electricians; and ELinn, a cloud-based solution for electricians to handle project management services. In addition, the company offers its products under the HomeRun, Coredination, Locka, and Clixifix brands. SmartCraft ASA was founded in 1987 and is headquartered in Hønefoss, Norway.",
    "description_length": 805
  },
  {
    "ticker": "SMOP.OL",
    "company_name": "Smartoptics Group ASA",
    "sector": "Technology",
    "industry": "Communication Equipment",
    "original_description": "Smartoptics Group ASA provides optical networking solutions and devices in the Americas, Europe, the Middle East, Africa, and the AsiaPacific. Its products include flexible open-line systems; multiplexers and optical add/drop multiplexers; modular transponders and muxponders; optical transceivers; active and passive systems; and optical transceivers datasheets, as well as Sosmart software suite. Its solutions are used in metro and regional network applications, as well as in metro access networks. The company serves enterprises, governments, cloud providers, Internet exchanges, and cable and telecom operators through its sales force; and business partners, which include distributors, OEMs, and VARs. The company was founded in 1990 and is headquartered in Oslo, Norway.",
    "description_length": 779
  },
  {
    "ticker": "SOGN.OL",
    "company_name": "Sogn Sparebank",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Sogn Sparebank provides various banking products and services in Norway. The company offers saving and pension accounts; home loans and small loans, as well as loans for cars and other vehicles; credit and other cards; and mobile and online banking services, as well as payment services. It also provides bank guarantees, construction loans, overdraft, and business loans, as well as leasing and refinancing without collateral. In addition, the company offers home and leisure, animals, damage, car, Death, critical illness, disabled, work machine, data attack, property damage, health, homeowners, agriculture, craftsman, commercial vehicle, business, and personnel insurance products. Sogn Sparebank was founded in 1846 and is based in Årdalstangen, Norway.",
    "description_length": 759
  },
  {
    "ticker": "SOMA.OL",
    "company_name": "Solstad Maritime ASA",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Solstad Maritime ASA owns and operates offshore service vessels (OSVs) that provides maritime services to the offshore energy industry in North Sea, North and Central America, Mediterranean and rest of the Europe, Africa, South America, Australia, and Asia. The company operates in three segments: Anchor Handling Tug Supply Vessels (AHTS), Construction Service Vessels (CSVs), and Services segments. It operates subsea construction contracts; and offers services to various vessel spreads, such as ROVs, tooling, project personnel, engineering support, survey, and other services. The company also offers vessel management and operations services. It operates 10 AHTS vessels and 22 CSVs. Solstad Maritime ASA was incorporated in 2023 and is headquartered in Skudeneshavn, Norway.",
    "description_length": 781
  },
  {
    "ticker": "SOFF.OL",
    "company_name": "Solstad Offshore ASA",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Solstad Offshore ASA owns and operates offshore service vessels. It owns and operates construction service vessels and anchor handling tug support vessel and; and provides maritime services to offshore energy industry. The company offers renewable energy services, subsea support operations, node seismic operations, subsea construction activities, support for well stimulation operations, and subsea and mooring installations; and additional services, such as ROVs, tooling, project personnel, and engineering support, as well as engages in oil and gas activities. It owns a fleet of six vessels which includes three construction service vessels and three anchor handling tug support vessels. The company operates in the North Sea, North and Central America, Mediterranean/rest of Europe, Africa, South America, Australia, and Asia. Solstad Offshore ASA was founded in 1964 and is headquartered in Skudeneshavn, Norway.",
    "description_length": 920
  },
  {
    "ticker": "HELG.OL",
    "company_name": "SpareBank 1 Helgeland",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "SpareBank 1 Helgeland provides various financial products and services to retail customers, small and medium enterprises, municipal authorities, and institutions in Norway. The company operates in two segments, Corporate and Retail banking. It offers savings, investment, pension, and insurance products, as well as leasing and mortgage services. The company is also involved in owning, managing, and letting of commercial properties. SpareBank 1 Helgeland was founded in 1860 and is headquartered in Mo i Rana, Norway.",
    "description_length": 519
  },
  {
    "ticker": "NONG.OL",
    "company_name": "SpareBank 1 Nord-Norge",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "SpareBank 1 Nord-Norge provides banking services in Northern Norway. The company operates through Retail Market and Corporate Market segments. It offers savings and pension accounts; deposits; bank guarantees; letters of credit; and foreign currency accounts, as well as debit and credit card services. The company provides mortgage, car, consumer, boat, caravans, vehicle, and green loans; and other loan related services. It also offers vehicle, home, travel, valuable item, car, personal, and pet insurance services. Further, the company offers accounting services, real estate brokerage, leasing/sale-leaseback financing, refinancing, payment, and mobile and online banking services. SpareBank 1 Nord-Norge was founded in 1836 and is headquartered in Tromsø, Norway.",
    "description_length": 770
  },
  {
    "ticker": "SNOR.OL",
    "company_name": "SpareBank 1 Nordmøre",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "SpareBank 1 Nordmøre provides various banking products and services in Norway. The company offers business insurance products, including vehicle and machinery, value and building, employee and personnel, and farm and agricultural insurance; personal insurance products, such as car, home, personal, pet, vehicle, travel, and valuables insurance products; pension products; bank cards; payment and debt collection services; and mobile and online banking services. It also provides bank guarantees, operating credit products for agriculture, and factoring and leasing products and services, as well as savings and deposit accounts, refinancing, and mortgage services. SpareBank 1 Nordmøre was founded in 1835 and is based in Kristiansund, Norway. SpareBank 1 Nordmøre is a subsidiary of SpareBank 1 Gruppen AS.",
    "description_length": 808
  },
  {
    "ticker": "RING.OL",
    "company_name": "SpareBank 1 Ringerike Hadeland",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "SpareBank 1 Ringerike Hadeland, a financial institution, provides various banking products and services to private and corporate customers in Norway. The company accepts various deposits, including savings, current, deposit, and currency accounts. It also provides car, consumer, vehicle, transferring, business, and construction loans, as well as mortgage and refinancing loans; financing services, such as agricultural operating credit, factoring, overdraft, and leasing; bank guarantees; car, home, personal, pet, vehicle and machinery, travel, employee, farm and agricultural, and other insurance products; pension products; and savings and investment products. In addition, the company offers debit and credit cards, as well as mobile and online banking services. Further, it provides real estate brokerage, consulting, and accounting services. SpareBank 1 Ringerike Hadeland was founded in 1833 and is headquartered in Hønefoss, Norway.",
    "description_length": 942
  },
  {
    "ticker": "MING.OL",
    "company_name": "SpareBank 1 SMN",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "SpareBank 1 SMN, together with its subsidiaries, provides various banking, accounting, and real estate products and services to private individuals and companies in Norway and internationally. The company offers checking, current, buffer, savings, deposit, business, tax withholding, investment, and group accounts; green and fixed rate deposits; mortgage, car, consumer, green, vehicle, home, construction, and business loans; debit, credit, virtual, deposit, and municipal payment cards; and pension services. It also provides car, housing, person, animal, vehicle, travel, valuable item, workshop, transport, housing association and condominium, construction, property, trade and service, team and association, agriculture and small farming, consulting and service, machine, building and value, and employee insurance products. In addition, the company offers refinancing, overdraft, leasing, factoring, agricultural operating credit, sales invoice, cash, stocks and investment, accounting, HR, tax and fee, transactional advice, IT, business, and consulting services; bank guarantees; and online and mobile banking services, as well as buys and sells properties. The company distributes its products through physical branches, customer service center, and digital channels. SpareBank 1 SMN was founded in 1823 and is headquartered in Trondheim, Norway.",
    "description_length": 1356
  },
  {
    "ticker": "SB1NO.OL",
    "company_name": "SpareBank 1 Sør-Norge ASA",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "SpareBank 1 Sør-Norge ASA, together with its subsidiaries, provides various financial products and services for personal and corporate customers in Norway. The company operates through Retail Market, Corporate Market, SME & Agriculture, and Other Activities segments. It offers savings, loans, insurance, and pension products. The company also provides account and payment, international cash management, foreign exchange, administrative securities, accounting, estate agency, HR, securities trading, and investment services; green loans; credit cards; consulting; commercial properties for leasing; and banking services. In addition, it facilitates and advises debt and equity funding; and sells real estate properties, homes, and commercial properties. Further, the company is involved in the customer trading of interest-rate instruments; and purchasing of home mortgages. It serves retail and corporate, SME, small business, and agricultural customers, as well as the public sector. The company was founded in 1839 and is headquartered in Stavanger, Norway.",
    "description_length": 1061
  },
  {
    "ticker": "SOAG.OL",
    "company_name": "SpareBank 1 Østfold Akershus",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "SpareBank 1 Østfold Akershus operates as a savings bank that provides various banking products and services in Norway. It offers savings in funds; savings accounts; savings for children and retirement; and stocks and investment products. The company also provides mortgage, car, moving, consumer, vehicle, green, and transferring loans, as well as refinancing of mortgage and consumer debt; financing services, including overdrafts, leasing, business loans, bank guarantees, construction loans, growth guarantee schemes, operating credit for agriculture, factoring, and invoice sales. In addition, it offers pension products; car, home, personal, pet, vehicle, travel, machinery, building, employee and personal, and farm and agricultural insurances; and property services. Further, the company provides mobile and online banking; bank card and credit card; and pay and transfer services. The company was founded in 1835 and is based in Moss, Norway.",
    "description_length": 950
  },
  {
    "ticker": "SPOL.OL",
    "company_name": "SpareBank 1 Østlandet",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "SpareBank 1 Østlandet provides various financial products and services to individuals, businesses, the public sector, clubs, and societies. The company operates through Retail, Corporate, and Organisation Market and Capital Market segments. The Retail segment provides financial services comprising of savings, money transfer, insurance, accident prevention, financing, money transfer, capital, and investment management services. The Corporate segment offers interest rate, currency hedging, and investment related services, as well as insurance services for property. The Organisation Market and Capital Market segment provides risk based advisory solutions to high-net-worth individuals and corporates, as well as engages in foreign currency services. SpareBank 1 Østlandet was founded in 1845 and is headquartered in Hamar, Norway.",
    "description_length": 835
  },
  {
    "ticker": "MORG.OL",
    "company_name": "Sparebanken Møre",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Sparebanken Møre, together with its subsidiaries, provides banking services for retail and corporate customers in Norway. The company operates through Retail and Real Estate Brokerage segments. It offers services in the areas of financing, deposits and other forms of investments, payment transfers, financial advisory services, asset management, insurance, and real estate brokerage. Sparebanken Møre was founded in 1843 and is headquartered in Ålesund, Norway.",
    "description_length": 462
  },
  {
    "ticker": "SBNOR.OL",
    "company_name": "Sparebanken Norge",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Sparebanken Vest, a financial services company, provides banking and financing services in the counties of Vestland and Rogaland, Norway. The company operates through Corporate Market, Retail Market, Bulder Bank, Treasury, and Estate Agency Activities segments. It is also involved in investment banking, trading in securities for professional investors, leasing and sales mortgage loans, and real estate agency business. The company was formerly known as Sparebanken Vest and change its name to Sparebanken Norge in May 2025. The company was founded in 1823 and is headquartered in Bergen, Norway.",
    "description_length": 598
  },
  {
    "ticker": "SPOG.OL",
    "company_name": "Sparebanken Øst",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Sparebanken Øst operates as a savings bank in Eastern Norway. The company offers savings accounts, retirement savings, guardianship accounts, and deposit accounts; car loans, home and green mortgage loans, and framework loans, as well as refinancing services; and mortgage loans for new and used cars. It also provides vehicles, houses and contents, boats, leisure, life and health, child, travel, and disability insurance products; shares and funds trading, and investment banking services; placement and payment processing services; and online and mobile banking services. In addition, the company buys, sells, and stores cryptocurrencies; and operates, leases, and sells real estate properties. Sparebanken Øst was founded in 1843 and is headquartered in Drammen, Norway.",
    "description_length": 774
  },
  {
    "ticker": "SPIR.OL",
    "company_name": "Spir Group ASA",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "original_description": "Spir Group ASA provides software solutions in Norway, Sweden, and internationally. The company offers Samsvar, a system that helps consumers keep track of legal requirements related to privacy and information security; PixEdit, a software for automating the processing of scanning, data capture, digitalization and optimization, interactive editing, and converting all types of files/documents; Elements, Sak-Arkiv, a core system; Elements eByggesak, a software for construction case processing; AIoT, a platform for data collection; Infoland, a data source for the real estate market; Propfinder, a map service for property developers; Byggesøknaden, a digital building application for professionals; data services that include services connected to the land registry and technical information; and digital settlement process in real estate transactions. It also provides Hjemla, a real estate platform focusing on the value of residential properties; Boligmappa, a digital platform connecting all sides of the housing and real estate lifecycle; Boligmappa.no, an online service that makes for homeowners to manage their property; Boligmappa Professional, used by craftsmen and other professionals to register work, documentation, and other data; ByggeBolig.no, an online forum for homeowners and enthusiasts; and Boligmappa Data Platform used by property appraisers, electrical supervisors, and others. In addition, the company offers geodata and real estate information services; consultancy and analysis services; IT development and design, system operations, lifecycle management and support, forestry and real estate valuation, IT support to administer forestry and felling, digital support, and validation and report of environmental data services; and software-as-a-service solutions. The company was formerly known as Sikri Group ASA and changed its name to Spir Group ASA in December 2023. Spir Group ASA was founded in 2019 and is headquartered in Oslo, Norway.",
    "description_length": 1972
  },
  {
    "ticker": "SNI.OL",
    "company_name": "Stolt-Nielsen Limited",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Stolt-Nielsen Limited, together with its subsidiaries, provides transportation, storage, and distribution solutions for bulk liquid chemicals, edible oils, acids, and other specialty liquids worldwide. It operates through five segments: Tankers, Terminals, Tank Containers, Stolt Sea Farm, and Stolt-Nielsen Gas. The company also produces, processes, and markets seafood, including turbot and sole; and stores and handles chemicals, clean petroleum products, liquefied petroleum gases, vegetable oils, and biofuels, as well as alternative fuels and feedstocks. In addition, it holds investment in logistics, distribution, liquid natural gas, and land-based aquaculture businesses. The company was founded in 1959 and is based in London, the United Kingdom. Stolt-Nielsen Limited is a subsidiary of Fiducia Ltd.",
    "description_length": 810
  },
  {
    "ticker": "STB.OL",
    "company_name": "Storebrand ASA",
    "sector": "Financial Services",
    "industry": "Financial Conglomerates",
    "original_description": "Storebrand ASA provides insurance products and services in Norway, Sweden, the United Kingdom, Finland, Denmark, Germany, Luxemburg, and Ireland. It operates through four segments: Savings, Insurance, Guaranteed Pensions, and Other. The Savings segment offers retirement savings, defined contribution pensions, asset management, and retail banking products. The Insurance segment provides personal insurance, non-life insurance, personal risk, and pension-related insurance products. The Guaranteed Pensions segment offers long-term pension savings products, such as defined contribution pensions, paid-up policies, and individual capital and pension insurance products. The Other segment provides life insurance products. The company serves private individuals, businesses, public enterprises, and corporate and retail markets. Storebrand ASA was founded in 1767 and is headquartered in Lysaker, Norway.",
    "description_length": 904
  },
  {
    "ticker": "STRO.OL",
    "company_name": "StrongPoint ASA",
    "sector": "Industrials",
    "industry": "Business Equipment & Supplies",
    "original_description": "StrongPoint ASA engages in the development, sale, and implementation of integrated technology solutions to retailers in Scandinavia and internationally. The company offers e-commerce logistic solutions, including order picking, automated fulfillment, warehouse management, home delivery, and various click and collect pickup solutions; in-store productivity solutions, such as electronic shelf labels, scales and wrapping systems, and ShopFlow Logistics, a cloud-based mobile logistics system for managing routines such as receiving goods, inventory, balance adjustments, label printing, and waste management. It also provides payment solutions comprising checkout efficiency solutions, including self-checkout; Vensafe, which automates in-store sales of restricted and high-theft products, such as tobacco, pharmaceuticals, and other high-value items; self scanning; and POS systems, as well as multiple CashGuard models: Core, Premium, Unico, and Compact. In addition, the company is involved in equipping retail and service shops with necessary equipment, fixtures, and fittings, as well as refurbishing checkouts; and implements, personalizes, and maintains an enterprise resource management solution. The company was formerly known as PSI Group ASA and changed its name to StrongPoint ASA in September 2015. StrongPoint ASA was founded in 2000 and is headquartered in Oslo, Norway.",
    "description_length": 1386
  },
  {
    "ticker": "SUBC.OL",
    "company_name": "Subsea 7 S.A.",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "Subsea 7 S.A. delivers offshore projects and services for the energy industry worldwide. The company offers subsea field development products and services, including project management, design and engineering, procurement, fabrication, survey, installation, and commissioning of production facilities on the seabed and the tie-back of its facilities to fixed or floating platforms or to the shore. It also provides remotely operated vehicles and tooling services to support exploration and production activities and to deliver full life-of-field services; procurement and installation of offshore wind turbine foundations and inner-array cables, as well as heavy lifting operations for renewables structures and heavy transportation services; and engineering and advisory services to clients in the oil and gas, renewables, and utilities industries. In addition, the company offers engineering, procurement, installation, and commissioning of subsea oil and gas systems in deep waters; fabrication, installation, extension, and refurbishment of fixed and floating platforms and associated pipelines in shallow water environments; inspection, and repair and maintenance services, management of subsea infrastructure, and remote intervention support; and carbon capture, utilization, and storage services. The company was incorporated in 1993 and is based in Luxembourg, Luxembourg.",
    "description_length": 1380
  },
  {
    "ticker": "TGS.OL",
    "company_name": "TGS ASA",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "original_description": "TGS ASA provides geoscience data services to the oil and gas industry in Norway and internationally. The company offers geophysical data, such as multi-client seismic data; geological data comprising well data products, and interpretive studies and services; and interpretation products and data integration solutions. It also provides imaging services, which include 2D and 3D seismic imaging solution in depth and time domains; marine, land, and ocean bottom nodes; and transition zone, multi component, and 4D time-lapse processing. The company was formerly known as TGS-NOPEC Geophysical Company ASA and changed its name to TGS ASA in June 2021. TGS ASA was founded in 1981 and is headquartered in Oslo, Norway.",
    "description_length": 715
  },
  {
    "ticker": "TECH.OL",
    "company_name": "Techstep ASA",
    "sector": "Technology",
    "industry": "Communication Equipment",
    "original_description": "Techstep ASA operates as a mobile technology company in Norway, Sweden, Denmark, and Poland. It offers device lifecycle management; mobile data capture and workflow; mobile device management; procurement, logistics, and lifecycle; and mobile technology consultancy solutions. The company also provides mobile devices and accessories; and device management and security products. Techstep ASA was founded in 1996 and is headquartered in Oslo, Norway.",
    "description_length": 449
  },
  {
    "ticker": "TEKNA.OL",
    "company_name": "Tekna Holding ASA",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "original_description": "Tekna Holding ASA engages in the development, manufacture, and sale of micron and nanopowders, and plasma process solutions in North America, Europe, Asia, and internationally. It offers spherical powders, such as titanium, nickel, and aluminum alloys, as well as tungsten and tantalum; and nanopowders, including nickel, silicon, and copper nanopowders, as well as boron nitride nanotubes for use in additive manufacturing, metal injection molding, thermal spray, binder jetting, and hot isostatic pressing. The company's plasma systems include Spheroidization to produce spherical powders; Synthesis of nanopowders to produce nanomaterials; Deposition to produce coatings; PlasmaSonic, an enthalpy plasma wind tunnel, Food devices for flow fluctuation, and ENTHALPIC PROBE to measure plasma parameters. It serves aviation, aerospace, medical, mining and drilling, energy storage, and microelectronics industries. The company was founded in 1990 and is headquartered in Sherbrooke, Canada. Tekna Holding ASA is a subsidiary of Arendals Fossekompani ASA.",
    "description_length": 1054
  },
  {
    "ticker": "TEL.OL",
    "company_name": "Telenor ASA",
    "sector": "Communication Services",
    "industry": "Telecom Services",
    "original_description": "Telenor ASA, together with its subsidiaries, operates as a telecommunication company worldwide. It operates through four segments: Nordics, Asia, Infrastructure, and Amp. The company offers mobile and broadband telecom products and services, including mobile, broadband and TV services; other services, including solutions for business customers like managed services, virtual private networks, software defined networks, and network as a service; IoT solutions; and mobile maritime communication for cruise and ferry, fisheries, and oil and gas industry. It also provides hardware comprising mobile phones, broadband modems, and TV boxes; wholesale services, such as national and international roaming and interconnect, and solutions for mobile and fixed virtual network operators and service providers, as well as leased lines and colocation at towers and data centres. In addition, the company provides cloud storage service for private use and businesses that allows to back up, store, synchronize, and share files over the Internet. Telenor ASA was founded in 1855 and is headquartered in Fornebu, Norway.",
    "description_length": 1110
  },
  {
    "ticker": "TRMED.OL",
    "company_name": "Thor Medical ASA",
    "sector": "Healthcare",
    "industry": "Biotechnology",
    "original_description": "Thor Medical ASA produces and supplies alpha-particle emitters for cancer therapy in Norway. It develops Ra224, an isotope of radium; Pb-212, a radioactive isotope of lead; and Th-228, a radioactive isotope of thorium. The company was incorporated in 2009 and is headquartered in Oslo, Norway.",
    "description_length": 293
  },
  {
    "ticker": "TIETO.OL",
    "company_name": "TietoEVRY Oyj",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "original_description": "TietoEVRY Oyj operates as a software and services company. The company operates through five segments: Tietoevry Create, Tietoevry Banking, Tietoevry Care, Tietoevry Industry, and Tietoevry Tech Services. The Tietoevry Create segment provides digital agenda to create competitive products, as well as uses design, data, and cloud technologies for data-driven businesses. This segment also offers software and data engineering services. The Tietoevry Banking segment provides Banking-as-a-Service platform and software products for digital transformation and financial institutions. Tietoevry Care segment offers modular and interoperable software, reinventing Nordic health, and social care services. The Tietoevry Industry segment offers software and data solutions to various industries, such as public sector, pulp and paper, and utilities. The Tietoevry Tech Services provides enterprise-wide transformation to customers' business processes, applications and infrastructure; and deep customer knowledge, global cloud & data competencies, automated operations, and multi-cloud platform services. The company was formerly known as Tieto Oyj and changed its name to TietoEVRY Oyj in December 2019. TietoEVRY Oyj was incorporated in 1968 and is headquartered in Espoo, Finland.",
    "description_length": 1277
  },
  {
    "ticker": "TOM.OL",
    "company_name": "Tomra Systems ASA",
    "sector": "Industrials",
    "industry": "Waste Management",
    "original_description": "Tomra Systems ASA provides sensor-based solutions for optimal resource productivity worldwide. It operates through four segments: TOMRA Collection, TOMRA Recycling, TOMRA Food, and TOMRA Horizon. The company develops, produces, sales, leases, and services reverse vending machines and related data management systems; and provides pick-up, transportation, and processing services of empty beverage containers on behalf of beverage producers/fillers. It also develops, produces, sale, and service sorting and processing technology for waste management companies or plant builders; and provides sorting systems for waste and metal material streams, as well as ore sorting sensors for mining companies. In addition, the company provides post-harvest food solutions for fresh and processed food industries. Tomra Systems ASA was founded in 1972 and is headquartered in Asker, Norway.",
    "description_length": 879
  },
  {
    "ticker": "TRE.OL",
    "company_name": "Treasure ASA",
    "sector": "Financial Services",
    "industry": "Asset Management",
    "original_description": "Treasure ASA, through its 11% interest in Hyundai Glovis Co. Ltd., provides transportation and logistics services in South Korea. It operates through 119 vessels in the ro-ro and bulk cargo segment. Treasure ASA was incorporated in 2016 and is based in Lysaker, Norway. Treasure ASA is a subsidiary of Wilh. Wilhelmsen Holding ASA.",
    "description_length": 331
  },
  {
    "ticker": "TRSB.OL",
    "company_name": "Trøndelag Sparebank",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Trøndelag Sparebank, a savings bank, provides banking products and services to private and corporate customers in Norway. It offers savings and retirement accounts; car, motorcycles, motorhomes, boats, ATVs, and consumer loans, as well as refinancing; and mobile banking, online banking, and insurance products. The company also provides business banking products and services, including bank guarantee, business loans, construction loans, factoring, overdraft, and leasing products; agricultural loans and investments; insurance and pension products; and cards and payment solutions. The company was formerly known as Hemne Sparebank. Trøndelag Sparebank was founded in 1864 and is based in Kyrksæterøra, Norway.",
    "description_length": 713
  },
  {
    "ticker": "VEI.OL",
    "company_name": "Veidekke ASA",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "original_description": "Veidekke ASA operates as a construction and property development company in Norway, Sweden, and Denmark. It operates through Construction Norway, Infrastructure Norway, Construction Sweden, Infrastructure Sweden, and Denmark/Hoffmann segments. The company executes civil engineering operation with projects in the road maintenance, railways, power production, and airport segments; and infrastructure, extractive and heavy industries, energy, and recycling facilities/landfill projects, as well as asphalt-laying. It also operates as construction contractors for apartment complexes and non-residential buildings, such as schools, healthcare facilities, cultural buildings, office buildings, hotels, and shopping centres; and offers construction and renovation services for public, commercial, and residential buildings. In the addition, the company produces asphalt and aggregates. Veidekke ASA was founded in 1936 and is headquartered in Oslo, Norway.",
    "description_length": 953
  },
  {
    "ticker": "VENDA.OL",
    "company_name": "Vend Marketplaces ASA",
    "sector": "Communication Services",
    "industry": "Internet Content & Information",
    "original_description": "Vend Marketplaces ASA, together with its subsidiaries, operates as a media company. It operates through Mobility, Real Estate, Jobs, Recommerce, and Delivery segments. The company operates online classifieds that provide technology-based services to connect buyers and sellers, and facilitate transactions, including job offers, real estate, cars, travel, consumer goods, and others; used car marketplace; and recommerce marketplaces. It also offers Jobs marketplace; door-to-door deliveries for second-hand goods sold through marketplaces; solutions for consumers to sell their cars to dealers; and delivers fresh baked goods, food, and flowers directly to customer doors, as well as manages media distribution and ecommerce parcel deliveries. The company provides its products under the FINN, Blocket, Bytbil, Bilinfo, Bilbasen, Tori, DBA, Tise, Nettbil, AutoVex, Oikotie, Qasa, Helthjem, Morgenlevering, HomeQ, Remppatori, Scrimba, Hjemmelegene, Insurello, Bookis, Gire, Maja, Campanyon, Unlock, pej, FundingPartner, compricer, SYD, Demando, Hygglo, advized, torn, Wheelaway, Mittanbud, Inzpire.me, Di, Mindler, Yepstr, plick, SAVR, Dintero, Tibber, 3byggetbud.dk, Linear, nomono, knips, homely, Firi, turnr, fixrate, Askin, The Mindfulness App, tillit, Zoopit, Hypoteket, Albert, and Servicefinder brands. It operates in Norway, Sweden, Finland, Denmark, and other Europe countries. The company was formerly known as Schibsted ASA and changed its name to Vend Marketplaces ASA in May 2025. Vend Marketplaces ASA was founded in 1839 and is headquartered in Oslo, Norway.",
    "description_length": 1573
  },
  {
    "ticker": "VENDB.OL",
    "company_name": "Vend Marketplaces ASA",
    "sector": "Communication Services",
    "industry": "Internet Content & Information",
    "original_description": "Vend Marketplaces ASA, together with its subsidiaries, operates as a media company. It operates through Mobility, Real Estate, Jobs, Recommerce, and Delivery segments. The company operates online classifieds that provide technology-based services to connect buyers and sellers, and facilitate transactions, including job offers, real estate, cars, travel, consumer goods, and others; used car marketplace; and recommerce marketplaces. It also offers Jobs marketplace; door-to-door deliveries for second-hand goods sold through marketplaces; solutions for consumers to sell their cars to dealers; and delivers fresh baked goods, food, and flowers directly to customer doors, as well as manages media distribution and ecommerce parcel deliveries. The company provides its products under the FINN, Blocket, Bytbil, Bilinfo, Bilbasen, Tori, DBA, Tise, Nettbil, AutoVex, Oikotie, Qasa, Helthjem, Morgenlevering, HomeQ, Remppatori, Scrimba, Hjemmelegene, Insurello, Bookis, Gire, Maja, Campanyon, Unlock, pej, FundingPartner, compricer, SYD, Demando, Hygglo, advized, torn, Wheelaway, Mittanbud, Inzpire.me, Di, Mindler, Yepstr, plick, SAVR, Dintero, Tibber, 3byggetbud.dk, Linear, nomono, knips, homely, Firi, turnr, fixrate, Askin, The Mindfulness App, tillit, Zoopit, Hypoteket, Albert, and Servicefinder brands. It operates in Norway, Sweden, Finland, Denmark, and other Europe countries. The company was formerly known as Schibsted ASA and changed its name to Vend Marketplaces ASA in May 2025. Vend Marketplaces ASA was founded in 1839 and is headquartered in Oslo, Norway.",
    "description_length": 1573
  },
  {
    "ticker": "VISTN.OL",
    "company_name": "Vistin Pharma ASA",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "original_description": "Vistin Pharma ASA, through its subsidiary, Vistin Pharma AS, engages in the production and sale of active pharmaceutical ingredients (APIs) worldwide. It offers metformin HCl APIs and direct compressive granulates for the pharmaceutical industry. The company was founded in 1969 and is based in Oslo, Norway.",
    "description_length": 308
  },
  {
    "ticker": "VVL.OL",
    "company_name": "Voss Veksel- og Landmandsbank ASA",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "original_description": "Voss Veksel- og Landmandsbank ASA provides banking products and services to private individuals and companies in Norway. The company offers saving accounts; car and other vehicle, home, small, and construction loans; overdrafts facilities; leasing services; bank guarantees; bank and payment cards; insurance products; and online and mobile banking services. The company was founded in 1843 and is based in Voss, Norway.",
    "description_length": 420
  },
  {
    "ticker": "VOW.OL",
    "company_name": "Vow ASA",
    "sector": "Industrials",
    "industry": "Pollution & Treatment Controls",
    "original_description": "Vow ASA, together with its subsidiaries, produces, delivers, and maintains systems for processing and purifying wastewater, food waste, solid waste, and bio sludge in Norway, France, Poland, the United States, and Italy. It operates through Industrial Solutions, Maritime Solutions, and Aftersales segments. The Industrial Solutions segment designs and provides systems to valorise biomass residues and waste into renewable products, chemicals, and fossil free energy through pyrolysis solutions. The Maritime Solution segment provides Scanship's operations and delivers technological solutions for wastewater treatment, food waste processing, and waste management for the cruise industry. The Aftersales segment provides spare parts and consumables; and services on systems delivered to shipowners. In addition, the company offers Biogreen, a patented pyrolysis process for converting biomass, plastics, and waste into energy; and Safesteril, a patented sterilisation process for food and pharmaceutical ingredients. Further, the company develops, designs, and fabricates industrial furnaces and equipment. It serves cruise and landbased industries. The company has a strategic partnership agreement with Repsol, S.A. The company was formerly known as Scanship Holding ASA and changed its name to VOW ASA in January 2020. Vow ASA was founded in 2011 and is headquartered in Oslo, Norway.",
    "description_length": 1388
  },
  {
    "ticker": "VAR.OL",
    "company_name": "Vår Energi AS",
    "sector": "Energy",
    "industry": "Oil & Gas E&P",
    "original_description": "Vår Energi AS operates as an independent upstream oil and gas company on the Norwegian continental shelf in Norway. It produces crude oil and natural gas liquids. The company was formerly known as Eni Norge AS and changed its name to Vår Energi AS in December 2018. The company was incorporated in 1965 and is headquartered in Sandnes, Norway. Vår Energi AS operates as a subsidiary of Eni International B.V.",
    "description_length": 408
  },
  {
    "ticker": "WAWI.OL",
    "company_name": "Wallenius Wilhelmsen ASA",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Wallenius Wilhelmsen ASA, together with its subsidiaries, engages in the logistics and transportation business worldwide. It operates in three segments: Shipping Services, Logistics Services, and Government Services. The company provides ship management services, including crewing, technical, and management; insurance brokerage services; agency services; freight and liner services; and marine products to vessels. It also offers ocean transport of cars and RoRo cargo, as well as manufacturers, construction, and other high and heavy equipment. In addition, the company provides vehicle processing center, equipment processing center, and inland distribution network and terminal services; and ocean transport for breakbulk and vehicles. The company serves agriculture, automotive, aviation, boats and yachts, breakbulk, commercial vehicles, construction, machinery and machine tools, mining, oil and gas, power and energy, and rail industries. It operates through a fleet of 125 vessels sailing on 15 trade routes. The company was founded in 1861 and is based in Lysaker, Norway.",
    "description_length": 1083
  },
  {
    "ticker": "WSTEP.OL",
    "company_name": "Webstep ASA",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "original_description": "Webstep ASA provides information technology (IT) consultancy services to public and private businesses in Norway and Sweden. The company offers consulting, digitalization, .Net, Java, open source, full stack, front and back end, user experience, integration, Artificial Intelligence, mobility, cloud apps, machine learning, business intelligence, big data, data warehousing, Internet of Things, virtual robotics, devops, application service management, data science, and project and test management services. It also provides ISTQB, PMP, Prince 2, ITIL, scrum, delivery projects, CRM, ERP, process management, project management methodology, facilitating, controller, program coordination, contract management, offshoring management, and mentoring services; mobility, cloud computing, cloud services, integration, sensor technology, product development, service development, beacons, enterprise user experience, web analysis, design team, amazon web services, azure, big data, prediction, mobility, predictive modelling, workshops, hackathons, business analysis, and search engine optimalisation services. The company serves banking, finance and insurance, public administration, agriculture and food production, IT and telecommunication, commerce, and transportation industries. The company was founded in 2000 and is headquartered in Oslo, Norway.",
    "description_length": 1349
  },
  {
    "ticker": "WWI.OL",
    "company_name": "Wilh. Wilhelmsen Holding ASA",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Wilh. Wilhelmsen Holding ASA provides maritime products and services worldwide. It operates through Maritime Services, New Energy, and Strategic Holdings and Investments segments. The company offers pumps, accessories, and spares; cleaning, water treatment, and fuel oil chemicals, as well as test kits, reagents, and marine chemicals equipment; air tools equipment, accessories, consumables, and spares; accessories, consumables, and spares for electric tools; mobile and stationary high-pressure cleaners and systems, vacuum cleaning equipment, circulation cleaning unit, cargo hold cleaning, ultrasonic part and filter cleaners, and workwear/PPE, as well as application, dilution, and mixing equipment; and gases, spangases, regulators, refrigerants, offshore racks, and gas distribution systems. It also provides refrigeration equipment tools, package equipment, secondary refrigerants and lubricants, and system equipment and spares; arc welding equipment, consumables, and storing; gas welding, brazing, and cutting; cold repair systems; oil spill equipment; mooring ropes, rope stretchers, accessories, and rope protection; mineral grease and oil, synthetic oil, and EAL grease and oil; and emission control chemicals and test kits. It also provides ship agency services and logistics to the merchant fleet, as well as ship management services, including manning for various vessels. In addition, the company engages in the operation of supply bases for the offshore industry; development and operation of real estate properties on and off the supply bases; and maintenance of rigs and handling of logistics related to international pipeline projects and windmill parks. Further, it offers technical and crew management services, and digital solutions; marine and non-marine insurance services; and training, supply chain, finance, HR, and IT services. The company was founded in 1861 and is headquartered in Lysaker, Norway. Wilh. Wilhelmsen Holding ASA is a subsidiary of Tallyman AS.",
    "description_length": 1993
  },
  {
    "ticker": "WWIB.OL",
    "company_name": "Wilh. Wilhelmsen Holding ASA",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "original_description": "Wilh. Wilhelmsen Holding ASA provides maritime products and services worldwide. It operates through Maritime Services, New Energy, and Strategic Holdings and Investments segments. The company offers pumps, accessories, and spares; cleaning, water treatment, and fuel oil chemicals, as well as test kits, reagents, and marine chemicals equipment; air tools equipment, accessories, consumables, and spares; accessories, consumables, and spares for electric tools; mobile and stationary high-pressure cleaners and systems, vacuum cleaning equipment, circulation cleaning unit, cargo hold cleaning, ultrasonic part and filter cleaners, and workwear/PPE, as well as application, dilution, and mixing equipment; and gases, spangases, regulators, refrigerants, offshore racks, and gas distribution systems. It also provides refrigeration equipment tools, package equipment, secondary refrigerants and lubricants, and system equipment and spares; arc welding equipment, consumables, and storing; gas welding, brazing, and cutting; cold repair systems; oil spill equipment; mooring ropes, rope stretchers, accessories, and rope protection; mineral grease and oil, synthetic oil, and EAL grease and oil; and emission control chemicals and test kits. It also provides ship agency services and logistics to the merchant fleet, as well as ship management services, including manning for various vessels. In addition, the company engages in the operation of supply bases for the offshore industry; development and operation of real estate properties on and off the supply bases; and maintenance of rigs and handling of logistics related to international pipeline projects and windmill parks. Further, it offers technical and crew management services, and digital solutions; marine and non-marine insurance services; and training, supply chain, finance, HR, and IT services. The company was founded in 1861 and is headquartered in Lysaker, Norway. Wilh. Wilhelmsen Holding ASA is a subsidiary of Tallyman AS.",
    "description_length": 1993
  },
  {
    "ticker": "YAR.OL",
    "company_name": "Yara International ASA",
    "sector": "Basic Materials",
    "industry": "Agricultural Inputs",
    "original_description": "Yara International ASA provides crop nutrition and industrial solutions in Norway, European Union, Europe, Africa, Asia, North and Latin America, Australia, and New Zealand. The company offers ammonium- and urea-based fertilizers; compound fertilizers that contain nutrients, such as nitrogen, phosphorus, and potassium; coatings; biostimulants; organic-based fertilizers; green fertilizers are nitrate-based mineral fertilizers, as well as foliar and fertigation solutions; and nitrate, calcium nitrate, micronutrient, and fertigation and urea fertilizers. It also offers digital solutions, such as variable rate application solutions; N-sensors, a tractor-mounted hardware; N-Tester, a handheld nitrogen measurement tool; YaraFX Insight, an agricultural API; and Atfarm, a digital toolbox for farmer; Yara FarmCare, a mobile app for farmers; Yara AllFarm, a farm management platform; YaraConnect, a mobile app for retailers; Yara E-commerce, a platform that enables customer access to nutritional solutions; Tankmix, an app that provides guidelines. Further, it offers Yara Crop Nutrition Recommendation System. The company sells its products under YaraBela, YaraMila, YaraLiva, YaraVita, YaraAmplix, YaraRega, YaraTera, YaraSuna, and YaraVera and brands. Yara International ASA was founded in 1905 and is headquartered in Oslo, Norway.",
    "description_length": 1338
  },
  {
    "ticker": "ZAL.OL",
    "company_name": "Zalaris ASA",
    "sector": "Industrials",
    "industry": "Staffing & Employment Services",
    "original_description": "Zalaris ASA, together with its subsidiaries, provides full-service outsourced personnel and payroll services. It operates through two segments, Managed Services and Zalaris Consulting. The Managed Services segment offers a range of payroll and human resource (HR) outsourcing services, including payroll processing, time and attendance, travel expenses; and cloud-based HR functionality services, such as talent management, digital personnel archive, HR analytics, and mobile solutions, etc. Its Zalaris Consulting segment engages in the implementation of SAP HCM and Payroll, and SuccessFactors; and provision of AMO services, which assists customers with maintenance and support of on-premises SAP solutions. The company also offers business processing outsourcing; and consulting services. It operates in Norway, Sweden, Denmark, Finland, Spain, France, Ireland, the United Kingdom, Germany, Latvia, Poland, Hungary, Czechia, India, Singapore, the Philippines, Australia, and internationally. The company was formerly known as Zalaris HR Services AS and changed its name to Zalaris ASA in May 2014. Zalaris ASA was founded in 2000 and is headquartered in Oslo, Norway.",
    "description_length": 1171
  },
  {
    "ticker": "ZAP.OL",
    "company_name": "Zaptec ASA",
    "sector": "Consumer Cyclical",
    "industry": "Auto Parts",
    "original_description": "Zaptec ASA engages in the development and sale of chargers, charging systems, and services for electric car charging in Norway, Sweden, Switzerland, Denmark, Iceland, rest of Europe, and internationally. It offers Zaptec Go and Zaptec Pro alternating current walls charging station for indoor and outdoor use; Zaptec Portal, a cloud platform that monitors, balances, and optimizes the load between charging stations, while displaying real-time power usage; and Zaptec Sense for automatically adjusting the charging speed in the buildings. The company also offers accessories, including covers, charging cables, cable holders, RFID tags, and load balancers. Zaptec ASA was incorporated in 2012 and is headquartered in Stavanger, Norway.",
    "description_length": 735
  },
  {
    "ticker": "ZLNA.OL",
    "company_name": "Zelluna ASA",
    "sector": "Healthcare",
    "industry": "Biotechnology",
    "original_description": "Zelluna ASA develops T-cell receptor (TCR) cellular immunotherapy products for the treatment of solid cancers. The company was founded in 2016 and is based in Oslo, Norway.",
    "description_length": 172
  },
  {
    "ticker": "PLT.OL",
    "company_name": "poLight ASA",
    "sector": "Technology",
    "industry": "Electronic Components",
    "original_description": "poLight ASA develops optical lens for consumer devices and professional applications in Europe, Asia, and the United States. The company's lens replicates the lens of the human eye enabling the implementation of autofocus functions for various applications. Its product portfolio includes TLens, a tuneable optical lens for autofocus camera applications; Packaged TLens that facilitates integration of a TLens on a fixed-focus camera module; driver ASIC is designed to drive capacitive loads, such as the TLens autofocus actuators; and evaluation kits that allows to test and evaluate the optical and electrical performance of the TLens in new products and/or applications. It serves smartphones and wearables, industrial, augmented reality, healthcare, and webcams markets. poLight ASA was founded in 2005 and is headquartered in Tønsberg, Norway.",
    "description_length": 848
  }
]