[
  {
    "ticker": "2020.OL",
    "company_name": "2020 Bulkers Ltd.",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "2020 Bulkers Ltd. eier og driver large tørrbulkskip globalt. Selskapet driver six scrubber fitted 208,000 deadweight tonnage Newcastlemax tørrbulkskip. 2020 Bulkers Ltd. ble stiftet i 2017 og har base i Hamilton, Bermuda.",
    "description_length": 221
  },
  {
    "ticker": "ABG.OL",
    "company_name": "ABG Sundal Collier Holding ASA",
    "sector": "Finans",
    "industry": "Kapitalmarkeder",
    "original_description": "ABG Sundal Collier Holding ASA, sammen med sine datterselskaper, tilbyr investment banking, stock broking, og corporate advisory tjenester in Norway, Sweden, Denmark, og internasjonalt. Selskapet driver gjennom Corporate Financing, M&A and Advisory, and Brokerage and Research segmenter. Selskapet tilbyr corporate financing tjenester for corporate kunder for raising capital gjennom equity or debt financing. Selskapet also tilbyr advisory tjenester in mergers, acquisitions, og sales, as well as various real eiendel transactions og other advisory tjenester. In addition, selskapet tilbyr research og brokerage tjenester comprising secondary security brokerage og research advisory tjenester. ABG Sundal Collier Holding ASA ble grunnlagt i 1984 og har hovedkontor i Oslo, Norway.",
    "description_length": 781
  },
  {
    "ticker": "ABL.OL",
    "company_name": "ABL Group ASA",
    "sector": "Industri",
    "industry": "Specialty Business Services",
    "original_description": "ABL Group ASA, an investerings- og holdingselskap, tilbyr energi, og marine and engineering konsulenttjenester to renewables, maritime, og olje og gass industries globalt. Selskapet tilbyr technical due diligence; owner's engineering; project utvikling; geotechnical og geophysical; HSEQ and risikorådgivning; marine drift og engineering; marine design, upgrade, og conversion; site investigations; clean shipping; engineering og design, jack-up og vindpark installation vessel support; advanced analysis og simulation; digital; subsea cables; og client reps og secondment tjenester. Selskapet also tilbyr eiendel forvaltning, vedlikehold, inventory, og data optimization løsninger; marine surveys, inspections, og audits, inkludert vessel og marine assurance, rig inspections, industry standard audit, vessel condition surveys, pre-purchase survey, og dynamic positioning, as well as marine warranty survey tjenester. In addition, it tilbyr marine casualty forvaltning comprising marine salvage og wreck removal consultancy, hull og machinery claims, og P&I claims tjenester; og expert witness og litigation support tjenester. Further, selskapet tilbyr programvareløsninger, such as EFFIO, a cloud-based data build og optimization software for eiendel forvaltning strategy; ePAV, a data collection, audit, og verification software; emiTr, an emissions tracking software; iQx, a plug-and-play boring software; hiQbe, a teknologi that produces qualitative data og enables game-changing efficiencies in velocity modelling; og AssetVoice, an automated workflow og real-time eiendel tracking software, as well as AquaSafe, a dashboard løsning for crystal clear data presentation in water-related sectors. Selskapet var tidligere kjent som AqualisBraemar LOC ASA og endret navn til ABL Group ASA in June 2022. Selskapet ble stiftet i 2014 og har hovedkontor i London, the United Kingdom.",
    "description_length": 1882
  },
  {
    "ticker": "AFG.OL",
    "company_name": "AF Gruppen ASA",
    "sector": "Industri",
    "industry": "Ingeniør- og entreprenørvirksomhet",
    "original_description": "AF Gruppen ASA, a entreprenør- og industriselskap, tilbyr civil engineering, bygging, energi og environment, and property og offshore tjenester in Norway and Sweden. Selskapet tilbyr civil ingeniørtjenester, inkludert bygging of various projects, such as roads, railways, bridges, port facilities, airports, tunnels, foundation work, renovation og bygging of concrete structures, power og energi plants, og onshore facilities for olje og gass; og concrete teknologi, groundwork og earthmoving, geomatics og surveying, and project support tjenester. Selskapet also driver as a turnkey contractor for the utvikling og planning to buildings comprising residential, commercial, public buildings, og rehabilitation and rebuilding, as well as tilbyr extension work tjenester. In addition, it tilbyr energi løsninger, which includes energi performing contracting, technical turnkey contract, local power supply, og technical tjenester og vedlikehold; and energi løsninger for existing og new buildings. Further, selskapet manages bygging og decommissioning projects, inkludert removal og recycling of offshore installations; tilbyr turnkey tjenester in the areas of cooling og ventilation for onshore og offshore installations, rigs, og ships, as well as havvind tjenester; og driver as a contractor for demolition og environmental clean-up tjenester for buildings og structures, such as blasting, dredging, handling of contaminated bulk material, og removal of shipwrecks. Additionally, it tilbyr office spaces on rental basis, og salg of homes. AF Gruppen ASA ble grunnlagt i 1985 og har hovedkontor i Oslo, Norway.",
    "description_length": 1610
  },
  {
    "ticker": "AKVA.OL",
    "company_name": "AKVA group ASA",
    "sector": "Industri",
    "industry": "Farm og Heavy Construction Machinery",
    "original_description": "AKVA group ASA designer, purchases, produserer, assembles, selger, og installs teknologi produkter; og tilbyr rental and rådgivningstjenester for the aquaculture industry. Selskapet driver in three segmenter: Sea Based Technology (SBT), Digital, and Land Based Technology (LBT). The SBT segment tilbyr nets, plastic pens, steel pens, mooring, special nets, remotely operating vehicles systems, net cleaning, marine engineering, lab tjenester, boats, ytterligere equipment, pipes, feed barges, feed systems, lights, camera, sensors, og deep farming løsninger such as nautilus, tubenet, og opticage. This segment also tilbyr PE-boats for the fish-farming, diving, og the olje og gass tjeneste industries. The Digital segment tilbyr monitoring og reporting løsninger under the brand the AKVA Fishtalk, AKVA connect, AKVA Submerged, and AKVA ecosystem names. The LBT segment includes design, engineering, tanks, piping, feeding systems, software, cameras, og sensors, as well as tilbyr water quality conditions for fresh og seawater drift. Selskapet driver in Norway, Europe, Canada, China, Chile, Iceland, Russia, og internasjonalt. Selskapet ble stiftet i 1982 og har hovedkontor i Klepp Stasjon, Norway. AKVA group ASA er et datterselskap av Egersund Group AS.",
    "description_length": 1259
  },
  {
    "ticker": "AMSC.OL",
    "company_name": "AMSC ASA",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "AMSC ASA har ikke betydelig virksomhet. Previously, selskapet invested in maritime eiendeler og companies in the United States. Selskapet var tidligere kjent som American rederi ASA og endret navn til AMSC ASA in October 2022. AMSC ASA ble grunnlagt i 2005 og har hovedkontor i Lysaker, Norway.",
    "description_length": 294
  },
  {
    "ticker": "AGLX.OL",
    "company_name": "Agilyx ASA",
    "sector": "Industri",
    "industry": "Avfallshåndtering",
    "original_description": "Agilyx ASA, sammen med sine datterselskaper, tilbyr plastic waste løsninger in Europe, the United States, og the Asia pacific. Selskapet driver gjennom two segmenter, Agilyx and Cyclyx. Selskapet tilbyr Styrenyx, a recycling teknologi that uses catalyst-free depolymerization to recycle polystyrene waste; Cyclyx which supplies custom-formulated feedstock derived from plastic waste; Plastyx, a feedstock supplier; og TruStyrenyx, a teknologi platform for the recycling of polystyrene. Selskapet also licenses its patented conversion teknologi og selger its patented equipment to industry players. Agilyx ASA ble grunnlagt i 2004 og har hovedkontor i Tigard, Oregon.",
    "description_length": 666
  },
  {
    "ticker": "AIRX.OL",
    "company_name": "Airthings ASA",
    "sector": "Industri",
    "industry": "Elektrisk utstyr og deler",
    "original_description": "Airthings ASA, a hardware-enabled software company, driver med the utvikling of produkter og systems for monitoring indoor air quality, radon, og energi efficiency globalt. Selskapet driver gjennom Consumer, Business, and Professional segmenter. The Consumer segment selger air quality sensors to private kunder gjennom retail og e-commerce. The Business segment tilbyr air quality løsninger to schools, office buildings, og other commercial buildings. The Professional segment selger measurement løsninger, which enable inspectors og certified radon professionals to measure, analyze, og report on buildings; og tilbyr rental of produkter og calibration tjenester. In addition, it tilbyr digital radon detectors, as well as smart indoor air quality monitors and løsninger. Selskapet tilbyr its produkter under the View Plus, View Pollution, View Radon, Wave Plus, Wave Radon, Wave Mini, House Kit, Hub, Corentium Home, Plus, and Pro brands. Airthings ASA ble stiftet i 2008 og har hovedkontor i Oslo, Norway.",
    "description_length": 1009
  },
  {
    "ticker": "AKAST.OL",
    "company_name": "Akastor ASA",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "Akastor ASA driver as an oilfield tjenester investment company in Norway og internasjonalt. Selskapet driver HMH, AKOFS Offshore, DDW Offshore, and Other holdings. Selskapet tilbyr vessel-based subsea well bygging og intervention tjenester to the olje og gass industry. Its HMH segmenter tilby delivery capabilities, capital, renowned industry expertise og delivers the full range of offshore boring equipment produkter og packages at scale. The AKOFS Offshore segment tilbyr vessel-based subsea well bygging og intervention tjenester to the olje og gass industry, covering all phases from conceptual utvikling to project execution, og offshore drift. Its DDW Offshore three Anchor Handling Tug Supply AHTS vessels, operate og support kunder on a world-wide basis, og handling, towing, og supply tjenester. The other holding segment tilby joint venture fon energi tjenester, equity instruments. Selskapet also includes anchor-handling, towing, og supply tjenester to offshore olje og gass fields. In addition, selskapet tilbyr a range of offshore boring equipment produkter og packages. Selskapet owns offshore vessels og anchor handling tug supply vessels. Akastor ASA ble grunnlagt i 1841 og har base i Bærum, Norway.",
    "description_length": 1219
  },
  {
    "ticker": "AKER.OL",
    "company_name": "Aker ASA",
    "sector": "Industri",
    "industry": "Konglomerater",
    "original_description": "Aker ASA driver as an industrielt investeringsselskap in Norway, Europa, North America, South America, og internasjonalt. Selskapet driver in two segmenter: Industrial Holdings and Financial Investments. Selskapet is involved in leting og produksjon of olje og gass; provision of løsninger, produkter, and ingeniørtjenester to the energi industry; utvikling of renewable energi og green technologies; og provision of vessels to global offshore energi markedsfører. In addition, selskapet utvikler og supplies krill-based produkter, og health and nutrition produkter; harvests krill for ingredients for human og animal nutrition; og farms salmon. Further, it tilbyr Cognite Data Fusion, which collects, structures, og models industrial data throughout the value chain that enables users to share data between partners og suppliers in real time; og digital twin software for the digital representation of physical eiendeler. Additionally, selskapet tilbyr other listed investments, cash holdings, eiendel forvaltning, interest-bearing receivables, og other equity investments og eiendeler, as well as driver med eiendom aktiviteter. Selskapet ble grunnlagt i 1841 og har base i Lysaker, Norway. Aker ASA driver as a subsidiary of TRG Holding AS.",
    "description_length": 1243
  },
  {
    "ticker": "AKRBP.OL",
    "company_name": "Aker BP ASA",
    "sector": "Energi",
    "industry": "Olje og gass EogP",
    "original_description": "Aker BP ASA explores for, utvikler, og produces olje og gass on the Norwegian Continental Shelf. Selskapet var tidligere kjent som Det norske oljeselskap ASA og endret navn til Aker BP ASA in October 2016. Aker BP ASA ble grunnlagt i 2001 og har base i Lysaker, Norway.",
    "description_length": 269
  },
  {
    "ticker": "AKBM.OL",
    "company_name": "Aker BioMarine ASA",
    "sector": "Defensive forbruksvarer",
    "industry": "Packaged Foods",
    "original_description": "Aker BioMarine ASA, a biotech innovator, utvikler og supplies krill-derived produkter for consumer health og wellness globalt. Selskapet driver gjennom three segmenter: Human Health Ingredients (HHI), Consumer Health Products, and Emerging Business. The Human Health Ingredients segment selger B2B krill oil supplements for humans under the Superba Krill brand; supplements for brain health under the LYSOVETA brand; og marine-origin DHA omega-3 from microalgae under the Revervia brand name, as well as advanced phospholipid teknologi under PL+ name. The Consumer Health Products segment selger processed og packaged krill, fish, og plants derived raw materials to retailers in the United States. The Emerging Business segment tilbyr krill oil under Kori brand name. Selskapet tilbyr protein løsninger under the Understory brand; biostimulants under KRBNX brand; og a therapeutic candidate based on omega-3 to manage og treat cardiometabolic diseases under CaPre brand name, as well as delivers circular produkter utilizing recycled industrial og marine plastic waste under AION name. Aker BioMarine ASA ble grunnlagt i 2006 og har hovedkontor i Lysaker, Norway. Aker BioMarine ASA er et datterselskap av Aker ASA.",
    "description_length": 1215
  },
  {
    "ticker": "ACC.OL",
    "company_name": "Aker Carbon Capture ASA",
    "sector": "Industri",
    "industry": "Forurensnings- og rensekontroll",
    "original_description": "Aker Carbon Capture ASA driver as a karbonfangst company. Selskapet driver a karbonfangst plant; og driver med the downstream processing og forvaltning of CO2. Selskapet also tilbyr aftermarket support tjenester to industrial plant owners og operators across various industries to reduce og remove CO2 emissions. Selskapet driver karbonfangst plants under the Just Catch, Big Catch, Just Catch Offshore, and Mobile Test Unit brands. Selskapet driver in Norway, Denmark, Sweden, the United Kingdom, the Netherlands, India, og the United States. Aker Carbon Capture ASA ble stiftet i 2020 og har hovedkontor i Lysaker, Norway.",
    "description_length": 624
  },
  {
    "ticker": "AKH.OL",
    "company_name": "Aker Horizons ASA",
    "sector": "Forsyning",
    "industry": "Fornybar forsyning",
    "original_description": "Aker Horizons ASA, gjennom sine datterselskaper, utvikler og invests in renewable energi og green teknologi private og public companies globalt. Selskapet driver gjennom Aker karbonfangst; Asset Development; Mainstream Renewable Power; Aker Horizons og holdings; and Other segmenter. Selskapet tilbyr modular og capture units for reducing og removing karbondioksid emissions of various industries, inkludert the cement, bio og waste-to-energi, gas-to-power og blue hydrogen segmenter. Selskapet also utvikler, owns, og driver industrial-scale hydrogen projects for industries, such as shipping, steel, og fertilizers; and driver onshore og havvind and solkraft generation. Selskapet driver in Australia, Norway, Korea, Ireland, Chile, South Africa, Indonesia, Colombia, the united states, UK, Germany, og internasjonalt. Selskapet ble stiftet i 2020 og har base i Lysaker, Norway. Aker Horizons ASA driver as a subsidiary of Aker Capital ASA.",
    "description_length": 942
  },
  {
    "ticker": "AKSO.OL",
    "company_name": "Aker Solutions ASA",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "Aker Solutions ASA tilbyr løsninger, produkter, systems, og tjenester to the olje og gass industry in Norway, the United States, Brazil, the United Kingdom, Malaysia, Angola, Brunei, Canada, India, og internasjonalt. Selskapet driver in two segmenter, Renewables and Field Development; and Life Cycle. Selskapet tilbyr field planning, feasibility, og concept studies; specialist engineering, prosjektledelse, og procurement tjenester; floater designer, havvind, as well as driver med design, delivery, og bygging of olje og gass produksjon, og receiving and processing facilities. Selskapet tilbyr karbonfangst, utilization og storage, vannkraft, og havvind løsninger. Further, it designer og constructs jackets for bygging tjenester og tilbyr electrification tjenester; og designer and constructs offshore olje og gass produksjon facilities og onshore receiving og processing facilities. Additionally, selskapet tilbyr vedlikehold, modifications, decommissioning, eiendel integrity forvaltning, hook-up, og completion løsninger. Selskapet ble grunnlagt i 1841 og har hovedkontor i Fornebu, Norway.",
    "description_length": 1098
  },
  {
    "ticker": "ARCH.OL",
    "company_name": "Archer Limited",
    "sector": "Energi",
    "industry": "Olje og gass Drilling",
    "original_description": "Archer Limited, sammen med sine datterselskaper, tilbyr various oilfield produkter og tjenester to the olje og gass industry in Norway, Argentina, the United Kingdom, og internasjonalt. Selskapet driver in four segmenter: Platform Operations, Well Services, Renewables, and Land Drilling. Selskapet tilbyr platform boring og workover, platform plug og abandonment, MODU Management, modular rigs, rentals, drill pipe pool, prosjektledelse og consulting, bygging og installations, and inspection tjenester. Selskapet also tilbyr well tjenester, inkludert coiled tubing, oiltools, wireline, well bygging og completion, well intervention og workover, well P&A og slot recovery, surface løsninger, geothermal, og CCUS. In addition, selskapet tilbyr land boring tjenester, inkludert boring rigs og workover tjenester. Further, selskapet tilbyr renewable energi, such as geothermal boring, district heating, carbon storage, floating havvind, wind power, og vannkraft tjenester. Selskapet var tidligere kjent som Seawell Limited og endret navn til Archer Limited in May 2011. Archer Limited ble stiftet i 2007 og har hovedkontor i Sandnes, Norway.",
    "description_length": 1139
  },
  {
    "ticker": "AZT.OL",
    "company_name": "ArcticZymes Technologies ASA",
    "sector": "Helse",
    "industry": "Bioteknologi",
    "original_description": "ArcticZymes Technologies ASA, a life sciences company, utvikler, produserer, og commercializes recombinant enzymes for use in molecular research, in vitro diagnostics, og biomanufacturing. Selskapet tilbyr shrimp alkaline phosphatase for cleanup prior to Sanger sequencing og next generation sequencing processes; cod UNG for use in viral og other molecular diagnostic assays for the removal of contaminating dU-DNA; salt active nucleases for the removal of nucleic acids during manufacturing of viral vectors, recombinant proteins, og other reagents; og double-strand specific DNases og derived kits for the removal of double stranded DNA. Selskapet also tilbyr DNA/RNA polymerases for teknologi utvikling for life science, molecular diagnostics, NGS, og synthetic biology; proteinase for microbiological diagnostics og liquid biopsies; og ligases for joining nucleic acids. Selskapet serves the molecular tools, such as research og diagnostics, and biomanufacturing markedsfører. Selskapet driver in Norway, Germany, Lithuania, France, Italy, the United Kingdom, rest of Europe, the United States, og internasjonalt. Selskapet var tidligere kjent som Biotec Pharmacon ASA og endret navn til ArcticZymes Technologies ASA in June 2020. ArcticZymes Technologies ASA ble grunnlagt i 1990 og har hovedkontor i Tromsø, Norway.",
    "description_length": 1322
  },
  {
    "ticker": "AFK.OL",
    "company_name": "Arendals Fossekompani ASA",
    "sector": "Industri",
    "industry": "Konglomerater",
    "original_description": "Arendals Fossekompani ASA, an industrielt investeringsselskap, tilbyr cyber secure satellite og mobile communications in Norway, Europe, Asia, and North America. Selskapet driver gjennom AFK Vannkraft, Group Management, NSSL Global, ENRX, Tekna, AFK Eiendom, and Alytic segmenter. Selskapet tilbyr voice og data tjenester, og IT support tjenester; og airtime, projects, hardware, og tjeneste to the maritime sector, the military og government sector, large international corporations, og the energi sector. Selskapet also generates power gjennom vannkraftverk; og owns a portefølje of companies. In addition, it tilbyr wireless induction charging løsninger to the automotive, renewable energi/wind energi, pipe fabrication, electronics, og cable and mechanical engineering; materials og plasma systems; og high-purity metal powders for applications, such as 3D printing in the aerospace, medical og consumer electronics sectors, as well as optimized induction plasma systems for industrial research og produksjon. Further, selskapet is involved in property investments. Additionally, it owns og utvikler various residential og commercial properties. Arendals Fossekompani ASA ble grunnlagt i 1896 og har hovedkontor i Arendal, Norway.",
    "description_length": 1234
  },
  {
    "ticker": "ARR.OL",
    "company_name": "Arribatec Group ASA",
    "sector": "Teknologi",
    "industry": "IT-tjenester",
    "original_description": "Arribatec Group ASA, a software og consulting company, tilbyr digital business løsninger in Norway, Europe, the Americas, og internasjonalt. Selskapet driver gjennom five segmenter: Enterprise Architecture and Business Process Management, Cloud Services, Business Services, Marine, and Hospitality. Selskapet tilbyr software og tjenester to support corporate governance. Selskapet also tilbyr cloud tjenester, inkludert consulting, outsourcing, og end-to-end cloud tjenester. In addition, it driver med the utvikling, implementation, og consulting of the eiendel forvaltning system løsninger. Further, selskapet tilbyr IT tjenester, which comprise IT drift, security, network, backup, cloud løsninger, Microsoft 365, GDPR, datacenter, og hardware; and tilbyr løsninger for businesses, inkludert ERP systems, integrations, health checks, utvikler, HR og payroll, financial og project planning, bank løsninger, and travel og expenses. Additionally, it tilbyr løsninger for self-check-in/check-out og payments for the hospitality industry. Its løsninger include QualiWare, a forvaltning system that structures og visualizes processes, aktiviteter, regulations, og requirements; Unit4 løsninger; RamBase, an ERP business løsning that gives control over the value chain; Power BI løsninger; Hypergene, a business forvaltning tool; Adra Suite that integrates with other financial systems; CatalystOne and Pagero that ensures compliance with legal og electronic billing requirements; og Vena, a planning platform that empowers og inspires finance, drift, og business. Selskapet also tilbyr various produkter, inkludert SAP, Microsoft, Orbus Software, Semine, Prophix, and Creatio. Arribatec Group ASA ble stiftet i 1998 og har hovedkontor i Oslo, Norway.",
    "description_length": 1747
  },
  {
    "ticker": "ATEA.OL",
    "company_name": "Atea ASA",
    "sector": "Teknologi",
    "industry": "IT-tjenester",
    "original_description": "Atea ASA tilbyr IT infrastructure og related løsninger for businesses og public sector organizations in the Nordic countries og Baltic regions. Selskapet tilbyr datasenter og networking løsninger comprising cloudtrack, continuity planning, backup as a tjeneste, managed datasenter, cloud intelligence tjeneste, og disaster recovery tjenester. Selskapet is also involved in software licensing og cloud løsninger. In addition, selskapet tilbyr business intelligence, Internet of Things, artificial intelligence, og machine learning tjenester. Further, it tilbyr IT security lifecycle forvaltning, og digital workplace løsninger, as well as information security og managed IT security tjenester. Atea ASA ble grunnlagt i 1968 og har hovedkontor i Oslo, Norway.",
    "description_length": 757
  },
  {
    "ticker": "ASAS.OL",
    "company_name": "Atlantic Sapphire ASA",
    "sector": "",
    "industry": "",
    "original_description": "",
    "description_length": 0
  },
  {
    "ticker": "ASA.OL",
    "company_name": "Atlantic Sapphire ASA",
    "sector": "Defensive forbruksvarer",
    "industry": "Landbruksprodukter",
    "original_description": "Atlantic Sapphire ASA, sammen med sine datterselskaper, driver med the produksjon og salg of land-based salmon in Denmark og the United States. Selskapet tilbyr its produkt under Bluehouse Salmon, and Sapphire Salmon brand name. Selskapet serves retailers, restaurants, og other kunder. Selskapet ble stiftet i 2010 og har hovedkontor i Vikebukt, Norway.",
    "description_length": 354
  },
  {
    "ticker": "AURG.OL",
    "company_name": "Aurskog Sparebank",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Aurskog Sparebank tilbyr various bankprodukter og -tjenester for individuals og corporate kunder in Norway. Selskapet tilbyr savings accounts; og mortgage, car, bygging, og green business loans, as well as bank guarantee, overdraft, og leasing tjenester; og credit cards. Selskapet also tilbyr insurance produkter, inkludert liability, work machine, data attack, farm building, crop operating equipment, property damage, health, homeowners, home, craftsman, commercial vehicle, business, personnel, travel, og occupational injury insurance produkter, as well as insurance of goods during transport. In addition, selskapet tilbyr pension, foreign payment, og mobile and online banking tjenester. Selskapet driver gjennom its branches in Bjørkelangen, Årnes, Jessheim, Askim, Gjøvik, Nannestad, and Sørumsand in Norway. Aurskog Sparebank ble grunnlagt i 1846 og har hovedkontor i Aurskog, Norway.",
    "description_length": 894
  },
  {
    "ticker": "AUSS.OL",
    "company_name": "Austevoll Seafood ASA",
    "sector": "Defensive forbruksvarer",
    "industry": "Landbruksprodukter",
    "original_description": "Austevoll Seafood ASA, a seafood company, produces og selger salmon og trout, whitefish, og pelagic in Norway, the European Union, the United Kingdom, Eastern Europe, Africa, North America, Asia, and South America. Selskapet eier og driver fishing vessels; og selger and distributes various fish species og processed fish produkter. Selskapet also produces white fish produkter, fish meals, og fish oils; omega-3 oil; og canned and frozen fish produkter. Selskapet ble stiftet i 1981 og har base i Storebø, Norway. Austevoll Seafood ASA er et datterselskap av Laco AS.",
    "description_length": 568
  },
  {
    "ticker": "AUTO.OL",
    "company_name": "AutoStore Holdings Ltd.",
    "sector": "Teknologi",
    "industry": "Datamaskinvare",
    "original_description": "AutoStore Holdings Ltd. tilbyr robotic og software teknologi in Norway, Germany, Europe, the United States, Asia, og internasjonalt. Selskapet tilbyr controllers, robots, grids, bins, og ports. Selskapet tilbyr robots, inkludert R5, R5+, R5 Pro, and R5+ Pro under the Red Line names; AutoStore Bin Lift Grid-to-Grid (G2G) configuration; AutoStore Grid; AutoStore Multi-Temperature Solution, a storage løsning for frozen og chilled environments; Grid Bracer; controller module for warehouse drift; QubIt fulfillment software og platform; and Unify Analytics data platform. Selskapet also tilbyr CarouselAI, an automated robotic picking workstation løsning; VersaPort, a cost-effective workstation; ConveyorPort, a workstation to access bins in the AutoStore grid; CarouselPort that maintains workstation productivity og coordination between robot og man; SwingPort, a work space outside of the storage are; RelayPort workstation; PickUpPort which tilbyr frictionless in-store pickup options; FusionPort workstation; og FusionPort Staging. In addition, selskapet tilbyr installation, vedlikehold, og training of personnel tjenester. Selskapet serves grocery, retail, third party logistic, industrials, og healthcare industries. Selskapet var tidligere kjent som AutoStore NewCo Ltd. and endret navn til AutoStore Holdings Ltd. in October 2021. AutoStore Holdings Ltd. ble grunnlagt i 1996 og har hovedkontor i Nedre Vats, Norway.",
    "description_length": 1428
  },
  {
    "ticker": "ACR.OL",
    "company_name": "Axactor ASA",
    "sector": "Finans",
    "industry": "Kredittjenester",
    "original_description": "Axactor ASA, gjennom sine datterselskaper, driver as a debt forvaltning og collection company in Sweden, Finland, Germany, Italy, Norway, and Spain. Selskapet driver gjennom two segmenter: Non-performing Loans and Third-Party Collection. The Non-performing Loans segment invests in portfolios of non-performing loans collected gjennom amicable or legal proceedings. Its Third-Party Collection segment tilbyr debt collection tjenester on behalf of third-party kunder, which applies amicable og legal proceedings to collect the non-performing loans. This segment also involved in helping creditors to prepare documentation for future legal proceedings against debtors; og handling of invoices between the invoice date og the default date og sending out reminders. Axactor ASA ble stiftet i 1982 og har hovedkontor i Oslo, Norway.",
    "description_length": 827
  },
  {
    "ticker": "B2I.OL",
    "company_name": "B2 Impact ASA",
    "sector": "Finans",
    "industry": "Kredittjenester",
    "original_description": "B2 Impact ASA, sammen med sine datterselskaper, tilbyr various debt løsninger. Its business consists of purchase, forvaltning, og collection of unsecured og secured non-performing loans. Selskapet also tilbyr debt purchase og collection; and telemarketing, fraud prevention, og credit information tjenester. Selskapet driver in Norway, Sweden, Denmark, Finland, Norway, Estonia, Latvia, Lithuania, Poland, Spain, the Czech Republic, Italy, France, Romania, Greece, Cyprus, Slovenia, Croatia, and Serbia. Selskapet var tidligere kjent som B2Holding SAS og endret navn til B2 Impact ASA in September 2023. B2 Impact ASA ble stiftet i 2008 og har hovedkontor i Oslo, Norway.",
    "description_length": 671
  },
  {
    "ticker": "BEWI.OL",
    "company_name": "BEWI ASA",
    "sector": "Sykliske forbruksvarer",
    "industry": "Emballasje og beholdere",
    "original_description": "BEWI ASA, sammen med sine datterselskaper, produces, markedsfører, and selger packaging, components, og insulation løsninger in Norway og internasjonalt. Selskapet driver gjennom Insulation & bygging, Packaging & Components, and Circular segmenter. The Insulation & bygging segment utvikler og produserer insulation løsninger for the building og bygging industry, inkludert foundations, walls, roofs, og ceilings for domestic housing og industrial buildings, as well as infrastructure projects; og tilbyr insulation boards from polyisocyanurate og mineral wool sandwich panels. The Packaging & Components segment utvikler og produserer standard og customized packaging løsninger, inkludert boxes for transportation of fresh fish, og protective packaging for pharmaceuticals og electronics; and delivers technical components to various industries, such as automotive components og components to heating, ventilation, og air condition systems. The Circular segment produces recycled general-purpose polystyrene; tilbyr various løsninger within waste forvaltning; collects, recycles, og trades used materials; og driver collection stations in various countries. Selskapet driver in Sweden, Finland, Denmark, Norway, Iceland, the Netherlands, Belgium, Portugal, Spain, Poland, Germany, the United Kingdom, France, Lithuania, Czech Republic, Switzerland, Austria, the United States, and Canada. BEWI ASA ble grunnlagt i 1980 og har hovedkontor i Trondheim, Norway. BEWI ASA driver as a subsidiary of BEWI Invest AS.",
    "description_length": 1510
  },
  {
    "ticker": "BWE.OL",
    "company_name": "BW Energy Limited",
    "sector": "Energi",
    "industry": "Olje og gass EogP",
    "original_description": "BW Energy Limited, sammen med sine datterselskaper, driver med the leting og produksjon of olje og gass properties. Selskapet holds interests in various shallow- og deep-water eiendeler located in Gabon, Brazil, and Namibia. BW Energy Limited ble grunnlagt i 2016 og har base i Hamilton, Bermuda. BW Energy Limited er et datterselskap av Bw Group Limited.",
    "description_length": 355
  },
  {
    "ticker": "BWLPG.OL",
    "company_name": "BW LPG Limited",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "BW LPG Limited, an investerings- og holdingselskap, driver med ship owning og chartering aktiviteter globalt. Selskapet driver gjennom Shipping and Product Services segmenter. Selskapet driver med the transportation of liquefied petroleum gas (LPG); provision of integrated LPG delivery tjenester, as well as forvaltning tjenester; wholesale og trade of LPG; og investment in commercial enterprises. Per December 31, 2024, it owned og operated a fleet of 55 vessels, inkludert 53 very large gas carriers (of which 29 were owned), 2 large gas carriers time chartered in by produkt tjenester, og 8 VLGCs owned by BW LPG India Pte. Ltd. Selskapet var tidligere kjent som BW Gas LPG Holding Limited og endret navn til BW LPG Limited in September 2013. BW LPG Limited ble grunnlagt i 1935 og har hovedkontor i Singapore.",
    "description_length": 815
  },
  {
    "ticker": "BWO.OL",
    "company_name": "BW Offshore Limited",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "BW Offshore Limited driver med the engineering of offshore produksjon løsninger in the Americas, Europe, Africa, Asia, og the Pacific. Selskapet driver gjennom Floating Production, Storage, and Offloading (FPSO); and Floating Wind segmenter. Selskapet builds, owns, og driver FPSO eiendeler for olje og gass industries. Selskapet also tilbyr engineering, procurement, bygging, og installation tjenester for FPSO vessels og floating havvind energi projects. BW Offshore Limited ble grunnlagt i 1982 og har base i Hamilton, Bermuda.",
    "description_length": 530
  },
  {
    "ticker": "BGBIO.OL",
    "company_name": "BerGenBio ASA",
    "sector": "Helse",
    "industry": "Bioteknologi",
    "original_description": "BerGenBio ASA, a clinical-stage biopharmaceutical company, driver med the utvikling of medicines to treat drug resistant, metastatic cancers, og respiratory disease in Norway. Selskapet utvikler BGBIL025, a JAK2 inhibitor indicated, which is in Ph1b/2a for treatment of the bone marrow disorder myelofibrosis. Selskapet ble stiftet i 2007 og har base i Bergen, Norway.",
    "description_length": 368
  },
  {
    "ticker": "BIEN.OL",
    "company_name": "Bien Sparebank ASA",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Bien Sparebank ASA driver as a sparebank that tilbyr a range of banking og finansielle produkter og tjenester to individuals og business kunder in Norway og internasjonalt. Selskapet driver gjennom Retail Market and Corporate Market segmenter. Selskapet tilbyr bank, BSU, mutual funds, og retirement savings; business, tax withholding, investment, deposit, currency, agricultural, og client accounts, as well as group account systems; pension schemes; car og mortgage loans; loans for motorcycles, motorhomes, og ATVs; senior loans; bank guarantees, overdrafts, bygging og business loans, leasing løsninger, and factoring og invoice forvaltning; insurance produkter for company og employees, cars og other vehicles, agriculture, house og belongings, travel, life og health, and animals; og payment løsninger. Selskapet also tilbyr bank, credit, og value cards; bankID; foreign payment; eInvoice, in-store cash tjenester, payment terminals, og nets customer portals; og mobile and online banking tjenester. Bien Sparebank ASA ble grunnlagt i 1885 og har base i Oslo, Norway.",
    "description_length": 1073
  },
  {
    "ticker": "BNOR.OL",
    "company_name": "BlueNord ASA",
    "sector": "Energi",
    "industry": "Olje og gass EogP",
    "original_description": "BlueNord ASA, an olje og gass company, driver med the produksjon og utvikling of resources that support the energi transition towards net zero in Norway, Denmark, the Netherlands, og the United Kingdom. Selskapet is involved in the leting og olje og gass infrastructure aktiviteter. Its eiendel portefølje includes the Dan, Halfdan, Gorm, and Tyra hubs; og producing fields on the Danish continental shelf. Selskapet var tidligere kjent som Norwegian Energy Company ASA og endret navn til BlueNord ASA in April 2023. BlueNord ASA ble grunnlagt i 2005 og har hovedkontor i Oslo, Norway.",
    "description_length": 585
  },
  {
    "ticker": "BONHR.OL",
    "company_name": "Bonheur ASA",
    "sector": "Industri",
    "industry": "Konglomerater",
    "original_description": "Bonheur ASA, sammen med sine datterselskaper, driver med the renewable energi, wind tjeneste, og cruise businesses in the United Kingdom, Norway, Europe, Asia, the Americas, Africa, og internasjonalt. Selskapet driver gjennom four segmenter: Renewable Energy, Wind Service, Cruise, and Other Investments. The Renewable Energy segment utvikler, constructs, og driver vindparker with an installed capacity of 804.9 megawatts (MW). The Wind Service segment eier og driver three self-propelled jack-up vessels for the transportation, installation, og tjeneste of offshore og onshore wind turbines; og tilbyr installation og blade reparasjon tjenester to onshore og havvind turbine industry, as well as marine transportation tjenester for havvind turbine components. The Cruise segment eier og driver three ocean cruise ships og tilbyr cruise holidays. The Other Investments segment tilbyr publications og PR software tjenester under DN Media Group; software as-a-tjeneste under NHST Marketing Technology comprising MyNewsDesk; og invests in eiendom properties, bonds, og shares. Bonheur ASA ble grunnlagt i 1848 og har hovedkontor i Oslo, Norway.",
    "description_length": 1142
  },
  {
    "ticker": "BOR.OL",
    "company_name": "Borgestad ASA",
    "sector": "Industri",
    "industry": "Building Products og Equipment",
    "original_description": "Borgestad ASA focuses on eiendom og refractory in Norway. Selskapet also utvikler og manages eiendom properties. Selskapet driver Agora Bytom, a shopping center og a rental area, as well as a parking garage with parking spaces in Poland. Borgestad ASA ble grunnlagt i 1904 og har hovedkontor i Lysaker, Norway.",
    "description_length": 310
  },
  {
    "ticker": "BRG.OL",
    "company_name": "Borregaard ASA",
    "sector": "Basisråvarer",
    "industry": "Spesialkjemikalier",
    "original_description": "Borregaard ASA driver med the utvikling, produksjon, og marketing of specialized biochemicals og biomaterials in Norway, rest of Europe, Asia, the United States, og internasjonalt. Selskapet driver in three segmenter: BioSolutions, BioMaterials, and Fine Chemicals. Selskapet utvikler, produces, og selger biopolymers og biovanillin for agrochemicals, batteries, industrial binders, og bygging, as well as to flavour og fragrance companies, og food and beverage industry. Selskapet also utvikler, produces, og selger speciality cellulose for use as a raw material in the produksjon of cellulose ethers, cellulose acetate, og other specialty produkter; og cellulose fibrils for industrial applications. In addition, selskapet tilbyr fine chemical intermediates for contrast agents; og advanced bioethanol produkter. Borregaard ASA ble stiftet i 2012 og har hovedkontor i Sarpsborg, Norway.",
    "description_length": 888
  },
  {
    "ticker": "BOUV.OL",
    "company_name": "Bouvet ASA",
    "sector": "Teknologi",
    "industry": "IT-tjenester",
    "original_description": "Bouvet ASA tilbyr IT og digital communication konsulenttjenester for public og private sectors in Norway, Sweden, og internasjonalt. Selskapet ble stiftet i 1995 og har hovedkontor i Oslo, Norway.",
    "description_length": 196
  },
  {
    "ticker": "BMA.OL",
    "company_name": "Byggma ASA",
    "sector": "Industri",
    "industry": "Building Products og Equipment",
    "original_description": "Byggma ASA, sammen med sine datterselskaper, produserer og supplies building materials in Norway, the United Kingdom, Sweden, Finland, Denmark, og internasjonalt. Selskapet driver gjennom Panels, Beams, Windows, and Lighting segmenter. Selskapet tilbyr pre-painted ceilings og wall panels under the Huntonit brand; I-beams for use in ceilings, walls, og floors for wood-based buildings under the Masonite brand; og particle boards, boards, og structural panels for use in buildings, interior ceilings, og wall panels under the Forestia brand. Selskapet also tilbyr doors og windows for new buildings, extensions, og rehabilitations under the Uldal brand; og a range of lighting produkter, such as decorative home lighting, lampshades, og professional functional lighting produkter under the Aneta Lighting brand. In addition, selskapet utvikler, produserer, og distributes MDF panels for walls, ceilings, bathrooms, og kitchens under the Smartpanel brand. Selskapet selger its produkter gjennom dealers og electrical wholesalers. Selskapet ble grunnlagt i 1997 og har hovedkontor i Vennesla, Norway. Byggma ASA er et datterselskap av Investor As.",
    "description_length": 1146
  },
  {
    "ticker": "CAVEN.OL",
    "company_name": "CAVENDISH HYDROGEN ASA",
    "sector": "Forsyning",
    "industry": "Regulert gassforsyning",
    "original_description": "Cavendish Hydrogen ASA, a hydrogen fueling company, driver med utvikling, produksjon, marketing, salg, installation, commissioning, og tjeneste of equipment for fueling hydrogen to on-road vehicles in Denmark, the United States, South Korea, and Austria. Selskapet's produkt includes the H2Station, which consists of various types of hydrogen fueling stations that provide fuel for fuel cell electric vehicles (FCEV), inkludert cars, vans, buses, og trucks. Selskapet also tilbyr project execution, site engineering, installation, commissioning, drift support, og vedlikehold tjenester, as well as salg of spare parts. Cavendish Hydrogen ASA ble grunnlagt i 2003 og har hovedkontor i Oslo, Norway.",
    "description_length": 697
  },
  {
    "ticker": "CADLR.OL",
    "company_name": "Cadeler A/S",
    "sector": "Industri",
    "industry": "Ingeniør- og entreprenørvirksomhet",
    "original_description": "Cadeler A/S, sammen med sine datterselskaper, driver med havvind farm installation, drift, og vedlikehold tjenester in Denmark. Selskapet driver med the transportation, installation, og vedlikehold of havvind turbine generators og platform topsides/substations; vedlikehold of offshore structures og platforms; offshore bygging, decommissioning, accommodation, og crane support within the renewable space; heavy lift og project cargo; og salvage assistance, as well as transport og installation of wind turbine foundations; og marine and engineering drift. Selskapet also eier og driver five offshore jack-up windfarm installation vessels. Cadeler A/S ble stiftet i 2008 og har hovedkontor i Copenhagen, Denmark.",
    "description_length": 712
  },
  {
    "ticker": "CAPSL.OL",
    "company_name": "Capsol Technologies ASA",
    "sector": "Industri",
    "industry": "Forurensnings- og rensekontroll",
    "original_description": "Capsol Technologies ASA tilbyr karbonfangst teknologiløsninger using hot potassium carbonate solvent in the Europe, the United States, og internasjonalt. Selskapet's produkter portefølje comprises Capsol end-of-pipe (EOP), a flexible EOP karbonfangst løsning; CapsolGo, a karbonfangst demonstration unit; og CapsolGT, that consists of gas turbines with carbon capturing løsninger. Its produkter are used in various segmenter, inkludert cement, Energy-from-waste, Bio-energi, Gas turbines, og Other industries. Selskapet var tidligere kjent som CO2 Capsol AS og endret navn til Capsol Technologies ASA in June 2023. Capsol Technologies ASA ble grunnlagt i 2014 og har base i Oslo, Norway.",
    "description_length": 687
  },
  {
    "ticker": "CRNA.OL",
    "company_name": "Circio Holding ASA",
    "sector": "Helse",
    "industry": "Bioteknologi",
    "original_description": "Circio Holding ASA, a biotechnology company, utvikler novel circular RNA og immunotherapy medicines. Selskapet is developing TG01, a cancer vaccine targeting driver mutations, which is in three clinical trials for multiple myeloma, og pancreatic and lung cancer; og circVec circRNA vector platform, a modular genetic cassette for biogenesis of multifunctional circRNAs in human cells. Selskapet has a collaboration with Certest Biotec, S.L. for formulation of circVec. Selskapet var tidligere kjent som Targovax ASA og endret navn til Circio Holding ASA in May 2023. Selskapet ble stiftet i 2010 og har base i Oslo, Norway.",
    "description_length": 623
  },
  {
    "ticker": "CLOUD.OL",
    "company_name": "Cloudberry Clean Energy ASA",
    "sector": "Forsyning",
    "industry": "Fornybar forsyning",
    "original_description": "Cloudberry Clean Energy ASA driver as a renewable energi company in Norway, Denmark, Switzerland, and Sweden. Selskapet driver gjennom Projects, Commercial, and Asset Management segmenter. Selskapet driver med the ownership, utvikling, forvaltning, og drift of vannkraftverk og vindparker, as well as solkraft og energi storage projects. Cloudberry Clean Energy ASA ble grunnlagt i 2017 og har base i Oslo, Norway.",
    "description_length": 414
  },
  {
    "ticker": "CMBTO.OL",
    "company_name": "Cmb.Tech NV",
    "sector": "Energi",
    "industry": "Olje og gass Midstream",
    "original_description": "Cmb.Tech NV driver med marine transportation business in Belgium. Selskapet driver gjennom three divisions: Marine, H2 Infra, and H2 Industry. The Marine division eier og driver fleet of crude oil tankers, bulk carriers, container ships, chemicals, havvind support vessels, tugboats, og ferries. The H2 Infra division utvikler og secures green molecule supplies; og produces and distributes grønt hydrogen og ammonia. The H2 Industry division tilbyr scalable dual-fuel industrial applications. Selskapet var tidligere kjent som Euronav NV og endret navn til Cmb.Tech NV in October 2024. Cmb.Tech NV ble stiftet i 2003 og har hovedkontor i Antwerp, Belgium. Cmb.Tech NV er et datterselskap av CMB NV.",
    "description_length": 699
  },
  {
    "ticker": "CONTX.OL",
    "company_name": "ContextVision AB (publ)",
    "sector": "Helse",
    "industry": "Health Information Services",
    "original_description": "ContextVision AB (publ), a software company, tilbyr image analysis og imaging for medical systems in South Korea, China, Japan, the United States, og internasjonalt. Selskapet tilbyr image quality løsninger for ultrasound, as well as its Rivent platform comprising Rivent, a 2D image enhancement; Rivent Plus, a premium 2D image enhancement produkt; Rivent 3D, a løsning for improving image quality of 3D ultrasound; og Rivent Mobile, a 2D image enhancement for handheld devices for diagnostics in various fields, inkludert radiology, cardiology, women's health, veterinary medicine, og point of-care applications. Selskapet also tilbyr Altumira platform, which features scatter correction og improves radiography by enabling radiation dose reduction while enhancing image quality, such as Altumira for static applications; og Altumira Plus for dynamic applications. In addition, selskapet tilbyr image quality løsninger for MRI inkludert GOPView MRI2Plus for the requirements of each application, sequence type, og protocol; and implementation projects, software updates, og upgrades and produkt support tjenester. Selskapet has a strategic clinical utvikling partnership with the University of Washington School of Medicine for collecting medical imaging data to identify a multiparametric biomarker for the screening og staging of the liver disease MASLD; og research partnership with AMRA Medical to develop AI-powered, organ-specific imaging løsninger that enable MASLD screening og physiological quantification. ContextVision AB (publ) ble stiftet i 1989 og har hovedkontor i Stockholm, Sweden.",
    "description_length": 1600
  },
  {
    "ticker": "DNB.OL",
    "company_name": "DNB Bank ASA",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "DNB Bank ASA tilbyr financial tjenester to individuals og businesses in Norway og internasjonalt. Selskapet tilbyr savings, current, currency, client, tax withholding, og pension accounts; fixed rate og security deposits; home og cabin mortgages, bygging og fixed-rate loans, car og consumer loans, business loans, og refinancing; home equity credit lines; car, house, home contents, travel, personal, og non-life insurance produkter; payment tjenester; og online and mobile banking tjenester, as well as cards. Selskapet also tilbyr overdraft facilities; leasing tjenester; factoring, supply chain, og receivable purchase financing tjenester; bank guarantees; secure trading, documentary collection, og letter of credit tjenester; investment banking tjenester, such as mergers og acquisitions, equity og debt capital marked, loans, bonds, convertible bonds, direct lending, og other private placements; og private financing og commodities, as well as equity trading, foreign exchange, research, share og stock marked, securities, og risk advisory tjenester. In addition, selskapet tilbyr treasury forvaltning, working capital, trade finance, equipment financing, eiendom broking, og corporate finance tjenester. DNB Bank ASA ble grunnlagt i 1822 og har hovedkontor i Oslo, Norway.",
    "description_length": 1281
  },
  {
    "ticker": "DNO.OL",
    "company_name": "DNO ASA",
    "sector": "Energi",
    "industry": "Olje og gass EogP",
    "original_description": "DNO ASA driver med the leting, utvikling, og produksjon of olje og gass eiendeler in the Middle East, the North Sea, and West Africa. Selskapet holds75% operating interests in the Tawke and Peshkabir fields located in the Kurdistan; og 9% interest in Côte d'Ivoire's Block CI-27 located in West Africa. Selskapet also holds licenses in reservoirs, inkludert in the Cretaceous, Jurassic and Triassic formations; og 85 offshore licenses in Norway, seven offshore licenses in the UK, og one offshore license in the Netherlands. DNO ASA var tidligere kjent som DNO International ASA og endret navn til DNO ASA in June 2014. Selskapet ble stiftet i 1971 og har hovedkontor i Oslo, Norway.",
    "description_length": 683
  },
  {
    "ticker": "DOFG.OL",
    "company_name": "DOF Group ASA",
    "sector": "Industri",
    "industry": "Ingeniør- og entreprenørvirksomhet",
    "original_description": "DOF Group ASA eier og driver a fleet of offshore og subsea vessels. Selskapet driver gjennom DOF Subsea Group, DOF Denmark, DOF Rederi & Iceman, Norskan Offshore, and Corporate segmenter. Selskapet driver a fleet of platform supply vessels (PSVs) that are used to transport freight to/from offshore platforms; anchor handling tug support (AHTS) vessels; bygging Support Vessels (CSV); Remote Operated Vehicles (ROV); Autonomous Underwater Vehicles (AUV); and subsea vessels. Selskapet tilbyr subsea tjenester, inkludert prosjektledelse, engineering, bygging og installation, decommissioning/field abandonment, saturation og air diving, tow, morring og reparasjon, renewables, og survey and positioning, as well as inspection, reparasjon, og vedlikehold tjenester. In addition, it tilbyr marine forvaltning tjenester, such as crewing, mobilization, vedlikehold, og project and new building tjenester. Selskapet driver a fleet of 6 PSVs, 18 CSVs, og 28 AHTSs, as well as 78 remotely operated vehicles og autonomous underwater vehicles. Selskapet driver in Brazil, the United States, Australia, the United Kingdom, Norway, Angola, Mauritania, Guyana, Trinidad and Tobago, the Netherlands, Canada, Israel, the Philippines, Argentina, og internasjonalt. DOF Group ASA ble grunnlagt i 1981 og har hovedkontor i Storebø, Norway.",
    "description_length": 1321
  },
  {
    "ticker": "EIOF.OL",
    "company_name": "Eidesvik Offshore ASA",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "Eidesvik Offshore ASA tilbyr tjenester to the offshore supply, subsea, og havvind marked in Norway. Selskapet driver gjennom Supply, Subsea/Offshore Renewables, and Other segmenter. Selskapet tilbyr tjenester to the offshore oil industry. Selskapet also tilbyr shipping tjenester for subsea work for the oil industry, as well as various tjenester for the offshore renewable marked. In addition, selskapet is involved in the provision of cargo supply og transportation of pipes between onshore bases og offshore oilfields; eier og driver a fleet of subsea bygging vessels; og bygging and module handling, inspections, og vedlikehold and reparasjon of subsea installation. Selskapet ble grunnlagt i 2004 og har hovedkontor i Bømlo, Norway. Eidesvik Offshore ASA er et datterselskap av Eidesvik Invest AS.",
    "description_length": 802
  },
  {
    "ticker": "EMGS.OL",
    "company_name": "Electromagnetic Geoservices ASA",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "Electromagnetic Geoservices ASA, sammen med sine datterselskaper, tilbyr electromagnetic (EM) surveying teknologi og tjenester to the offshore olje og gass leting industry. Selskapet is involved in the planning, acquisition, processing, modelling, interpretation, og integration of EM data to increase leting success. Selskapet also uses its patented EM survey method to find hydrocarbons in offshore reservoirs. In addition, it driver med the provision of controlled-source EM surveying og magnetotelluric surveying; imaging og interpretation; rental of software og cluster; and training tjenester, as well as rådgivningstjenester. Selskapet driver in Europe, the Middle East, Africa, Norway, North and South America, Asia, og the Pacific Ocean. Electromagnetic Geoservices ASA ble stiftet i 2002 og har hovedkontor i Oslo, Norway.",
    "description_length": 832
  },
  {
    "ticker": "ELK.OL",
    "company_name": "Elkem ASA",
    "sector": "Basisråvarer",
    "industry": "Spesialkjemikalier",
    "original_description": "Elkem ASA driver med the provision of advanced material løsninger globalt. Selskapet driver gjennom Silicones, Silicon Products, and Carbon Solutions segmenter. Selskapet tilbyr silicones polymers, inkludert silicone oils, compounds, emulsions, grease, og resins, as well as chlorosilanes, heat cured rubber silicone, liquid silicone rubber, og RTV-1 and RTV-2 silicones. Selskapet also tilbyr silicon-based materials comprising silicon, silicon powder/micronized silicon, silica fume/ micro-silica, ferrosilicon, og grain refiners. In addition, selskapet tilbyr foundry alloys, such as preconditioners, recarburizers, conditioners, nodularizers, inserts, og inoculants; and carbon-based materials comprising carbon electrodes, furnace tapping materials, electrode paste, ramming paste, prebaked electrodes, og furnace lining materials, as well as polymer additives, og oilfield and refractories specialty produkter. Selskapet tilbyr its produkter to electronics, aerospace, healthcare, personal care, packaging, airbag coating, chemicals, aluminium, electronics, automotive, specialty steel, solar, bygging, refractories, olje og gass, ferroalloys, silicon, og aluminium industries. Selskapet ble grunnlagt i 1904 og har base i Oslo, Norway. Elkem ASA driver as a subsidiary of Bluestar Elkem International Co., Ltd. S.A.",
    "description_length": 1322
  },
  {
    "ticker": "ELABS.OL",
    "company_name": "Elliptic Laboratories ASA",
    "sector": "Teknologi",
    "industry": "Programvare - infrastruktur",
    "original_description": "Elliptic Laboratories ASA, an artificial intelligence (AI) software company, driver med the provision of AI virtual smart sensors for the smartphone, laptop, Internet of Things, og automotive markedsfører in Norway, the United States, China, South Korea, Taiwan, and Japan. Selskapet tilbyr AI Virtual Human Presence Sensor, a presence-detection løsning used to improve the security of data stored on devices og to allow intuitive responses based on natural human interaction; AI Virtual Proximity Sensor that enables exquisite full-screen devices; og AI Virtual Connection Sensor that allows to pair og authenticate smart devices in the same room. Selskapet also tilbyr AI Virtual Position Sensor which automatically detects the location of an external display in relation to a laptop; AI Virtual Gesture Sensor that enables touchless user interactions; AI Virtual Breathing sensor that enables to track person's breathing; og AI Virtual heart Sensor that tracks a person's heart rate. Selskapet ble stiftet i 2006 og har hovedkontor i Oslo, Norway.",
    "description_length": 1050
  },
  {
    "ticker": "ELMRA.OL",
    "company_name": "Elmera Group ASA",
    "sector": "Forsyning",
    "industry": "Regulert strømforsyning",
    "original_description": "Elmera Group ASA, sammen med sine datterselskaper, driver med the purchase, salg, and portefølje forvaltning of electrical power to households, private og public companies, og municipalities in Norway, Sweden, and Finland. Selskapet driver gjennom Consumer, Business, and Nordic segmenter. Selskapet selger electrical power og related tjenester to private og business consumers. Selskapet also selger EV chargers og PV panels, as well as tilbyr, mobile tjenester, power salg, payment løsninger tjenester, og related tjenester. In addition, it manages, researches, og utvikler produkter og tjenester related to electrical power; og tilbyr mobile phone tjenester to private kunder. Selskapet var tidligere kjent som Fjordkraft Holding ASA og endret navn til Elmera Group ASA in April 2022. Elmera Group ASA ble grunnlagt i 2001 og har hovedkontor i Bergen, Norway.",
    "description_length": 862
  },
  {
    "ticker": "ELO.OL",
    "company_name": "Elopak ASA",
    "sector": "Sykliske forbruksvarer",
    "industry": "Emballasje og beholdere",
    "original_description": "Elopak ASA produserer og supplies paper-based packaging løsninger for liquid food in Europe, the Middle East, Africa, Asia, the Americas, og internasjonalt. Selskapet tilbyr Pure-Pak cartons for chilled og aseptic liquid food; D-PAK cartons for non food produkter for personal og home care; og filling equipment. Selskapet also tilbyr standard flexo, super flexo, UV-flexo, og offset litho printing tjenester, as well as digital print proofs og machine print proofs on paper board. Further, it tilbyr machines og equipment gjennom spare part webshop. Elopak ASA ble grunnlagt i 1957 og har base i Oslo, Norway.",
    "description_length": 610
  },
  {
    "ticker": "ENDUR.OL",
    "company_name": "Endúr ASA",
    "sector": "Industri",
    "industry": "Konglomerater",
    "original_description": "Endúr ASA, sammen med sine datterselskaper, driver as a supplier of bygging og vedlikehold projects, tjenester, and løsninger for marine infrastructure businesses in Norway og the Norwegian Continental Shelf, Sweden, og internasjonalt. Selskapet driver gjennom three segmenter: Infrastructure, Aquaculture Solutions, and Other. Selskapet constructs og maintains facilities for land-based aquaculture, quays, harbors, dams, bridges, tunnels, groundworks, railways, og other specialized concrete og steel projects. Selskapet also tilbyr maritime, engine, og ship vedlikehold og reparasjon tjenester; vedlikehold og reparasjon tjenester for ships, marine vessels, og related equipment; løsninger for water quality og fish health; og marine infrastructure bygging tjenester, as well as other adjacent tjenester, inkludert hydrographical, dredging, rentals, inspections, og diving. In addition, it produces concrete feed barges for the aquaculture industry. Selskapet serves public og private sector. Endúr ASA har base i Lysaker, Norway.",
    "description_length": 1033
  },
  {
    "ticker": "ENSU.OL",
    "company_name": "Ensurge Micropower ASA",
    "sector": "Teknologi",
    "industry": "Electronic Components",
    "original_description": "Ensurge Micropower ASA tilbyr energi storage løsninger for wearable devices, connected sensors, og other applications in the United States, Europe, and Asia. Selskapet tilbyr solid-state lithium battery teknologi that enables it to produce rechargeable micro batteries. Its produkter are used in hearables, medical wearables, sports og fitness wearables, og home and industrial connected devices. Selskapet var tidligere kjent som Thin Film Electronics ASA og endret navn til Ensurge Micropower ASA in June 2021. Ensurge Micropower ASA ble grunnlagt i 2005 og har hovedkontor i Oslo, Norway.",
    "description_length": 591
  },
  {
    "ticker": "ENTRA.OL",
    "company_name": "Entra ASA",
    "sector": "Eiendom",
    "industry": "Eiendomstjenester",
    "original_description": "Entra ASA utvikler eiendom properties in Oslo, Bergen, Drammen, Sandvika, and Stavanger. Selskapet eier og driver office og commercial property. Selskapet ble grunnlagt i 2000 og har hovedkontor i Oslo, Norway.",
    "description_length": 210
  },
  {
    "ticker": "ENVIP.OL",
    "company_name": "Envipco Holding N.V.",
    "sector": "Industri",
    "industry": "Forurensnings- og rensekontroll",
    "original_description": "Envipco Holding N.V., sammen med sine datterselskaper, utvikler, produserer, assembles, leases, selger, markedsfører, and tjenester a line of reverse vending machines (RVMs) in the Netherlands, the United States, North America, and Europe. Selskapet tilbyr RVMs for convenience stores; Flex, a løsning to recycle empty drinks packages; Flex Tri to collect PET bottles, cans, og glass bottles; Optima, a løsning for retailers or redemption centers; Envipco Ultra model for the standard-size retail location; HDS model for larger return centers, such as sizable supermarkets, hypermarkets, og redemption centers; Envipco Modula for supermarkets og hypermarkets; and Envipco Quantum for supermarkets, hypermarkets, og municipal recycling centers. Envipco Holding N.V. ble stiftet i 1998 og har hovedkontor i Amersfoort, the Netherlands.",
    "description_length": 833
  },
  {
    "ticker": "EQNR.OL",
    "company_name": "Equinor ASA",
    "sector": "Energi",
    "industry": "Olje og gass Integrated",
    "original_description": "Equinor ASA, an energi company, driver med the leting, produksjon, transportation, refining, og marketing of petroleum og other forms of energi in Norway og internasjonalt. Selskapet driver gjennom Exploration & Production Norway; Exploration & Production International; Exploration & Production USA; Marketing, Midstream & Processing; Renewables; and Other segmenter. Selskapet utvikler karbonfangst og storage projects; tilbyr transportation løsninger, inkludert pipelines, shipping, trucking, og rail; and utvikler og explores for renewable energi, such as havvind, grønt hydrogen, og solkraft. Selskapet var tidligere kjent som Statoil ASA og endret navn til Equinor ASA in May 2018. Equinor ASA ble stiftet i 1972 og har hovedkontor i Stavanger, Norway.",
    "description_length": 758
  },
  {
    "ticker": "EQVA.OL",
    "company_name": "Eqva ASA",
    "sector": "Forsyning",
    "industry": "Fornybar forsyning",
    "original_description": "Eqva ASA, tilbyr technical løsninger and tjenester to maritime og land based industries in Norway og internasjonalt. Selskapet driver in four segmenter: Industrial Solutions; Renewables; eiendom; og Other. Selskapet tilbyr technical installations to the land-based og maritime industry; og utvikler and driver small-scale vannkraftverk. Selskapet driver med eiendom business. Selskapet var tidligere kjent som Havyard Group ASA og endret navn til Eqva ASA in November 2022. Selskapet ble stiftet i 1999 og har hovedkontor i Kvinnherad, Norway.",
    "description_length": 543
  },
  {
    "ticker": "EPR.OL",
    "company_name": "Europris ASA",
    "sector": "Defensive forbruksvarer",
    "industry": "Lavpriskjeder",
    "original_description": "Europris ASA driver as a discount variety retailer in Norway. Selskapet selger own brand og branded merchandise, inkludert laundry og cleaning, pet food og accessories, storage, confectionery og snacks, home og interior, candles, yarn, toys, og seasonal items, as well as groceries, toys, og do it yourself (DIY) produkter. Selskapet also tilbyr its produkter gjennom online shopping. Europris ASA ble grunnlagt i 1992 og har base i Rolvsøy, Norway. Selskapet driver as a subsidiary of Crystal Turquoise BV.",
    "description_length": 507
  },
  {
    "ticker": "FRO.OL",
    "company_name": "Frontline plc",
    "sector": "Energi",
    "industry": "Olje og gass Midstream",
    "original_description": "Frontline plc, a rederi, driver med the ownership og drift of råolje- og produkttankskip globalt. Selskapet eier og driver råolje- og produkttankskip, such as very large crude carriers (VLCCs), Suezmax tankers, og LR2/Aframax tankers. Per December 31, 2024, it operated a fleet of 81 vessels, inkludert 41 VLCCs, 22 Suezmax tankers, og 18 LR2/Aframax tankers. Selskapet is also involved in the charter, purchase, og salg of vessels. Frontline plc ble grunnlagt i 1985 og har base i Limassol, Cyprus.",
    "description_length": 499
  },
  {
    "ticker": "GENT.OL",
    "company_name": "Gentian Diagnostics ASA",
    "sector": "Helse",
    "industry": "Medisinsk utstyr",
    "original_description": "Gentian Diagnostics ASA utvikler, produserer, og selger biochemical reagents for use in medical diagnostics og research in the United States, Asia, and Europe. Selskapet tilbyr in-vitro diagnostic reagents for clinical chemistry analyzers, such as Gentian Circulating Calprotectin Immunoassay, a turbidimetric assay used for the measurement of calprotectin in plasma og serum for detection og assessment of inflammation; Gentian Cystatin C Immunoassay test kit, a GFR marker for the diagnosis og therapeutic control of renal function og chronic kidney disease; Gentian Retinol-Binding Protein Immunoassay for detection of retinol-binding protein in human serum og plasma; and Canine CRP Immunoassay test kit, a particle-enhanced turbidimetric immunoassay for quantitative determination of canine C-reactive protein in dog plasma og serum. Selskapet also utvikler NT-proBNP Immunoassay, an aid in the diagnosis, monitoring, og assessment of severity in individuals suspected of having congestive heart failure, which is in produkt utvikling phase. In addition, selskapet tilbyr faecal calprotectin immunoassay turbo that tilbyr results of calprotectin concentration in stool supporting diagnosis of inflammatory bowel disease; og faecal pancreatic elastase immunoassay turbo, which allows analysis of pancreatic elastase in stool to aid in diagnosis of pancreatic exocrine insufficiency. Gentian Diagnostics ASA ble grunnlagt i 2001 og har hovedkontor i Moss, Norway.",
    "description_length": 1466
  },
  {
    "ticker": "GJF.OL",
    "company_name": "Gjensidige Forsikring ASA",
    "sector": "Finans",
    "industry": "Forsikring - skade",
    "original_description": "Gjensidige Forsikring ASA, sammen med sine datterselskaper, tilbyr general insurance og pension produkter in Norway, Sweden, Denmark, Finland, Latvia, Lithuania, and Estonia. Selskapet driver in four segmenter: General Insurance Private, General Insurance Commercial, General Insurance Sweden, and Pension. Selskapet tilbyr motor, property, travel, accident og health, general liability, natural perils, agriculture, leisure craft, valuables, medical treatment og expense, disability, income protection, workers' compensation, motor vehicle liability, marine, aviation, transport, fire og other damage to property, assistance, other non-life, og life insurance produkter, as well as non-proportional non-life reinsurance produkter. Selskapet also tilbyr defined contribution occupational pension schemes for businesses, inkludert disability pension, spouse/cohabitant pension, og child's pension; og individual pension savings agreements. Selskapet selger its produkter to private individuals, commercial og agricultural kunder, og private and commercial markedsfører gjennom various distribution channels comprising customer tjeneste centres, office channel, call center, Internet, partners, agents, og external brokers. Gjensidige Forsikring ASA ble grunnlagt i 1816 og har hovedkontor i Oslo, Norway.",
    "description_length": 1303
  },
  {
    "ticker": "GOD.OL",
    "company_name": "Goodtech ASA",
    "sector": "Industri",
    "industry": "Ingeniør- og entreprenørvirksomhet",
    "original_description": "Goodtech ASA tilbyr control systems, digitization, og produksjon løsninger for produksjon companies in Norway, Sweden, Finland, Europe, og internasjonalt. Selskapet tilbyr a range of in-house developed og partner-driven technologies og customized løsninger for energi storage og forvaltning, digital transformation maturity, control system for wind power, eiendel monitoring, manufacturing execution system, technical audit tjenester, business intelligence, cyber security forvaltning system, food produksjon line, data hub for industrialized IT/OT architecture, commercial analysis, og WIZX providing data storage og cloud løsninger, digital produksjon system, og feasibility study tjenester. Selskapet also tilbyr robotic systems for handling, controlling, og logistics of bulk materials under the Portabulk brand; power og electrical, automation, og system integration løsninger to industry og power distributors; constructs og rehabilitates transformer stations. Selskapet ble grunnlagt i 1913 og har hovedkontor i Oslo, Norway.",
    "description_length": 1032
  },
  {
    "ticker": "GSF.OL",
    "company_name": "Grieg Seafood ASA",
    "sector": "Defensive forbruksvarer",
    "industry": "Landbruksprodukter",
    "original_description": "Grieg Seafood ASA, gjennom sine datterselskaper, driver as a fish farming company in Norway, the United Kingdom, rest of Europe, the United States, Canada, Asia, og internasjonalt. Selskapet driver med the farming, produksjon, og salg of Atlantic salmon. Selskapet ble stiftet i 1988 og har base i Bergen, Norway. Grieg Seafood ASA driver as a subsidiary of Grieg Aqua AS.",
    "description_length": 372
  },
  {
    "ticker": "GYL.OL",
    "company_name": "Gyldendal ASA",
    "sector": "Kommunikasjonstjenester",
    "industry": "Forlag",
    "original_description": "Gyldendal ASA, gjennom sine datterselskaper, driver med the publishing of books in Norway. Selskapet also utvikler, produces, og publishes content, inkludert learning materials for kindergarten, primary school, upper secondary school, students, og other professional marked; og selger paper books, e-books, audiobooks, og digital books, og other goods, as well as tilbyr streaming tjenester. Selskapet driver gjennom physical bookstores og online bookstore. Gyldendal ASA ble grunnlagt i 1925 og har hovedkontor i Oslo, Norway. Gyldendal ASA driver as a subsidiary of Erik Must AS.",
    "description_length": 581
  },
  {
    "ticker": "HAFNI.OL",
    "company_name": "Hafnia Limited",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Hafnia Limited eier og driver oil produkt tankers in Bermuda. Selskapet driver gjennom Long Range II, Long Range I, Medium Range (MR), Handy size, og Specialized segmenter. Selskapet transports clean og dirty, refined oil produkter, vegetable oil, og easy chemicals to national og international oil companies, og chemical companies, as well as trading og utility companies; og eier og driver 207 vessels. Selskapet tilbyr ship owning, ship-forvaltning, investment, forvaltning, corporate support, og agency office tjenester. In addition, selskapet tilbyr chartering tjenester. Hafnia Limited har base i Singapore.",
    "description_length": 613
  },
  {
    "ticker": "HGSB.OL",
    "company_name": "Haugesund Sparebank",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Haugesund Sparebank, a sparebank, tilbyr various finansielle produkter og tjenester to individuals og corporate kunder in Norway. Its personal bankprodukter og -tjenester include current, deposit, og association accounts; mortgage og consumer loans, as well as car, boat og other vehicle loans; savings accounts, shares og funds, pension savings accounts, og savings for children og young people; vehicle, boat og leisure, house og contents, and life og health insurance plans; og bank and credit cards, mobile og watch payments, payment apps, og online and mobile banking tjenester. Selskapet's corporate bankprodukter og -tjenester, such as business loans, overdrafts, agricultural credit, bygging loans, agricultural loans, leasing løsninger, and bank guarantees; current accounts, payment løsninger, online business tjenester, og savings and investment produkter; og insurance and pension plans. Selskapet also tilbyr eiendom agency, securities trading, og mobile and online banking tjenester. Selskapet ble stiftet i 1928 og har hovedkontor i Haugesund, Norway.",
    "description_length": 1066
  },
  {
    "ticker": "HAVI.OL",
    "company_name": "Havila Shipping ASA",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Havila Shipping ASA, sammen med sine datterselskaper, driver med the shipping business. Selskapet driver og manages offshore tjeneste vessels primarily in Norway, the United Kingdom, Denmark, Belgium, the Netherlands, Iceland, Tunisia, the Marshall Islands, og the United States. Selskapet driver a fleet of vessels, inkludert anchor handling vessels, platform supply vessels, rescue recovery vessel, og subsea vessels. Its subsea vessels are used for under water bygging work, as well as for support for under water drift; og rescue recovery vessels are used to tilby security tjenester, such as oil spill preparedness, fire protection, rescue drift, og recovery at oil installations. In addition, selskapet tilbyr renewable energi tjenester comprising cable reparasjon, trenching og ploughing, mooring og towing, daughter craft drift, og equipment and goods transportation tjenester. Selskapet ble grunnlagt i 2003 og har hovedkontor i Fosnavåg, Norway. Havila Shipping ASA er et datterselskap av Havila Holding AS.",
    "description_length": 1017
  },
  {
    "ticker": "HERMA.OL",
    "company_name": "Hermana Holding ASA",
    "sector": "Finans",
    "industry": "Asset Management",
    "original_description": "Hermana Holding ASA ble stiftet i 2023 og har hovedkontor i Oslo, Norway. Hermana Holding ASA driver as a subsidiary of Magnora ASA.",
    "description_length": 132
  },
  {
    "ticker": "HEX.OL",
    "company_name": "Hexagon Composites ASA",
    "sector": "Sykliske forbruksvarer",
    "industry": "Emballasje og beholdere",
    "original_description": "Hexagon Composites ASA, sammen med sine datterselskaper, tilbyr alternative fuel systems and løsninger to commercial vehicles og gas distribution companies globalt. Selskapet driver in Hexagon Agility and Hexagon Digital Wave segmenter. Selskapet also tilbyr cylinder testing og monitoring technologies. Selskapet ble grunnlagt i 1985 og har hovedkontor i Ålesund, Norway.",
    "description_length": 372
  },
  {
    "ticker": "HPUR.OL",
    "company_name": "Hexagon Purus ASA",
    "sector": "Industri",
    "industry": "Industriell distribusjon",
    "original_description": "Hexagon Purus ASA tilbyr hydrogen og battery energi storage løsninger. Selskapet tilbyr hydrogen high-pressure type 4 cylinders, stationary storage, refueling og distribution systems og high-pressure gas bundles, as well as hydrogen fuel storage systems, battery systems, og vehicle integration tjenester for fuel cell electric og battery electric vehicles. Selskapet serves passenger vehicle, medium- og heavy-duty, light-duty, distribution systems, bus, stationary storage, maritime, rail, aerospace, aviation, off-highway vehicles, vehicle integration, og refueling system markedsfører. Selskapet driver in Norway, Europe, North America, Asia, Australia/Oceania, og internasjonalt. Hexagon Purus ASA ble stiftet i 2017 og har hovedkontor i Oslo, Norway.",
    "description_length": 756
  },
  {
    "ticker": "HSHP.OL",
    "company_name": "Himalaya Shipping Ltd.",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Himalaya Shipping Ltd. tilbyr dry bulk shipping tjenester globalt. Selskapet serves major commodity trading, commodity og energi transition, og multi-modal transport companies. Per December 31, 2024, it owned og operated gjennom a fleet of 12 Newcastlemax tørrbulkskip, each with capacity in the range of 210,000 dead weight tons. Selskapet ble stiftet i 2021 og har base i Hamilton, Bermuda.",
    "description_length": 392
  },
  {
    "ticker": "HBC.OL",
    "company_name": "Hofseth BioCare ASA",
    "sector": "Defensive forbruksvarer",
    "industry": "Packaged Foods",
    "original_description": "Hofseth BioCare ASA produces og selger health nutritional produkter for humans og pets in Norway, the United Kingdom, France, Belgium, Italy, Germany, rest of Europe, Japan, Asia, og the United States. Selskapet tilbyr ProGo, a bioactive peptide for weight forvaltning og metabolic health; OmeGo, a salmon oil that tilbyr a full spectrum of fatty acids og omegas; CalGo and NT-II, which are calcium collagen complexes that support joint og bone health; CollaGo; and PetGo, a non-soluble protein. Hofseth BioCare ASA ble grunnlagt i 2000 og har hovedkontor i Ålesund, Norway.",
    "description_length": 574
  },
  {
    "ticker": "HYPRO.OL",
    "company_name": "HydrogenPro ASA",
    "sector": "Industri",
    "industry": "Specialty Industrial Machinery",
    "original_description": "HydrogenPro ASA driver med designing og delivering grønt hydrogen teknologi og systems in Norway, Europe, the United States, og the Asia Pacific. Selskapet tilbyr high-pressure alkaline electrolyzers og gas separation units. Selskapet serves synthetic aviation fuel, refinery/decarbonization, power to gas, balancing the grid, steel produksjon, fertilizer/ammonia, og shipping markedsfører. HydrogenPro ASA ble stiftet i 2013 og har hovedkontor i Porsgrunn, Norway.",
    "description_length": 465
  },
  {
    "ticker": "HAUTO.OL",
    "company_name": "Höegh Autoliners ASA",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Höegh Autoliners ASA tilbyr ocean transportation tjenester within the roll-on roll-off (RoRo) cargoes on deep sea og short sea markedsfører in Norway. Selskapet driver in two segmenter, Shipping Services and Logistics Services. Its tjenester include automotive; breakbulk; truck, buses, og trailers; railcars og tramways; mining equipment; agricultural machinery; machinery shipping; bygging equipment; power equipment; boats, og yachts shipping; og ocean transportation. Selskapet tilbyr equipment handling, og project cargo logistic tjenester. In addition, it is involved in terminal, forvaltning, ship owning, og ship contracts tjenester. Per December 31, 2024, selskapet driver a fleet of 38 vessels. Selskapet ble grunnlagt i 1927 og har hovedkontor i Oslo, Norway.",
    "description_length": 770
  },
  {
    "ticker": "HSPG.OL",
    "company_name": "Høland og Setskog Sparebank",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Høland og Setskog Sparebank tilbyr banking tjenester for the personal og corporate markedsfører in Norway. Selskapet tilbyr savings og pension accounts; consumer loans, business loans, mortgage loans, car loans, og loans for motorbikes, ATVs, motorhomes, caravans, snowmobiles, og boats; and refinancing, credit cards, mobile og online banking, bank guarantee, overdrafts, leasing, og factoring and invoice sales, as well as insurance produkter. Selskapet var tidligere kjent som Holand Sparebank og endret navn til Høland og Setskog Sparebank in 2010. Høland og Setskog Sparebank ble grunnlagt i 1849 og har hovedkontor i Bjørkelangen, Norway.",
    "description_length": 644
  },
  {
    "ticker": "IDEX.OL",
    "company_name": "IDEX Biometrics ASA",
    "sector": "Teknologi",
    "industry": "Software - Application",
    "original_description": "IDEX Biometrics ASA, sammen med sine datterselskaper, designer, utvikler, og selger fingerprint authentication løsninger in Norway, Europe, the Middle East, Africa, the Americas, og the Asia-Pacific regions. Selskapet's fingerprint authentication løsninger are used primarily in contactless smart cards that includes financial payment, access control, og digital identity, as well as card-based devices for the storage of digital currencies. Selskapet tilbyr IDEX digital access card a multifactor authentication løsning; IDEX pay card; IDEX bio java card platform, a fingerprint biometric authentication løsning; and IDEX Bio sensor system for biometric algorithms og proprietary silicon teknologi. Selskapet primarily serves smart card manufacturers og similar løsning integrators. Selskapet ble stiftet i 1996 og har hovedkontor i Oslo, Norway.",
    "description_length": 847
  },
  {
    "ticker": "IWS.OL",
    "company_name": "Integrated Wind Solutions ASA",
    "sector": "Industri",
    "industry": "Specialty Industrial Machinery",
    "original_description": "Integrated Wind Solutions ASA, gjennom sine datterselskaper, tilbyr havvind tjenester in the United Kingdom, the Netherlands, Taiwan, Poland, Belgium, Greece, France, Denmark, Norway, og internasjonalt. Selskapet driver gjennom IWS Fleet and IWS Services. The IWS Fleet segment eier og driver bygging og tjeneste drift vessels. The IWS Services segment tilbyr design, engineering, bygging, drift, og forvaltning tjenester for onshore og havvind industry. Selskapet also tilbyr eiendel forvaltning consulting og advisory, and commercial og technical forvaltning tjenester. Integrated Wind Solutions ASA ble stiftet i 2020 og har base i Oslo, Norway.",
    "description_length": 648
  },
  {
    "ticker": "IOX.OL",
    "company_name": "Interoil Exploration and Production ASA",
    "sector": "Energi",
    "industry": "Olje og gass EogP",
    "original_description": "Interoil Exploration and Production ASA, sammen med sine datterselskaper, driver as an upstream oil leting og produksjon company in Argentina and Colombia. Selskapet driver med the acquisition, leting, utvikling, og drift of oil og natural gas properties. Selskapet's portefølje includes two producing concessions in Colombia; og one leting og seven produksjon concessions in Argentina. Interoil Exploration and Production ASA ble stiftet i 2005 og har hovedkontor i Oslo, Norway.",
    "description_length": 480
  },
  {
    "ticker": "ITERA.OL",
    "company_name": "Itera ASA",
    "sector": "Teknologi",
    "industry": "IT-tjenester",
    "original_description": "Itera ASA, sammen med sine datterselskaper, tilbyr digital løsninger for businesses og organizations in Norway, Sweden, Ukraine, Denmark, the Czech Republic, Iceland, Poland, and Slovakia. Selskapet tilbyr data, artificial intelligence og analytics, utvikling og architecture, test og quality assurance løsninger, as well as cloud og application tjenester. Selskapet tilbyr a range of tjenester in the design, digital strategy, consulting og execution, customer experience, cloud transformation, og teknologi areas. Selskapet serves banking og insurance, energi og utilities, industry og manufacturing, defense, health og public tjenester, teknologi og communication, and produkter og retail industries. Selskapet ble grunnlagt i 1989 og har hovedkontor i Oslo, Norway.",
    "description_length": 769
  },
  {
    "ticker": "JIN.OL",
    "company_name": "Jinhui Shipping and Transportation Limited",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Jinhui Shipping and Transportation Limited, an investerings- og holdingselskap, driver med ship chartering og owning aktiviteter in China, Singapore, Japan, Norway, the United Arab Emirates, South Korea, Switzerland, og internasjonalt. Selskapet driver med money lending; property investment aktiviteter; og provision of ship forvaltning og shipping agent tjenester. Selskapet driver a fleet of 25 owned vessels og 8 chartered-in vessels. Selskapet ble grunnlagt i 1987 og har base i Hong Kong, Hong Kong. Jinhui Shipping and Transportation Limited driver as a subsidiary of Jinhui Holdings Company Limited.",
    "description_length": 607
  },
  {
    "ticker": "JAREN.OL",
    "company_name": "Jæren Sparebank",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Jæren Sparebank driver med providing various finansielle produkter og tjenester to individuals og businesses in Norway. Selskapet tilbyr checking og savings accounts, og pension accounts. Selskapet also tilbyr deposits; vehicle loans, mortgages, personal loans, og refinancing tjenester; og bank guarantees, bygging loans, overdrafts, leasing, og business loans. In addition, it tilbyr car, personal, animal, health, home, private, business, employee, og agricultural insurance produkter, as well as online og mobile banking, credit og debit cards, payment løsninger, digital identification, og eiendel forvaltning tjenester. Selskapet har hovedkontor i Bryne, Norway.",
    "description_length": 668
  },
  {
    "ticker": "KMCP.OL",
    "company_name": "KMC Properties ASA",
    "sector": "Eiendom",
    "industry": "Eiendomstjenester",
    "original_description": "KMC Properties ASA har ikke betydelig virksomhet. Previously, it operated as a eiendom company. KMC Properties ASA ble grunnlagt i 2020 og har hovedkontor i Trondheim, Norway.",
    "description_length": 175
  },
  {
    "ticker": "KID.OL",
    "company_name": "Kid ASA",
    "sector": "Sykliske forbruksvarer",
    "industry": "Specialty Retail",
    "original_description": "Kid ASA, sammen med sine datterselskaper, driver as a home textile retailer in Norway, Sweden, Finland, and Estonia. Selskapet designer, sources, markedsfører, and selger a range of home og interior produkter, inkludert textiles, curtains, bed linens, home accessories, decorations, furniture, og other interior produkter gjennom retail stores og online platforms. Selskapet tilbyr produkter for bedroom, bathroom, easter, beds, outdoor spaces, table settings, kitchenware, office accessories, children room, loungewear og accessories, and sun protection, as well as lamps, pillows og blankets, and carpets. Selskapet tilbyr its produkter under the Kid Interior and Hemtex brands. Selskapet var tidligere kjent som Nordisk Tekstil Holding AS og endret navn til Kid ASA. Kid ASA ble grunnlagt i 1937 og har hovedkontor i Gullaug, Norway.",
    "description_length": 836
  },
  {
    "ticker": "KIT.OL",
    "company_name": "Kitron ASA",
    "sector": "Teknologi",
    "industry": "Electronic Components",
    "original_description": "Kitron ASA driver as an electronics manufacturing tjenester provider in Norway, Sweden, Denmark, Lithuania, Germany, Poland, the Czech Republic, India, China, Malaysia, og the United States. Selskapet produserer og selger electronics that are embedded in the customer's own produkter; og box-built electronic produkter. Selskapet also tilbyr electronics manufacturing tjenester, inkludert automated assembly of printed circuit boards og higher-level system integration; utvikling tjenester, such as produkt utvikling, produkt forvaltning, og re-ingeniørtjenester; and industrialization tjenester, inkludert prototype manufacturing, evaluation of new produkter, component engineering og database, test utvikling, design og build of high-level assembly lines, og environmental durability testing. In addition, selskapet tilbyr sourcing og procurement tjenester; logistics og distribution; redesign, reparasjon, og vedlikehold; produkt deployment tjenester; cable harness manufacturing og components analysis; og resilience testing tjenester. Selskapet markedsfører its tjenester to the connectivity, electrification, industry, medical devices, og defense/aerospace sectors. Kitron ASA ble grunnlagt i 1962 og har hovedkontor i Billingstad, Norway.",
    "description_length": 1245
  },
  {
    "ticker": "KCC.OL",
    "company_name": "Klaveness Combination Carriers ASA",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Klaveness Combination Carriers ASA eier og driver combination carriers for the dry bulk shipping og produkt tanker industries in the Middle East, Australia, Oceania, North East Asia, South America, North America, Europe, Africa, Southeast Asia, and South Asia. Selskapet's vessels transport caustic coda løsning, floating fertilizer, molasses, clean petroleum produkter, heavy liquid cargoes, og various types of dry bulk commodities. Selskapet eier og driver eight CABU vessels, three CABU newbuild contracts og eight CLEANBU vessels. Selskapet var tidligere kjent som Klaveness Combination Carriers AS og endret navn til Klaveness Combination Carriers ASA in February 2019. Selskapet ble stiftet i 2018 og har hovedkontor i Oslo, Norway. Klaveness Combination Carriers ASA er et datterselskap av Rederiaksjeselskapet Torvald Klaveness.",
    "description_length": 837
  },
  {
    "ticker": "KOMPL.OL",
    "company_name": "Komplett ASA",
    "sector": "Sykliske forbruksvarer",
    "industry": "Netthandel",
    "original_description": "Komplett ASA driver as an online retailer of electronics produkter in Norway, Sweden, and Denmark. Selskapet driver gjennom three segmenter: Business to Consumer (B2C), Business to Business (B2B), and Distribution. Selskapet tilbyr components, gaming, brown goods, peripherals, white goods og home, handheld og accessories, and PCs. Selskapet also serves the private consumer marked for electronics, teknologi produkter, og consumer goods gjennom online shops, selling produkter sourced from third-party brands og its own private labels under the NetOnNetm, Komplett, and Webhallen brands, as well as gjennom Komplett.no, Komplett.se, Komplett.dk., Webhallen.com, NetOnNet.se, og NetOnNet.no; og retail stores. In addition, selskapet driver online marked for corporate kunder focusing on the small og medium sized enterprises, og small office/home office segmenter; tilbyr its produkter gjennom its web shops Komplettbedrift.no og Komplettforetag.se for digital kunder; og selger its produkter under the Ironstone brand. Further, it is involved in large-scale distribution contracts for salg of mobile og IT produkter to resellers og other big entities which are operated under the Itegra brand og gjennom the websites Itegra.no og Itegra.se. Selskapet var tidligere kjent som Norkom ASA og endret navn til Komplett ASA in December 2002. Komplett ASA ble grunnlagt i 1991 og har hovedkontor i Sandefjord, Norway.",
    "description_length": 1412
  },
  {
    "ticker": "KOA.OL",
    "company_name": "Kongsberg Automotive ASA",
    "sector": "Sykliske forbruksvarer",
    "industry": "Auto Parts",
    "original_description": "Kongsberg Automotive ASA utvikler, produserer, og selger produkter to the automotive industry globalt. Selskapet driver gjennom Drive Control Systems (DCS) and Flow Control Systems (FCS) segmenter. The Drive Control Systems (DCS) segment driver med the designing og manufacturing of produkter for the automotive og the off-highway industry, inkludert pneumatic og electric actuation systems for gear control og clutch actuation; steering column modules; og pedals and throttles for off-highway applications. The Flow Control Systems (FCS) segment designer og produserer produkter for both the automotive og commercial vehicle markedsfører, as well as industrial applications. This segment's portefølje includes couplings for air brake og air suspension systems; og clean powertrain fluid assemblies, as well as chassis og battery coolant løsninger. Selskapet serves original equipment manufacturers (OEMs) and Tier 1 suppliers in commercial vehicle, off-highway, og passenger car markedsfører. Selskapet var tidligere kjent som Kongsberg Automotive Holding ASA og endret navn til Kongsberg Automotive ASA in August 2014. Kongsberg Automotive ASA ble grunnlagt i 1957 og har base i Kongsberg, Norway.",
    "description_length": 1199
  },
  {
    "ticker": "KOG.OL",
    "company_name": "Kongsberg Gruppen ASA",
    "sector": "Industri",
    "industry": "Aerospace og Defense",
    "original_description": "Kongsberg Gruppen ASA, sammen med sine datterselskaper, tilbyr high-tech systems and løsninger primarily to kunder in the maritime og defense markedsfører. The Kongsberg Maritime segment tilbyr integrated løsninger, inkludert ship design, utvikling of systems for autonomous/remotely controlled vessels, og for its electro produkt portefølje; produkt og teknologi utvikling, supply chain drift, og project delivery of bridge systems, automation og safety, and sensing løsninger; propulsion systems, maneuvering systems, og handling systems; og support tjenester og spare parts to ships, as well as energi løsninger. The Kongsberg Defence & Aerospace segment tilbyr various systems og tjenester to the defence industry. Selskapet tilbyr air defence og combat systems, sonars, og navigation for marine vessels og submarines, as well as integrated command og control systems; remote control weapon stations for land-based vehicles og marine vessels; remote tower løsninger for airports; produkter for military tactical communication; naval strike og air-to-surface missiles; og components and tjenester to the space industry, as well as port monitoring systems. This segment also tilbyr lightweight composite og titanium components for F-35 combat aircraft, as well as vedlikehold og lifecycle tjenester for military og civil capabilities. The Kongsberg Discovery segment tilbyr subsea positioning og communication technologies; sustainable forvaltning technologies; og technologies that tilbyr its kunder with information about position, speed, acceleration, og heading, as well as uncrewed platforms deliver autonomous underwater og surface vessels for research, defence, og commercial use. The Other segment focuses on digitalization within the olje og gass, og renewable energi markedsfører. Selskapet driver primarily in Norway, Europe, North America, South America, Asia, Australia, and Africa. Kongsberg Gruppen ASA ble grunnlagt i 1814 og har hovedkontor i Kongsberg, Norway.",
    "description_length": 1980
  },
  {
    "ticker": "LINK.OL",
    "company_name": "LINK Mobility Group Holding ASA",
    "sector": "Kommunikasjonstjenester",
    "industry": "Telecom Services",
    "original_description": "LINK Mobility Group Holding ASA, sammen med sine datterselskaper, tilbyr mobile og communication-platform-as-a-tjeneste løsninger. Selskapet driver gjennom four segmenter: Northern Europe, Western Europe, Central Europe, and Global Messaging. Selskapet tilbyr Xenioo, a platform to automate conversations between companies og people across a range of text og voice channels; a marketing platform that tilbyr customer engagement, marketing automation, og email and SMS marketing tjenester; long numbers that sends og receives messages; og short codes, a memorable short mobile number to allow inbound communications to flow. Its løsninger are used in baking og finance, retail og ecommerce, logistics, advertising og marketing, travel og tourism, and healthcare industries, as well as government og public sectors. Selskapet ble grunnlagt i 2001 og har hovedkontor i Oslo, Norway.",
    "description_length": 879
  },
  {
    "ticker": "LSG.OL",
    "company_name": "Lerøy Seafood Group ASA",
    "sector": "Defensive forbruksvarer",
    "industry": "Packaged Foods",
    "original_description": "Lerøy Seafood Group ASA produces, processes, markedsfører, selger, og distributes seafood produkter. Selskapet driver in three segmenter: Wildcatch; Farming; and Value-Added Processing, Sales, and Distribution. Selskapet tilbyr salmon og trout, whole fish, fillets, portions, smoked, graved, block, cured, ready-to-eat, og ready-to-cook produkter. Selskapet also catches og processes various whitefish, inkludert fresh og frozen options, as well as produkter comprising shrimp, crab, og mussels. In addition, it tilbyr seaweed produkter og value-added produkter, such as breaded fish, burgers, patties, og other ready-to-cook or ready-to-eat seafood produkter; og crustaceans and molluscs, seaweed, og fresh and frozen consequence produkter for industrial processing. Selskapet markedsfører its produkter primarily under the Norway Seafoods, Arctic Supreme, Fjord Trout, Aurora Salmon, Fossen, Sea Eagle, Lerøy, and M?r brands to supermarkets, restaurants, canteens, hotels, wholesalers, retailers, food tjeneste companies, og industrial kunder. Selskapet driver in the European Union, Norway, Asia, rest of Europe, the United States, Canada, og internasjonalt. Selskapet ble grunnlagt i 1899 og har hovedkontor i Bergen, Norway. Lerøy Seafood Group ASA er et datterselskap av Austevoll Seafood ASA.",
    "description_length": 1299
  },
  {
    "ticker": "LIFE.OL",
    "company_name": "Lifecare ASA",
    "sector": "Helse",
    "industry": "Medisinsk utstyr",
    "original_description": "Lifecare ASA, sammen med sine datterselskaper, driver as a medical sensor company that utvikler teknologi for sensing og monitoring of various body analytes in Norway. Selskapet utvikler Sencell, a micro sensor for monitoring glucose levels in patients with diabetes og for veterinary applications. Selskapet also utvikler og produserer a nanostrain biosensor, an ultra-small device that measures pressure, temperature, force, or various other performance indicators in live tissue; og medical devices that remove subdermal implants. Lifecare ASA ble grunnlagt i 2006 og har hovedkontor i Bergen, Norway.",
    "description_length": 604
  },
  {
    "ticker": "MPCC.OL",
    "company_name": "MPC Container Ships ASA",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "MPC Container Ships ASA eier og driver a portefølje of container vessels. Selskapet focuses on small-to mid-size vessels that are chartered out on time-charter contracts to global og regional liner shipping companies serving intra-regional trade lanes. Selskapet driver a fleet of 59 vessels with an aggregate capacity of approximately 140,894 twenty-foot equivalent units. MPC Container Ships ASA ble stiftet i 2017 og har base i Oslo, Norway.",
    "description_length": 444
  },
  {
    "ticker": "MGN.OL",
    "company_name": "Magnora ASA",
    "sector": "Forsyning",
    "industry": "Fornybar forsyning",
    "original_description": "Magnora ASA driver as a renewable energi utvikling company in Norway, Sweden, South Africa og the United Kingdom. Selskapet focuses on developing wind, solar photovoltaic (PV), and battery storage projects. Selskapet serves renewable energi operators, investment og oil companies, og global marine contractors. Selskapet var tidligere kjent som Sevan Marine ASA og endret navn til Magnora ASA in October 2018. Magnora ASA ble stiftet i 2001 og har base i Oslo, Norway.",
    "description_length": 468
  },
  {
    "ticker": "MEDI.OL",
    "company_name": "Medistim ASA",
    "sector": "Helse",
    "industry": "Medisinsk utstyr",
    "original_description": "Medistim ASA utvikler, produces, tjenester, leases, og distributes medical devices for cardiac og vascular surgery in the United States, Asia, Europe, og internasjonalt. Selskapet tilbyr MiraQ Cardiac, a system that combines ultrasound imaging og transit time flow measurement (TTFM) in a single system for cardiac surgery; MiraQ Vascular, a system that combines ultrasound imaging og TTFM in a single system for vascular surgery; MiraQ Ultimate that combines TTFM og ultrasound imaging in a single system for cardiac, vascular, og transplant surgery; og imaging probes for intraoperative use. Selskapet also tilbyr QuickFit TTFM probes, which are designed to hold the vessel og ensure precise measurements on various types of vessel grafts; Vascular TTFM probes for locking slide mechanism designed to secure the vessel while minimizing the manipulation; ultrasound imaging probes; og Doppler probes that are used to search for intramural coronary arteries or to locate the position og quantify the degree of a stenosis. In addition, selskapet distributes og selger third party medical equipment. Medistim ASA ble grunnlagt i 1984 og har hovedkontor i Oslo, Norway.",
    "description_length": 1166
  },
  {
    "ticker": "MELG.OL",
    "company_name": "Melhus Sparebank",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Melhus Sparebank, a sparebank, tilbyr various bankprodukter og -tjenester to businesses, agriculture kunder, og private individuals in Norway. Selskapet tilbyr bank, Boligsparing for Ungdom, mutual fund, og retirement saving accounts. Selskapet tilbyr insurance tjenester for car og other vehicles, inkludert electric scooter, motorcycle, moped, boat, caravan, motorhome, ATV, tractor, snowmobile, trailer, og veteran cars; house og belongings, consisting of household items, travel, cottages, valuable items, drones, online, young, og Oak Plus; life og health for child, disabled, critical illness, og accident; and dogs, cats, og horses insurance tjenester. In addition, selskapet tilbyr car, mortgage, motorcycle, motorhomes, og ATVs loan produkter, as well as leasing tjenester. Further is tilbyr credit og bank cards, payment, online og mobile banking, og other daily banking tjenester. Selskapet ble grunnlagt i 1840 og har hovedkontor i Melhus, Norway.",
    "description_length": 959
  },
  {
    "ticker": "MORLD.OL",
    "company_name": "Moreld ASA",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "Moreld ASA tilbyr integrated løsninger for the energi, marine, og industrial sectors in Norway og internasjonalt. Selskapet driver gjennom Moreld Apply, Ocean Installer, and Global Maritime segmenter. Selskapet undertakes marine og subsea bygging works; og tilbyr a range of tjenester, such as subsea umbilicals, risers, flowlines, moorings, offshore renewables, og karbonfangst and storage, as well as inspection, reparasjon, og vedlikehold tjenester. Selskapet also tilbyr subsea installation tjenester for offshore olje og gass developments; vedlikehold og modification tjenester for offshore olje og gass platforms; support tjenester for renewable energi projects, inkludert karbonfangst, hydrogen, og havvind; and full offshore project lifecycle from engineering og design, consultancy, geoscience, og marine drift support løsninger. Selskapet var tidligere kjent som Moreld AS og endret navn til Moreld ASA in June 2025. Selskapet ble stiftet i 2021 og har hovedkontor i Stavanger, Norway.",
    "description_length": 995
  },
  {
    "ticker": "MOBA.OL",
    "company_name": "Morrow Bank ASA",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Morrow Bank ASA tilbyr unsecured financing to private individuals in Norway, Finland, Sweden, Netherlands, and Germany. Selskapet tilbyr deposit produkter, consumer loans, credit cards, og point of salg finance produkter. Selskapet also tilbyr payment, travel og cancellation, purchase insurance produkter, as well as ID theft tjenester. Selskapet var tidligere kjent som Komplett Bank ASA og endret navn til Morrow Bank ASA in April 2023. Morrow Bank ASA ble stiftet i 2012 og har hovedkontor i Lysaker, Norway.",
    "description_length": 512
  },
  {
    "ticker": "MOWI.OL",
    "company_name": "Mowi ASA",
    "sector": "Defensive forbruksvarer",
    "industry": "Landbruksprodukter",
    "original_description": "Mowi ASA, a seafood company, produces og selger Atlantic salmon produkter globalt. Selskapet driver gjennom three segmenter: Feed, Farming, and Sales & Marketing. Selskapet is involved in the salmon feed produksjon, salmon farming og primary processing, og seafood secondary processing aktiviteter. Selskapet tilbyr whole fish, plain og marinated fillets og steaks, hot- og cold-smoked salmon, og burgers and patties, as well as breaded, gravad, og sushi produkter. Selskapet var tidligere kjent som Marine Harvest ASA og endret navn til Mowi ASA in December 2018. Mowi ASA ble grunnlagt i 1964 og har base i Bergen, Norway.",
    "description_length": 624
  },
  {
    "ticker": "MULTI.OL",
    "company_name": "Multiconsult ASA",
    "sector": "Industri",
    "industry": "Ingeniør- og entreprenørvirksomhet",
    "original_description": "Multiconsult ASA, sammen med sine datterselskaper, driver med the provision of engineering design, consultancy, og architecture tjenester in Norway, Sweden, Denmark, Poland, og internasjonalt. Selskapet driver gjennom Region Oslo; Region Norway; Architecture; and International segmenter. Selskapet tilbyr multidisciplinary konsulenttjenester in the areas, inkludert design, planning, project supervision og forvaltning, geotechnical og environmental site surveys, og verification and control; og tilbyr analysis og due diligence, design og bygging forvaltning, environmental tjenester og HSE, geology og geotechnical study, green bond, hydrometry og hydrological field work, lenders advisory, renewable energi tender, og river basin forvaltning tjenester. Selskapet serves buildings og properties, cities og society, industry, olje og gass, renewable energi, rail og transportation, and water og environment sectors. Selskapet ble grunnlagt i 1908 og har hovedkontor i Oslo, Norway.",
    "description_length": 983
  },
  {
    "ticker": "NEXT.OL",
    "company_name": "NEXT Biometrics Group ASA",
    "sector": "Teknologi",
    "industry": "Scientific og Technical Instruments",
    "original_description": "NEXT Biometrics Group ASA, sammen med sine datterselskaper, tilbyr fingerprint sensor teknologi in Asia, Europe, Africa, and North America. Selskapet tilbyr fingerprint sensors, sensor modules, og readers; and touchpads, face recognition software, og utvikling kits. Selskapet selger its produkter to laptop og notebook, banking og finance, access control, og government ID sectors. Selskapet also selger its fingerprint sensor teknologi hardware og software to distributors og original equipment manufacturers of electronic components. NEXT Biometrics Group ASA ble grunnlagt i 2000 og har hovedkontor i Oslo, Norway.",
    "description_length": 618
  },
  {
    "ticker": "NORCO.OL",
    "company_name": "NORCONSULT ASA",
    "sector": "Industri",
    "industry": "Ingeniør- og entreprenørvirksomhet",
    "original_description": "Norconsult ASA tilbyr konsulenttjenester with focus on community planning, engineering design, og architecture in the Nordics og internasjonalt. Selskapet tilbyr konsulenttjenester for the planning og engineering design of bygging og eiendom projects, such as residential, office, og industrial buildings; hospitals, healthcare buildings, og care homes; schools og educational buildings; sports facilities; cultural buildings; laboratory buildings, terminal buildings for airports og railway stations; og fire and police stations. Selskapet also tilbyr infrastructure tjenester for water, geoscience og environment, and transport industries. In addition, selskapet tilbyr bygging engineering, execution, og land acquisition tjenester for renewable energi industry; og consultancy, project utvikling, engineering design, og execution of various bygging, renovation og modification projects with industrial installations. Further, it tilbyr IT rådgivningstjenester and løsninger for prosjektledelse, infrastructure, og property, as well as recruitment og staffing tjenester. Selskapet ble grunnlagt i 1929 og har hovedkontor i Sandvika, Norway.",
    "description_length": 1142
  },
  {
    "ticker": "NRC.OL",
    "company_name": "NRC Group ASA",
    "sector": "Industri",
    "industry": "Railroads",
    "original_description": "NRC Group ASA, sammen med sine datterselskaper, driver as a rail infrastructure company in Norway, Sweden, and Finland. Selskapet tilbyr groundwork tjenester, inkludert excavations, transport, masses sorting, og ditching, as well as water og drainage systems; og signaling systems, digital telecom systems, electro, tracks, og station buildings og terminals, as well as catenary systems comprising wires, masts, switches, og return current systems. Selskapet also tilbyr concrete work, recycling, demolition, og mass transport tjenester; steel structures; og specialized trackwork tjenester. In addition, it driver med constructing, upgrading, og maintaining track systems, inkludert structures, such as stations, tunnels, og bridges. Selskapet var tidligere kjent som Blom ASA og endret navn til NRC Group ASA in May 2015. NRC Group ASA ble grunnlagt i 1966 og har hovedkontor i Lysaker, Norway.",
    "description_length": 896
  },
  {
    "ticker": "NAPA.OL",
    "company_name": "Napatech A/S",
    "sector": "Teknologi",
    "industry": "Communication Equipment",
    "original_description": "Napatech A/S tilbyr programmable smart network interface cards og infrastructure processing units for cloud, enterprise, og telecom datacenter networks in the Americas og internasjonalt. Selskapet tilbyr Link Capture Software that enables packet capture with nanosecond timestamping og replay with precise inter-frame gap control; Link Inline Software tilbyr a processing architecture which offloads og accelerates flow aware application dataplanes; Link-Virtualization Software, offloads og accelerates the Open vSwitch data plane to enhance CPU efficiency og network performance; Link-Storage Software, a løsning for storage og network offload, virtualized cloud, og cloud-native or bare-metal server virtualization; Link-Security Software, offloads the TLS protocol from the host CPU to an IPU while maintaining full software compatibility at the application level; og Link Programmable, which enables end users og OEMs to deploy FPGA computation løsninger. Selskapet also tilbyr capture produkter, inkludert NT400D11, NT200A02, NT100A01. NT50B01, NT40A11, and N3070X SmartNIC; inline produkter, such as NT200A02; and F2070X IPU. In addition, selskapet tilbyr løsninger for 5G user plane function, cyber security, telecom, cloud og data centers, financial tjenester, infrastructure og defense, network forvaltning, og virtualization. Napatech A/S ble stiftet i 2003 og har hovedkontor i Copenhagen, Denmark.",
    "description_length": 1410
  },
  {
    "ticker": "NAVA.OL",
    "company_name": "Navamedic ASA",
    "sector": "Helse",
    "industry": "Medical Distribution",
    "original_description": "Navamedic ASA, a pharmaceutical company, utvikler, produces, markedsfører, and selger pharmaceuticals og related produkter in Norway, Sweden, Denmark, Finland, the Netherlands, og internasjonalt. Selskapet's produkt portefølje includes prescription og non-prescription pharmaceuticals, as well as medical nutrition produkter, medical devices, food supplements, og cosmetics. Selskapet tilbyr medical nutrition produkter for various therapeutic areas, inkludert phenylketonuria, homocystinuria, maple syrup urine disease, tyrosinemia, methylmalonic og propionic acidemia, glutaric aciduria, isovaleric acidemia, og urea cycle disorders, as well as produkter for glycogen storage diseases, fat metabolism, renal, malnutrition, og ketogenic diet. In addition, selskapet tilbyr consumer health produkter consisting of non-prescription drugs og health care produkter for pain relief, cough og cold, gastro, obesity, women's health, og others primarily gjennom pharmacies og drugstores; prescription medicines covering obesity, Parkinson's disease, urology, og cardiology; and antibiotics. Selskapet selger, markedsfører, and distributes its produkter to hospitals, patients, og pharmacies. Selskapet var tidligere kjent som Glucomed AS og endret navn til Navamedic ASA in 2004. Navamedic ASA ble stiftet i 2002 og har base i Oslo, Norway.",
    "description_length": 1333
  },
  {
    "ticker": "NKR.OL",
    "company_name": "Nekkar ASA",
    "sector": "Industri",
    "industry": "Specialty Industrial Machinery",
    "original_description": "Nekkar ASA driver as an industrial company builder in Europe, Turkey, Asia, Australia, New Zealand, North America, the United Arab Emirates, Africa, the United States, South America, India, Norway, og internasjonalt. Selskapet driver gjennom Syncrolift, Intellilift, Techano Oceanlift, Globetech, and Other segmenter. Selskapet tilbyr shiplifting systems for launching og retrievals of vessels, og transfer systems for moving vessels around the yard; FastDocking produkter for drift during docking og vedlikehold of vessels; og shiplift and transfer system og the upgrade of a ship transfer system. Selskapet also tilbyr load handling og lifting equipment, inkludert cranes, winches, fish crowding systems, fish transfer systems, og havvind load handling cranes for the aquaculture og offshore energi industry; FiiZK closed cage løsninger to avoid sea lice og enables waste collection from the harvest process; og SkyWalker, a wind turbine installation tool. In addition, selskapet utvikler industrial programvareløsninger for digitalizing workflows gjennom automation og remotely controlled systems for boring og offshore load handling; og tilbyr information og communication teknologi infrastructure, connectivity, og support tjenester. Selskapet var tidligere kjent som TTS Group ASA og endret navn til Nekkar ASA in July 2019. Nekkar ASA founded in 1966 og har hovedkontor i Kristiansand, Norway.",
    "description_length": 1400
  },
  {
    "ticker": "NEL.OL",
    "company_name": "Nel ASA",
    "sector": "Industri",
    "industry": "Specialty Industrial Machinery",
    "original_description": "Nel ASA, a hydrogen company, tilbyr løsninger to produce, store, og distribute hydrogen from renewable energi in Norway og internasjonalt. Selskapet driver in Nel Alkaline Electrolyser and Nel PEM Electrolyser segmenter. The Nel Alkaline Electrolyser segment supplies hydrogen produksjon equipment based on alkaline water electrolysis teknologi. The Nel PEM Electrolyser segment supplies hydrogen produksjon equipment based on proton exchange membrane (PEM) water electrolysis teknologi. Selskapet var tidligere kjent som DiaGenic ASA og endret navn til Nel ASA in October 2014. Nel ASA ble grunnlagt i 1927 og har hovedkontor i Oslo, Norway.",
    "description_length": 642
  },
  {
    "ticker": "NORBT.OL",
    "company_name": "Norbit ASA",
    "sector": "Teknologi",
    "industry": "Scientific og Technical Instruments",
    "original_description": "Norbit ASA tilbyr teknologiløsninger to kunder in a range of industries. Selskapet driver gjennom Oceans, Connectivity, and Product Innovation and Realization segmenter. Selskapet tilbyr multibeam sonar systems, inkludert integrated bathymetric systems, bathymetry systems, advanced monitoring systems for dredging, bygging og renewables, forward looking wide area imaging, advanced imaging systems for obstacle avoidance/MCM, og above water laser produkter under the NORBIT WINGHEAD, NORBIT WBMS, NORBIT NORdredge, and NORBIT FLS names; og GuardPoint 70, GuardPoint 100, GuardPoint 200, og GuardPoint 400 intruder detection sonar, NORTrace sonar performance prediction software, og mine detection og classification løsninger. Selskapet also tilbyr SeaCOP, a sensor integration platform og user interface common operational picture for emergency response; Securus system, a multipurpose camera system for the maritime environment; SeaView multi-sensor systems for shore-based installations; og SeaDarQ, oil spill detection radar. In addition, selskapet tilbyr Intelligent Traffic Systems, inkludert CEN dedicated short-range communication (DSRC) based connectivity devices and løsninger for smart tachographs, satellite-based truck tolling, battery-operated DSRC OBUs, og tailored løsninger with GNSS and GSM antennas; iData that specializes in vehicle monitoring, tailored reporting, fleet forvaltning, og fuel control; og Connected Solutions for eiendel og vehicle monitoring, tracking, og forvaltning.Norbit ASA ble grunnlagt i 1995 og har hovedkontor i Trondheim, Norway.",
    "description_length": 1575
  },
  {
    "ticker": "NOM.OL",
    "company_name": "Nordic Mining ASA",
    "sector": "Basisråvarer",
    "industry": "Other Industrial Metals og Mining",
    "original_description": "Nordic Mining ASA, sammen med sine datterselskaper, driver med the leting, extraction, og produksjon of industrial minerals og metals in Norway og internasjonalt. Selskapet primarily explores for rutile, garnet, quartz, og seabed minerals. Its flagship project is the Engebø project located in the west coast of Norway. Selskapet ble stiftet i 2006 og har base i Oslo, Norway.",
    "description_length": 376
  },
  {
    "ticker": "NOD.OL",
    "company_name": "Nordic Semiconductor ASA",
    "sector": "Teknologi",
    "industry": "Semiconductors",
    "original_description": "Nordic Semiconductor ASA, a fabless semiconductor company, utvikler og selger integrated circuits for use in short- og long- range wireless applications in Europe, the Americas, og the Asia Pacific. Selskapet tilbyr cellular IoT that comprises NB-IoT and LTE-M; non-terrestrial networks; Wi-Fi løsninger; Bluetooth low energi System-on-Chip (SoC); Bluetooth direction finding løsning; DECT NR+, a non-cellular radio standard; Thread, an IP-based wireless networking protocol løsning; nRF52 og nRF51 wireless SoCs; og range extenders, as well as Bluetooth LE audio, Bluetooth mesh, og Zigbee produkter. Selskapet also tilbyr Matter, a Connected Home over IP løsning; Amazon sidewalk; multiprotocol SoCs; Bluetooth wireless teknologi; security løsning; Edge AI; ANT løsninger, inkludert wireless multiprotocol SoCs supporting the ANT wireless protocol; og KNX IoT. In addition, selskapet tilbyr power forvaltning integrated circuits (PMIC) comprising nPM1100 PMIC, nPM1300 PMIC, nPM2100, og nPM6001 PMIC; cloud tjenester, such as location, security, og device forvaltning tjenester; nRF Cloud løsning; and application specific integrated circuits og related rådgivningstjenester. Its produkter are used for consumer devices, inkludert eiendel tracking, audio, education, HID, smart home og remotes, gaming, virtual reality og augmented reality produkter, og wearables; for industrial automation, such as automotive, beacons, building automation, professional lighting, transportation, retail, og smart agriculture og metering; and healthcare devices that include connected health og sports and fitness. Nordic Semiconductor ASA ble grunnlagt i 1983 og har hovedkontor i Trondheim, Norway.",
    "description_length": 1686
  },
  {
    "ticker": "NHY.OL",
    "company_name": "Norsk Hydro ASA",
    "sector": "Basisråvarer",
    "industry": "Aluminum",
    "original_description": "Norsk Hydro ASA driver med the power produksjon, bauxite extraction, alumina refining, aluminium smelting, og recycling aktiviteter globalt. Selskapet driver gjennom Hydro Bauxite & Alumina, Hydro Aluminium Metal, Hydro Metal markedsfører, Hydro Extrusions, and Hydro Energy segmenter. The Hydro Bauxite & Alumina segment driver med bauxite mining aktiviteter, produksjon of alumina, og related commercial aktiviteter, primarily the salg of alumina. The Hydro Aluminium Metal segment is involved in the primary aluminum produksjon casting aktiviteter. This segment principally tilbyr extrusion ingots, foundry alloys, og sheet and standard ingots. The Hydro Metal markedsfører segment selger produkter from selskapet's primary metal plants; driver recyclers; og trades in physical og financial metals. The Hydro Extrusions segment tilbyr extrusion profiles, building systems, og precision tubing produkter for bygging, automotive og heating, and ventilation og air conditioning sectors, as well as driver recycling facilities. The Hydro Energy segment driver med the trading og wholesale business in Brazil; energi sourcing drift; og drift of power stations in Norway, as well as renewable energi produksjon, such as wind og solar, battery materials, and grønt hydrogen. Selskapet also tilbyr extruded løsninger. Norsk Hydro ASA ble grunnlagt i 1905 og har hovedkontor i Oslo, Norway.",
    "description_length": 1384
  },
  {
    "ticker": "NSKOG.OL",
    "company_name": "Norske Skog ASA",
    "sector": "Basisråvarer",
    "industry": "Paper og Paper Products",
    "original_description": "Norske Skog ASA driver med the produksjon og salg of publication og packaging paper produkter in Norway, rest of Europe, North America, Asia, and Africa. Selskapet driver in Publication Paper Europe and Packaging paper segmenter. Selskapet tilbyr newsprint paper produkter comprising standard newsprint og other papers; magazine papers, inkludert super calendared SC og lightweight coated LWC papers; og recycled containerboards. Its produkter are primarily used in magazines, periodicals, catalogues, og brochures. Selskapet ble grunnlagt i 1962 og har hovedkontor i Oslo, Norway.",
    "description_length": 581
  },
  {
    "ticker": "NOL.OL",
    "company_name": "Northern Ocean Ltd.",
    "sector": "Energi",
    "industry": "Olje og gass Drilling",
    "original_description": "Northern Ocean Ltd. tilbyr offshore contract boring tjenester for the olje og gass industry globalt. Selskapet eier og driver two semi-submersible rigs. Selskapet also invests in power generation løsninger. Selskapet ble stiftet i 2017 og har base i Hamilton, Bermuda. Northern Ocean Ltd. er et datterselskap av Hemen Holding Limited.",
    "description_length": 334
  },
  {
    "ticker": "NAS.OL",
    "company_name": "Norwegian Air Shuttle ASA",
    "sector": "Industri",
    "industry": "Airlines",
    "original_description": "Norwegian Air Shuttle ASA, sammen med sine datterselskaper, tilbyr air travel tjenester in Norway og internasjonalt. Selskapet is also involved in aircraft financing, leasing, og ownership; cargo; og other aktiviteter. Selskapet ble grunnlagt i 1993 og har hovedkontor i Fornebu, Norway.",
    "description_length": 287
  },
  {
    "ticker": "NYKD.OL",
    "company_name": "Nykode Therapeutics AS",
    "sector": "Helse",
    "industry": "Bioteknologi",
    "original_description": "Nykode Therapeutics AS, a clinical-stage biopharmaceutical company, discovers og utvikler novel immunotherapies for the treatment of cancer og autoimmune diseases. Selskapet utvikler vaccines for the treatment cancer, autoimmune, og infectious diseases. Its lead produkt candidates include VB10.NEO, a cancer neoantigen vaccine, which is in phase I/IIa clinical trial for the treatment of locally advanced og metastatic tumors; og VB10.16, a therapeutic vaccine, which in phase II clinical trial for the treatment of human papilloma virus 16 induced malignancies, such as cervical cancer. Nykode Therapeutics AS ble grunnlagt i 2006 og har hovedkontor i Oslo, Norway.",
    "description_length": 667
  },
  {
    "ticker": "OKEA.OL",
    "company_name": "OKEA ASA",
    "sector": "Energi",
    "industry": "Olje og gass EogP",
    "original_description": "OKEA ASA, an olje og gass company, driver med the utvikling og produksjon of olje og gass in the Norwegian Continental Shelf. Selskapet ble stiftet i 2015 og har hovedkontor i Trondheim, Norway.",
    "description_length": 194
  },
  {
    "ticker": "ODL.OL",
    "company_name": "Odfjell Drilling Ltd.",
    "sector": "Energi",
    "industry": "Olje og gass Drilling",
    "original_description": "Odfjell Drilling Ltd. driver med owning og operating mobile offshore boring units primarily in Norway and Namibia. Selskapet driver gjennom Own Fleet and External Fleet segmenter. Selskapet also tilbyr forvaltning tjenester to other owners of boring units, such as operational forvaltning, regulatory requirements forvaltning, marketing, contract negotiations og client relations, og drift and mobilization preparation tjenester. Selskapet ble grunnlagt i 1914 og har base i Aberdeen, the United Kingdom. Odfjell Drilling Ltd. driver as a subsidiary of Odfjell Partners Holding Ltd.",
    "description_length": 582
  },
  {
    "ticker": "ODF.OL",
    "company_name": "Odfjell SE",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Odfjell SE tilbyr tjenester for the transportation og storage of bulk liquid chemicals, acids, edible oils, og other specialty produkter in North America, South America, Norway, the Netherlands, rest of Europe, the Middle East, Asia, Africa, and Australasia. Selskapet driver gjennom Chemical Tankers and Tank Terminals segmenter. Selskapet eier og driver chemical tankers that tilby global og regional transportation; og tank terminals, which provide storage of various chemicals og petroleum produkter. Per December 31, 2024, it operated gjennom a chemical tanker fleet of 71 vessels, inkludert 46 owned/leased, 4 operational bareboat, 14 time chartered, og 3 pool vessels. Selskapet's terminal network consists of 459 tanks with 1.3 million cubic meters of storage capacity. Odfjell SE ble stiftet i 1914 og har hovedkontor i Bergen, Norway.",
    "description_length": 844
  },
  {
    "ticker": "ODFB.OL",
    "company_name": "Odfjell SE",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Odfjell SE tilbyr tjenester for the transportation og storage of bulk liquid chemicals, acids, edible oils, og other specialty produkter in North America, South America, Norway, the Netherlands, rest of Europe, the Middle East, Asia, Africa, and Australasia. Selskapet driver gjennom Chemical Tankers and Tank Terminals segmenter. Selskapet eier og driver chemical tankers that tilby global og regional transportation; og tank terminals, which provide storage of various chemicals og petroleum produkter. Per December 31, 2024, it operated gjennom a chemical tanker fleet of 71 vessels, inkludert 46 owned/leased, 4 operational bareboat, 14 time chartered, og 3 pool vessels. Selskapet's terminal network consists of 459 tanks with 1.3 million cubic meters of storage capacity. Odfjell SE ble stiftet i 1914 og har hovedkontor i Bergen, Norway.",
    "description_length": 844
  },
  {
    "ticker": "OTL.OL",
    "company_name": "Odfjell Technology Ltd.",
    "sector": "Energi",
    "industry": "Olje og gass Drilling",
    "original_description": "Odfjell Technology Ltd., sammen med sine datterselskaper, driver as a supplier of offshore drift, well tjenester teknologi, og engineering løsninger in Norway, the United Kingdom, rest of Europe, Kuwait, Malaysia, rest of Asia, og internasjonalt. Selskapet driver gjennom Well Services; Operations; and Projects & Engineering segmenter. The Well Services segment tilbyr casing og tubular running tjenester, inkludert automated og conventional; boring tool og tubular rental tjenester; og specialist well intervention produkter og tjenester for leting wells og produksjon. Its Operations segment driver med the produksjon boring og well completion on kunder' rigs. This segment is also involved in the slot recovery, plug og abandonment, work-overs, og vedlikehold aktiviteter, as well as rig installation tjenester; platform boring tjenester on fixed og floating produksjon platforms with subsea blowout preventers; og forvaltning and performance of tjenester on leased jack-up rigs. The Projects & Engineering segment tilbyr engineering og integrity tjenester, inkludert design og engineering, and building supervision; og prosjektledelse and operational support for units in drift, newbuild projects, renewal survey / SPS recertification projects, og yard stays. Selskapet tilbyr its tjenester to the offshore olje og gass industry. Odfjell Technology Ltd. ble grunnlagt i 1973 og har hovedkontor i Aberdeen, the United Kingdom.",
    "description_length": 1430
  },
  {
    "ticker": "OET.OL",
    "company_name": "Okeanis Eco Tankers Corp.",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Okeanis Eco Tankers Corp., a rederi, eier og driver tanker vessels globalt. Selskapet driver a fleet of 14 tanker vessels comprising six modern Suezmax tankers og eight modern VLCC tankers focusing on the transportation of crude oil. Okeanis Eco Tankers Corp. ble stiftet i 2018 og har base i Neo Faliro, Greece.",
    "description_length": 312
  },
  {
    "ticker": "OLT.OL",
    "company_name": "Olav Thon Eiendomsselskap ASA",
    "sector": "Eiendom",
    "industry": "Eiendomstjenester",
    "original_description": "Olav Thon Eiendomsselskap ASA driver med the property rental business in Norway and Sweden. Selskapet driver gjennom Shopping Center and Commercial Property segmenter. Selskapet's property portefølje comprises retail, offices, logistics, hotel properties, og residential rentals. Selskapet is also involved in the property utvikling og forvaltning aktiviteter. Selskapet ble grunnlagt i 1958 og har base i Oslo, Norway. Olav Thon Eiendomsselskap ASA er et datterselskap av Olav Thon Gruppen AS.",
    "description_length": 494
  },
  {
    "ticker": "ORK.OL",
    "company_name": "Orkla ASA",
    "sector": "Defensive forbruksvarer",
    "industry": "Packaged Foods",
    "original_description": "Orkla ASA driver as an industrielt investeringsselskap within brands og consumer-oriented businesses in Norway, Sweden, Denmark, Finland, Iceland, the Baltics, rest of Europe, og internasjonalt. Selskapet tilbyr branded produkter, inkludert frozen pizza, ketchup, soups, sauces, bread toppings, og ready-to-eat meals gjennom grocery channels, as well as food tjeneste, convenience stores, og petrol stations. Selskapet also tilbyr confectionery, biscuit, og snack produkter; og spices, masalas, og food produkter based on dried mixes. In addition, selskapet tilbyr personal care, hygiene, laundry detergent, og cleaning produkter; dietary supplement, oral care, sport nutrition, og weight control produkter; wound care produkter og first aid equipment; painting tools og accessories; basic og wool garments; og professional cleaning produkter. Further, it driver Gymgrossisten, Proteinfabrikken, Bodystore, and Fitnesstukku e-commerce portals for health og sports nutrition produkter, as well as restaurants. Additionally, selskapet supplies margarine og butter blends, bread og cake improvers og mixes, yeast, marzipan, og ice cream ingredients; produces og supplies vannkraft to the Nordic power marked; og utvikler and selger eiendom properties. Selskapet tilbyr its food produkter under the Grandiosa, TORO, Stabburet, Felix, Paulúns, Fun Light, Abba, Beauvais, Kalles, Den Gamle Fabrik, Hamé, and Vitana brands; confectionery og snacks under the KiMs, Nidar, Stratos, Sætre, Göteborgs Kex, OLW, Panda, Laima, Selga, Taffel, Kalev, and Nói Síríus brands; home og personal care produkter under the Zalo, OMO, Blenda, Jif, Define, Solidox, Dr Greve, Lano, and Bliw brands; health produkter under the Möller's, Jordan, Vitalab, OSL, Cederroth First Aid, Salvequick, Livol, Nutrilett, Maxim, Collett, Solidox, and CuraMed brands; og food ingredients under the Odense, Mors Hjemmebakte, KronJäst, Bakkedal, and NATURLI brands. Selskapet ble grunnlagt i 1918 og har base i Oslo, Norway.",
    "description_length": 1984
  },
  {
    "ticker": "OTEC.OL",
    "company_name": "Otello Corporation ASA",
    "sector": "Kommunikasjonstjenester",
    "industry": "Advertising Agencies",
    "original_description": "Otello Corporation ASA, gjennom its subsidiary, tilbyr mobile løsninger and platforms for digital payments, customer engagement, microfinance, og digital tjenester in Norway. Selskapet tilbyr Apps Club subscription tjeneste to mobile carriers og smartphone OEMs. Selskapet var tidligere kjent som Opera Software ASA og endret navn til Otello Corporation ASA in January 2018. Otello Corporation ASA was established in 1995 og har base i Oslo, Norway.",
    "description_length": 449
  },
  {
    "ticker": "OTOVO.OL",
    "company_name": "Otovo ASA",
    "sector": "Teknologi",
    "industry": "Solar",
    "original_description": "Otovo ASA, sammen med sine datterselskaper, driver an online marketplace for solar installations in Norway. Selskapet driver gjennom two segmenter, Marketplace and Subscription SPV. Selskapet utvikler og manages an online sales platform, which tilbyr subscription for solar panel installations og related produkter for private households. Selskapet driver in Europe, Norway, Sweden, Poland, Italy, Germany, Switzerland, Austria, France, the Netherlands, Belgium, Spain, Portugal, og the United Kingdom. Otovo ASA ble stiftet i 2015 og har hovedkontor i Oslo, Norway.",
    "description_length": 566
  },
  {
    "ticker": "BAKKA.OL",
    "company_name": "P/F Bakkafrost",
    "sector": "Defensive forbruksvarer",
    "industry": "Landbruksprodukter",
    "original_description": "P/F Bakkafrost, sammen med sine datterselskaper, produces og selger salmon produkter in North America, Western Europe, Eastern Europe, Asia, og internasjonalt. Selskapet driver gjennom seven segmenter: Fishmeal, Fish Oil and Fish Feed; Freshwater Faroe Islands; Freshwater Scotland; Farming Faroe Islands; Farming Scotland; Services; and Sales & Other. Selskapet's produkter include fresh og frozen whole salmon, fresh og frozen salmon fillets, fresh skin-packed salmon portions, frozen salmon portions og tails, frozen smoked salmon og salmon fillets, frozen salmon bits og pieces, frozen salmon off-cuts og belly flaps, frozen salmon heads, salmon backbones, og salmon skin. Selskapet is also involved in the produksjon og salg of fishmeal, fish oil, og fish feed; produksjon of eggs from breeding self-owned salmon strains; produksjon of smolts; og on-growing of salmon. In addition, selskapet manages a fleet of farming tjeneste vessels; tilbyr fish transportation, treatments, net cleaning, harvesting, freight og logistical, and heavy marine support tjenester; converts organic waste into biogas, heating, electricity, og fertilizers; produces styrofoam boxes; og optimizes the value creation og retention from the harvested fish. P/F Bakkafrost ble grunnlagt i 1968 og har hovedkontor i Glyvrar, Denmark.",
    "description_length": 1311
  },
  {
    "ticker": "PLSV.OL",
    "company_name": "PARATUS ENERGY SERVICES LTD.",
    "sector": "Energi",
    "industry": "Olje og gass Drilling",
    "original_description": "Paratus Energy Services Ltd., gjennom sine datterselskaper, tilbyr boring tjenester og driver a fleet of jack-up rigs under contracts in Mexico. Selskapet also driver a fleet of pipe-laying support vessels under contracts in Brazil; og tilbyr subsea engineering, installation, og other tjenester, as well as well integrity og intervention, plug og abandonment, and decommissioning tjenester to its upstream olje og gass kunder. Selskapet ble stiftet i 2018 og har base i Hamilton, Bermuda.",
    "description_length": 489
  },
  {
    "ticker": "PCIB.OL",
    "company_name": "PCI Biotech Holding ASA",
    "sector": "Helse",
    "industry": "Bioteknologi",
    "original_description": "PCI Biotech Holding ASA, a biopharmaceutical company, focuses on the utvikling of technologies og novel therapies gjennom its photochemical teknologi platform. Selskapet's teknologi platform consists of a proprietary small molecule photosensitiser og a light source; og utvikler photochemical lysis (PCL) comprising light-triggered cell lysis, which enhances yield og purity in viral vector manufacturing, as well as photochemical internalisation (PCI), inducing light-triggered intracellular release for various therapeutic modalities. Selskapet also explores for intratumoural immunotherapy therapeutics that identifies novel treatment combinations to overcome resistance to immune-checkpoint inhibitors og safety-issues associated with treatments; og utvikler nucleic acid therapeutics to improve the treatment of dermatological diseases. PCI Biotech Holding ASA ble stiftet i 2007 og har hovedkontor i Oslo, Norway.",
    "description_length": 919
  },
  {
    "ticker": "PEN.OL",
    "company_name": "Panoro Energy ASA",
    "sector": "Energi",
    "industry": "Olje og gass EogP",
    "original_description": "Panoro Energy ASA, an independent leting og produksjon company, driver med the leting, utvikling, og produksjon of olje og gass properties in Africa. Selskapet holds eiendeler in Equatorial Guinea, Gabon, Tunisia, and South Africa. Selskapet ble stiftet i 2009 og har base i Oslo, Norway.",
    "description_length": 288
  },
  {
    "ticker": "PARB.OL",
    "company_name": "Pareto Bank ASA",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Pareto Bank ASA tilbyr various bankprodukter og -tjenester in Norway. Selskapet accepts company og private deposits. Selskapet also tilbyr business financing, such as acquisition, recapitalization, owner, bridging, operating og working capital, og operating loans; financing for the purchase of utvikling plots; bygging loans; financing of commercial property; bridging financing; owner financing og liquidity credits; og shipping and offshore finance. Pareto Bank ASA ble stiftet i 2007 og har hovedkontor i Oslo, Norway.",
    "description_length": 522
  },
  {
    "ticker": "PNOR.OL",
    "company_name": "PetroNor E&P ASA",
    "sector": "Energi",
    "industry": "Olje og gass EogP",
    "original_description": "PetroNor E&P ASA driver as an independent olje og gass leting og produksjon company in in the Republic of the Congo, the Gambia, and Nigeria. Selskapet ble grunnlagt i 2017 og har hovedkontor i Oslo, Norway.",
    "description_length": 207
  },
  {
    "ticker": "PSE.OL",
    "company_name": "Petrolia SE",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "Petrolia SE, sammen med sine datterselskaper, driver med the rental og salg of energi tjeneste equipment to energi industry in Norway, rest of Europe, Asia, and Australia. Selskapet driver in two segmenter, Energy and Energy Service. Selskapet rents boring equipment, such as drill pipes og test tubing. Selskapet also tilbyr casing og tubing running, boring, og make and brake tjenester. In addition, selskapet driver med the leting og produksjon of olje og gass. Selskapet serves energi companies, boring contractors, og energi tjeneste companies. Selskapet var tidligere kjent som Petrolia E&P Holdings SE og endret navn til Petrolia SE in January 2013. Petrolia SE ble grunnlagt i 1997 og har base i Limassol, Cyprus.",
    "description_length": 721
  },
  {
    "ticker": "PEXIP.OL",
    "company_name": "Pexip Holding ASA",
    "sector": "Teknologi",
    "industry": "Software - Application",
    "original_description": "Pexip Holding ASA, a video teknologi company, tilbyr end-to-end video conferencing platform og digital infrastructure in the Americas, Europe, the Middle East, Africa, og the Asia Pacific. Selskapet tilbyr self-hosted software application og as-a-tjeneste deployment options for enterprise video conferencing, built on its proprietary Infinity teknologi. Selskapet also tilbyr Pexip Connect Standard, which tilbyr interoperability between traditional meeting room devices like Cisco, HP/Poly, and Avaya; Pexip Connect Essentials, a løsning that connects traditional meeting room devices; Pexip Connect for Teams Rooms, a løsning that lets users join any meeting, or place og receive calls to og from anyone, complete with a native experience from their teams rooms devices; Pexip Connect for Zoom Rooms, a løsning that lets users join teams meeting og enjoy a native experience; og Pexip Connect for Government gjennom FedRAMP and StateRAMP. In addition, it tilbyr Pexip Secure Meetings for Defense, a unified communication for defense sector; Pexip Secure Meetings for Government, a løsning for communication for government officials, agencies, og citizens; Pexip Secure Meetings for Justice, a secure og private communication løsning for court system; Pexip Secure Meetings for Health, a løsning with video visits for healthcare providers og patients; Pexip Private AI platforme, which enables AI-powered live captions og translations in secure video meetings; og Pexip Secure Scheduler for Web that tilbyr flexible og secure scheduling of virtual meetings. Further, selskapet tilbyr Pexip Video Platform Self-Hosted, a customizable og secure video platform for complete control og flexibility; Pexip Video Platform as a Service, an easy-to-use video engine løsning for regulated industries; og trust centers, as well as tilbyr professional, room forvaltning, og training tjenester. Pexip Holding ASA ble grunnlagt i 2011 og har hovedkontor i Oslo, Norway.",
    "description_length": 1958
  },
  {
    "ticker": "PHO.OL",
    "company_name": "Photocure ASA",
    "sector": "Helse",
    "industry": "Drug Manufacturers - Specialty og Generic",
    "original_description": "Photocure ASA, sammen med sine datterselskaper, driver med the research, utvikling, produksjon, distribution, marketing, og salg of pharmaceutical produkter. Selskapet driver gjennom Commercial Franchise and Development Portfolio segmenter. Selskapet tilbyr Hexvix/Cysview for the detection og forvaltning of bladder cancer. Selskapet also utvikler Cevira for the treatment of human papilloma virus-induced cervical precancerous lesions. Selskapet has a license agreement with Asieris MediTech Co to develop og commercialize Cevira; og a strategic agreement with Richard Wolf GmbH to develop og commercialize a 4K LED high-definition reusable blue light cystoscope based on Richard Wolf's System blue teknologi. Selskapet selger its produkter to pharmaceutical wholesalers, pharmacies, og hospitals gjennom license partners. Selskapet driver in the Nordic countries, Germany, France, Austria, the United Kingdom, the Benelux, Italy, rest of the Europe, Canada, og the United States. Photocure ASA ble grunnlagt i 1993 og har hovedkontor i Oslo, Norway.",
    "description_length": 1052
  },
  {
    "ticker": "POL.OL",
    "company_name": "Polaris Media ASA",
    "sector": "Kommunikasjonstjenester",
    "industry": "Forlag",
    "original_description": "Polaris Media ASA driver as a media house og printing company in Norway and Sweden. Selskapet tilbyr digital advertising tjenester. Selskapet tilbyr prints group og external newspapers, inkludert editorial supplements og advertisement leaflets, civil prints, og other magazines/leaflets. In addition, selskapet distributes newspapers, as well as parcels, mail, og other produkt deliveries. Polaris Media ASA ble grunnlagt i 2008 og har hovedkontor i Trondheim, Norway.",
    "description_length": 468
  },
  {
    "ticker": "PRS.OL",
    "company_name": "Prosafe SE",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "Prosafe SE, sammen med sine datterselskaper, eier og driver semi-submersible accommodation vessels in South America, North America, and Europe. Selskapet is also involved in the vedlikehold og modification of installations on fields for the produksjon, hook-up og commissioning of new fields, tiebacks to existing infrastructure, og decommissioning aktiviteter. Selskapet eier og driver a fleet of five semi-submersible accommodation, safety, og support vessels; og two new build accommodation vessels at the yard. Selskapet primarily serves olje og gass industries. Prosafe SE ble grunnlagt i 1972 og har base i Stavanger, Norway.",
    "description_length": 631
  },
  {
    "ticker": "PROT.OL",
    "company_name": "Protector Forsikring ASA",
    "sector": "Finans",
    "industry": "Insurance - Specialty",
    "original_description": "Protector Forsikring ASA, driver as a non-life insurance company, tilbyr direct general insurance og reinsurance to the commercial lines of business, public sector, og affinity schemes. Selskapet tilbyr property insurance, motor insurance, personal insurance, og liability insurance. Selskapet selger its produkter gjennom insurance brokers og agents. Protector Forsikring ASA ble stiftet i 2003 og har hovedkontor i Oslo, Norway.",
    "description_length": 430
  },
  {
    "ticker": "PUBLI.OL",
    "company_name": "Public Property Invest AS",
    "sector": "Eiendom",
    "industry": "Eiendomstjenester",
    "original_description": "Public Property Invest ASA, a eiendom company, owns, utvikler, driver, og rents eiendom properties in Norway. Selskapet's property portefølje, inkludert social infrastructure properties, as well as rental of office spaces. Selskapet serves tenants within the public sector, such as the police, judiciary functions, og public health organizations. Public Property Invest ASA ble stiftet i 2018 og har hovedkontor i Oslo, Norway.",
    "description_length": 427
  },
  {
    "ticker": "QEC.OL",
    "company_name": "Questerre Energy Corporation",
    "sector": "Energi",
    "industry": "Olje og gass EogP",
    "original_description": "Questerre Energy Corporation, an energi teknologi og innovation company, driver med the acquisition, leting, og utvikling non-conventional olje og gass projects in Canada. Selskapet produces tight oil, oil shale, shale oil, og shale gas. Selskapet primarily holds 40,320 acres located in Kakwa, Alberta, inkludert 25% working interest in 10,080 acres in Kakwa Central; 50% working interest in 4,480 acres in Kakwa North; 50% interest in 22,040 acres in Kakwa West; og 50% interest in 3,840 acres in Kakwa South. Selskapet also has 100% working interest in 12, 560 acres located in Antler, Saskatchewan; og oil shale eiendeler in Jordan and St. Lawrence Lowlands, Quebec. Selskapet var tidligere kjent som Westpro Equipment Ltd. and endret navn til Questerre Energy Corporation in December 2000. Selskapet ble stiftet i 1971 og har hovedkontor i Calgary, Canada.",
    "description_length": 861
  },
  {
    "ticker": "RECSI.OL",
    "company_name": "REC Silicon ASA",
    "sector": "Teknologi",
    "industry": "Semiconductor Equipment og Materials",
    "original_description": "REC Silicon ASA, sammen med sine datterselskaper, produces og selger silicon materials for the solar og electronics industries in Norway og internasjonalt. Selskapet tilbyr various Signature Silane gas, a pure form of silicon that produces produkt for fuel industries comprising specialty gases, inkludert Dichlorosilane, Monochlorosilane, and Disilane for use in the manufacturing processes of flat panel displays, semiconductors, og solar cells; og solar grade polysilicon, inkludert NextSi used for multi crystalline og monocrystalline solar ingot og wafer produksjon in the manufacturing of solar modules. Selskapet also tilbyr electronic grade polysilicon consisting of float zone-based devices are used in motor control og power conversion processes for hybrid og electric vehicles, wind energi, og high voltage transmission, 5G communications, high-speed trains, internet of things, og big data, as well as Czochralski for manufacturing of semiconductor wafers used in memory processors, optics, og micro electromechanical systems. Selskapet var tidligere kjent som Renewable Energy Corporation ASA og endret navn til REC Silicon ASA in October 2013. REC Silicon ASA ble grunnlagt i 1996 og har hovedkontor i Lysaker, Norway.",
    "description_length": 1232
  },
  {
    "ticker": "RANA.OL",
    "company_name": "Rana Gruber ASA",
    "sector": "Basisråvarer",
    "industry": "Steel",
    "original_description": "Rana Gruber ASA driver med the mining, processing, og salg of iron ore concentrate in Norway, the United Kingdom, Sweden, the United States, og internasjonalt. Selskapet excavates, processes, og selger iron oxide in the form of hematite that is used for metallurgical applications; magnetite to produce water treatment chemicals; og other special produkter, such as iron oxide pigments that is used for colorants, magnetic stripes, og chemical processes under the Colorana tradename. Selskapet markedsfører its produkter to steel manufacturers, water treatment chemical producers, as well as concrete, paint, plastics, heat forvaltning, automotive, og toner produksjon industry sectors. Rana Gruber ASA ble grunnlagt i 1937 og har hovedkontor i Mo i Rana, Norway.",
    "description_length": 763
  },
  {
    "ticker": "REACH.OL",
    "company_name": "Reach Subsea ASA",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "Reach Subsea ASA tilbyr subsea tjenester in Norway og internasjonalt. Selskapet driver in two segmenter, Oil & Gas and Renewable/Other. Selskapet tilbyr subsea tjenester, inkludert engineering løsninger and prosjektledelse for offshore drift; inspection, vedlikehold, og reparasjon tjenester, such as structural inspections, WROV drift, SCM changeout, scale squeeze drift, water injection, ready for drift, subsea equipment vedlikehold, reparasjon, commissioning, og boulder clearance; eiendel integrity og pipeline inspection tjenester; og bygging support tjenester, inkludert seabed intervention, boulder clearance, touchdown monitoring, og pre-lay and post-lay surveys, as well as vessel, remotely operated vehicles (ROV), personnel, survey, og on demand engineering. Selskapet also tilbyr geophysical, geotechnical, og environmental survey løsninger for site survey, pipeline/cable route survey, ROV, seabed mapping, og pipeline inspection; surface og subsea positioning løsninger to support marine bygging projects; specialist survey og positioning tjenester to support international marine bygging projects, offshore cable drift, rig og mooring drift, og seabed surveys; og support tjenester for offshore power, communication, og umbilical cables, as well as supporting drift og vedlikehold/inspection, reparasjon og vedlikehold tjenester. In addition, selskapet tilbyr geophysical monitoring løsninger for hydrocarbon producing fields offshore, inkludert 4D gravity, seafloor subsidence monitoring, depth watch for seismic nodes, injection integrity monitoring, well boring, og real time seismic monitoring tjenester; og environmental monitoring tjenester that include multi-physical monitoring tjenester. Selskapet var tidligere kjent som Transit Invest ASA og endret navn til Reach Subsea ASA in December 2012. Reach Subsea ASA ble stiftet i 1909 og har hovedkontor i Haugesund, Norway.",
    "description_length": 1895
  },
  {
    "ticker": "ROGS.OL",
    "company_name": "Rogaland Sparebank",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Rogaland Sparebank, an independent sparebank, tilbyr a range of banking og investment produkter to retail og corporate kunder in Norway. Selskapet driver gjennom three segmenter: Retail Market, Corporate Market, og eiendom. Selskapet tilbyr fixed rate deposits, deposit accounts, BSU, og tax withholding og other accounts subjected to withdrawal restrictions; child, death, income, critical illness, disability, car, home, cabin, contents, UNG, og other insurance produkter; og pension løsninger. Selskapet also tilbyr bank guarantee, overdrafts, leasing, bygging, og business loans, factoring og invoice sales; fixed interest, mortgage, car, og other vehicle loans, as well as small loans og refinancing, and green loans; bank og credit cards; various loans og guarantees; and mobile og internet banking tjenester. In addition, selskapet tilbyr eiendom brokerage tjenester og general investment advisory tjenester. Selskapet var tidligere kjent som Sandnes Sparebank og endret navn til Rogaland Sparebank in August 2024. Rogaland Sparebank ble grunnlagt i 1875 og har hovedkontor i Sandnes, Norway.",
    "description_length": 1099
  },
  {
    "ticker": "SDSD.OL",
    "company_name": "S.D. Standard ETC Plc",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "S.D. Standard ETC Plc, an investerings- og holdingselskap, focuses on energi, transport, og commodities segmenter. Selskapet var tidligere kjent som S.D. Standard Drilling Plc og endret navn til S.D. Standard ETC Plc in February 2022. S.D. Standard ETC Plc ble stiftet i 2010 og har hovedkontor i Limassol, Cyprus.",
    "description_length": 314
  },
  {
    "ticker": "ENH.OL",
    "company_name": "SED Energy Holdings Plc",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "SED Energy Holdings Plc, acquires og processes marine seismic data for the olje og gass industry in Europe, Africa, the Middle East, North and South America, og the Asia Pacific. Selskapet tilbyr 2D seismic; og source vessels that provide conventional undershoot, 4D repeat survey, wide azimuth, push reverse, long-term charter og vessel forvaltning, in-house source modelling og environmental decay analysis, og spot charter tjenester. Selskapet also eier og driver tender assisted boring rigs. In addition, selskapet conducts 2D, source, og niche 3D seismic surveys to support offshore leting og utvikling projects; manages the end-to-end process of seismic surveys; og driver specialized fleet of seismic vessels for data acquisition og operational efficiency. Selskapet har base i Nicosia, Cyprus.",
    "description_length": 801
  },
  {
    "ticker": "SNTIA.OL",
    "company_name": "SENTIA ASA",
    "sector": "Industri",
    "industry": "Ingeniør- og entreprenørvirksomhet",
    "original_description": "Sentia ASA driver med the bygging business in Norway and Sweden. Selskapet driver gjennom two segmenter: HENT and Sentia Sweden. The HENT segment tilbyr large og complex buildings, such as schools, cultural buildings, shopping malls, etc. The Sweden segment tilbyr hospitals, sports halls, og office buildings. Sentia ASA ble stiftet i 2012 og har hovedkontor i Oslo, Norway.",
    "description_length": 375
  },
  {
    "ticker": "SWON.OL",
    "company_name": "SOFTWAREONE HOLDING",
    "sector": "Teknologi",
    "industry": "Software - Application",
    "original_description": "SoftwareOne Holding AG, sammen med sine datterselskaper, tilbyr software og cloud løsninger in Switzerland, Germany, Austria, rest of Europe, Mauritius, South Africa, the United States, Canada, Latin America, the Asia Pacific, Dubai, and Qatar. Selskapet utvikler og delivers the teknologiløsninger that modernize applications og software in the cloud. Selskapet serves large enterprises, corporates, small og medium-sized enterprises, og public sector organizations. Selskapet has strategic agreement with ServiceNow to optimize kunder' IT investments. SoftwareOne Holding AG ble grunnlagt i 2000 og har hovedkontor i Stans, Switzerland.",
    "description_length": 638
  },
  {
    "ticker": "SAGA.OL",
    "company_name": "Saga Pure ASA",
    "sector": "Finans",
    "industry": "Asset Management",
    "original_description": "Saga Pure ASA, an investment company, driver med the investment og forvaltning related to industry, energi, og eiendom. Its business aktiviteter also include investment, forvaltning, drift, consultancy, ownership, og other tjenester in other businesses. Selskapet var tidligere kjent som Saga Tankers ASA og endret navn til Saga Pure ASA in November 2020. Saga Pure ASA ble stiftet i 2010 og har hovedkontor i Oslo, Norway.",
    "description_length": 423
  },
  {
    "ticker": "SALM.OL",
    "company_name": "SalMar ASA",
    "sector": "Defensive forbruksvarer",
    "industry": "Landbruksprodukter",
    "original_description": "SalMar ASA, an aquaculture company, produces og selger farmed salmon in Asia, North America, Europe, og internasjonalt. Selskapet driver gjennom Fish Farming Central Norway, Fish Farming Northern Norway, Icelandic Salmon, Sales & Industry, and SalMar Aker Ocean segmenter. Selskapet driver med the broodstock, marine-phase farming, harvesting, processing, og smolt produksjon aktiviteter. In addition, selskapet tilbyr fish fillets og related produkter. SalMar ASA ble stiftet i 1991 og har hovedkontor i Kverva, Norway.",
    "description_length": 520
  },
  {
    "ticker": "SALME.OL",
    "company_name": "Salmon Evolution ASA",
    "sector": "Defensive forbruksvarer",
    "industry": "Landbruksprodukter",
    "original_description": "Salmon Evolution ASA, sammen med sine datterselskaper, driver as a land-based salmon farming company in Norway og internasjonalt. Selskapet focuses on the produksjon of salmon meals. Salmon Evolution ASA ble grunnlagt i 2017 og har hovedkontor i Elnesvågen, Norway.",
    "description_length": 265
  },
  {
    "ticker": "SATS.OL",
    "company_name": "Sats ASA",
    "sector": "Sykliske forbruksvarer",
    "industry": "Fritid",
    "original_description": "Sats ASA tilbyr fitness og training tjenester in Norway, Sweden, Denmark, and Finland. Selskapet tilbyr sportswear, fitness gear, bars, og energi drinks. Selskapet driver fitness clubs under the SATS, ELIXIA, Fresh Fitness, and SATSYoga brand names. Sats ASA ble grunnlagt i 1995 og har hovedkontor i Oslo, Norway.",
    "description_length": 314
  },
  {
    "ticker": "SCANA.OL",
    "company_name": "Scana ASA",
    "sector": "Industri",
    "industry": "Specialty Industrial Machinery",
    "original_description": "Scana ASA tilbyr teknologi og tjenester for the offshore og energi industries in Norway, other European countries, the United States, Asia, and Africa. Selskapet driver in two segmenter: Energy and Offshore. Selskapet tilbyr stress joints, mooring systems, actuators, bop, risers, maintenace, og surface treatment produkter; og energi storage løsninger, shore power, og energi modules. Selskapet also tilbyr produkt og tjeneste portefølje, inkludert design og integration of electrical power systems, electrical infrastructure, energi storage systems, og control system. In addition, selskapet is involved in design og manufacturing of riser applications og specialist subsea equipment to rig servicing; ISS tjenester; mooring systems; IMR lifecycle tjenester for rigs og vessels; and mooring løsninger and valve control systems to the shipping, energi, og aquaculture industry. Scana ASA var tidligere kjent som Incus Investor ASA og endret navn til Scana ASA in May 2020. Selskapet ble grunnlagt i 1976 og har hovedkontor i Bergen, Norway.",
    "description_length": 1041
  },
  {
    "ticker": "SCATC.OL",
    "company_name": "Scatec ASA",
    "sector": "Forsyning",
    "industry": "Fornybar forsyning",
    "original_description": "Scatec ASA, sammen med sine datterselskaper, tilbyr renewable energi løsninger globalt. Selskapet driver gjennom Power Production and Development & bygging segmenter. Selskapet produces og selger solar, wind, og hydro generated electricity. Selskapet also utvikler, builds, owns, og driver solar, wind, og hydro power plants; og storage løsninger. Selskapet is also involved in the engineering, procurement, og bygging, as well as drift, vedlikehold, og eiendel forvaltning of power plants. Selskapet has a total of 5 GW of renewable energi plants in drift og under bygging. Selskapet var tidligere kjent som Scatec Solar ASA og endret navn til Scatec ASA in November 2020. Scatec ASA ble stiftet i 2007 og har hovedkontor i Oslo, Norway.",
    "description_length": 738
  },
  {
    "ticker": "SEA1.OL",
    "company_name": "Sea1 Offshore Inc.",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "Sea1 Offshore Inc., sammen med sine datterselskaper, eier og driver offshore support vessels for the offshore energi tjeneste industry. Selskapet driver gjennom Subsea Vessels; Anchor-Handling Tug Supply (AHTS) Vessels; Platform Supply Vessels (PSVs); Fast Crew & Oil Spill Recovery Vessels; and Other segmenter. Selskapet tilbyr offshore vessel aktiviteter, such as anchor handling og towing, platform supply, well intervention tjenester, subsea drift, walk-to-work, og trenching drift for windfarms. Selskapet has a fleet of 17 vessels, which includes two offshore subsea bygging vessels, two well-intervention vessels, one scientific core-boring vessel, six anchor handling tug supply vessels, two platform supply vessels, og four fast crew og oil spill recovery vessels. Selskapet driver in the North Sea, Brazil, Australia, Canada, Southeast Asia, South America and West Africa. Selskapet var tidligere kjent som Siem Offshore Inc. and endret navn til Sea1 Offshore Inc. in May 2024. Sea1 Offshore Inc. ble grunnlagt i 2005 og har hovedkontor i Kristiansand, Norway.",
    "description_length": 1071
  },
  {
    "ticker": "SBO.OL",
    "company_name": "Selvaag Bolig ASA",
    "sector": "Eiendom",
    "industry": "Real Estate - Development",
    "original_description": "Selvaag Bolig ASA, a housing utvikling company, driver med the utvikling, bygging, og salg of residential properties in Greater Oslo, Bergen, Stavanger, Trondheim, and Stockholm. Selskapet driver gjennom Property Development and Other segmenter. Selskapet also tilbyr prosjektledelse tjenester. Selskapet ble grunnlagt i 2008 og har hovedkontor i Oslo, Norway. Selvaag Bolig ASA driver as a subsidiary of Selvaag AS.",
    "description_length": 416
  },
  {
    "ticker": "SHLF.OL",
    "company_name": "Shelf Drilling, Ltd.",
    "sector": "Energi",
    "industry": "Olje og gass Drilling",
    "original_description": "Shelf Drilling, Ltd., sammen med sine datterselskaper, driver as a shallow water offshore boring contractor in the Middle East, North Africa, the Mediterranean, Southeast Asia, India, West Africa, og the North Sea. Selskapet tilbyr equipment og tjenester for the boring, completion, vedlikehold, og decommissioning of oil og natural gas wells, og associated tjenester using the rigs of its own fleet og related equipment. Selskapet also tilbyr catering, ytterligere equipment og personnel, and consumables or accommodations at the request of the customer using third party vendors. In addition, selskapet owns various independent-leg cantilever jack-up rigs. Selskapet serves government owned or controlled energi companies; og publicly listed global integrated oil companies or independent leting og produksjon companies. Shelf Drilling, Ltd. ble stiftet i 2012 og har hovedkontor i Dubai, the United Arab Emirates.",
    "description_length": 916
  },
  {
    "ticker": "SKUE.OL",
    "company_name": "Skue Sparebank",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Skue Sparebank tilbyr various bankprodukter og -tjenester for individual og business in Norway. Selskapet tilbyr checking, business, deposit, tax withholding, client, agricultural, currency, investment, deposit, retirement, og group accounts; business, bygging, consumer, car, other vehicle, og small loans, as well as mortgage, bank guarantee, factoring, overdraft, og leasing tjenester; og home and leisure, car og other vehicles, animal, company og employees, agriculture, og travel insurance produkter. Selskapet also tilbyr savings og pension produkter; og online and mobile banking, bank card, og payment tjenester. Selskapet var tidligere kjent som Nes Prestegjelds Sparebank og endret navn til Skue Sparebank in October 2013. Skue Sparebank ble grunnlagt i 1842 og har base i Geilo, Norway.",
    "description_length": 798
  },
  {
    "ticker": "SMCRT.OL",
    "company_name": "SmartCraft ASA",
    "sector": "Teknologi",
    "industry": "Software - Application",
    "original_description": "SmartCraft ASA tilbyr programvareløsninger to the bygging industry in Norway, Sweden, Finland, og the United Kingdom. Selskapet tilbyr software, inkludert Cordel, a SaaS løsning; Bygglet, a SaaS born in the cloud løsning; EL-VIS, a modular løsning comprising tjenester in the electricians' daily drift; og Congrid, a cloud-based tool for prosjektledelse. Selskapet also tilbyr Kvalitetskontroll, a cloud-based prosjektledelse løsning and quality assurance platform; El-verdi, a digital sales tool for electricians; og ELinn, a cloud-based løsning for electricians to handle prosjektledelse tjenester. In addition, selskapet tilbyr its produkter under the HomeRun, Coredination, Locka, and Clixifix brands. SmartCraft ASA ble grunnlagt i 1987 og har hovedkontor i Hønefoss, Norway.",
    "description_length": 780
  },
  {
    "ticker": "SMOP.OL",
    "company_name": "Smartoptics Group ASA",
    "sector": "Teknologi",
    "industry": "Communication Equipment",
    "original_description": "Smartoptics Group ASA tilbyr optical networking løsninger and devices in the Americas, Europe, the Middle East, Africa, og the AsiaPacific. Its produkter include flexible open-line systems; multiplexers og optical add/drop multiplexers; modular transponders og muxponders; optical transceivers; active og passive systems; og optical transceivers datasheets, as well as Sosmart software suite. Its løsninger are used in metro og regional network applications, as well as in metro access networks. Selskapet serves enterprises, governments, cloud providers, Internet exchanges, og cable and telecom operators gjennom its sales force; og business partners, which include distributors, OEMs, and VARs. Selskapet ble grunnlagt i 1990 og har hovedkontor i Oslo, Norway.",
    "description_length": 764
  },
  {
    "ticker": "SOGN.OL",
    "company_name": "Sogn Sparebank",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Sogn Sparebank tilbyr various bankprodukter og -tjenester in Norway. Selskapet tilbyr saving og pension accounts; home loans og small loans, as well as loans for cars og other vehicles; credit og other cards; og mobile and online banking tjenester, as well as payment tjenester. Selskapet also tilbyr bank guarantees, bygging loans, overdraft, og business loans, as well as leasing og refinancing without collateral. In addition, selskapet tilbyr home og leisure, animals, damage, car, Death, critical illness, disabled, work machine, data attack, property damage, health, homeowners, agriculture, craftsman, commercial vehicle, business, og personnel insurance produkter. Sogn Sparebank ble grunnlagt i 1846 og har base i Årdalstangen, Norway.",
    "description_length": 744
  },
  {
    "ticker": "SOMA.OL",
    "company_name": "Solstad Maritime ASA",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Solstad Maritime ASA eier og driver offshore tjeneste vessels (OSVs) that tilbyr maritime tjenester to the offshore energi industry in North Sea, North and Central America, Mediterranean og rest of the Europe, Africa, South America, Australia, and Asia. Selskapet driver in three segmenter: Anchor Handling Tug Supply Vessels (AHTS), bygging Service Vessels (CSVs), and Services segmenter. Selskapet driver subsea bygging contracts; og tilbyr tjenester to various vessel spreads, such as ROVs, tooling, project personnel, engineering support, survey, og other tjenester. Selskapet also tilbyr vessel forvaltning og drift tjenester. Selskapet driver 10 AHTS vessels og 22 CSVs. Solstad Maritime ASA ble stiftet i 2023 og har hovedkontor i Skudeneshavn, Norway.",
    "description_length": 759
  },
  {
    "ticker": "SOFF.OL",
    "company_name": "Solstad Offshore ASA",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Solstad Offshore ASA eier og driver offshore tjeneste vessels. Selskapet eier og driver bygging tjeneste vessels og anchor handling tug support vessel and; og tilbyr maritime tjenester to offshore energi industry. Selskapet tilbyr renewable energi tjenester, subsea support drift, node seismic drift, subsea bygging aktiviteter, support for well stimulation drift, og subsea and mooring installations; og ytterligere tjenester, such as ROVs, tooling, project personnel, og engineering support, as well as driver med olje og gass aktiviteter. Selskapet owns a fleet of six vessels which includes three bygging tjeneste vessels og three anchor handling tug support vessels. Selskapet driver in the North Sea, North and Central America, Mediterranean/rest of Europe, Africa, South America, Australia, and Asia. Solstad Offshore ASA ble grunnlagt i 1964 og har hovedkontor i Skudeneshavn, Norway.",
    "description_length": 892
  },
  {
    "ticker": "HELG.OL",
    "company_name": "SpareBank 1 Helgeland",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "SpareBank 1 Helgeland tilbyr various finansielle produkter og tjenester to retail kunder, small og medium enterprises, municipal authorities, og institutions in Norway. Selskapet driver in two segmenter, Corporate and Retail banking. Selskapet tilbyr savings, investment, pension, og insurance produkter, as well as leasing og mortgage tjenester. Selskapet is also involved in owning, managing, og letting of commercial properties. SpareBank 1 Helgeland ble grunnlagt i 1860 og har hovedkontor i Mo i Rana, Norway.",
    "description_length": 514
  },
  {
    "ticker": "NONG.OL",
    "company_name": "SpareBank 1 Nord-Norge",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "SpareBank 1 Nord-Norge tilbyr banking tjenester in Northern Norway. Selskapet driver gjennom Retail Market and Corporate Market segmenter. Selskapet tilbyr savings og pension accounts; deposits; bank guarantees; letters of credit; og foreign currency accounts, as well as debit og credit card tjenester. Selskapet tilbyr mortgage, car, consumer, boat, caravans, vehicle, og green loans; og other loan related tjenester. Selskapet also tilbyr vehicle, home, travel, valuable item, car, personal, og pet insurance tjenester. Further, selskapet tilbyr accounting tjenester, eiendom brokerage, leasing/salg-leaseback financing, refinancing, payment, og mobile and online banking tjenester. SpareBank 1 Nord-Norge ble grunnlagt i 1836 og har hovedkontor i Tromsø, Norway.",
    "description_length": 766
  },
  {
    "ticker": "SNOR.OL",
    "company_name": "SpareBank 1 Nordmøre",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "SpareBank 1 Nordmøre tilbyr various bankprodukter og -tjenester in Norway. Selskapet tilbyr business insurance produkter, inkludert vehicle og machinery, value og building, employee og personnel, and farm og agricultural insurance; personal insurance produkter, such as car, home, personal, pet, vehicle, travel, og valuables insurance produkter; pension produkter; bank cards; payment og debt collection tjenester; og mobile and online banking tjenester. Selskapet also tilbyr bank guarantees, operating credit produkter for agriculture, og factoring and leasing produkter og tjenester, as well as savings og deposit accounts, refinancing, og mortgage tjenester. SpareBank 1 Nordmøre ble grunnlagt i 1835 og har base i Kristiansund, Norway. SpareBank 1 Nordmøre er et datterselskap av SpareBank 1 Gruppen AS.",
    "description_length": 809
  },
  {
    "ticker": "RING.OL",
    "company_name": "SpareBank 1 Ringerike Hadeland",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "SpareBank 1 Ringerike Hadeland, a financial institution, tilbyr various bankprodukter og -tjenester to private og corporate kunder in Norway. Selskapet accepts various deposits, inkludert savings, current, deposit, og currency accounts. Selskapet also tilbyr car, consumer, vehicle, transferring, business, og bygging loans, as well as mortgage og refinancing loans; financing tjenester, such as agricultural operating credit, factoring, overdraft, og leasing; bank guarantees; car, home, personal, pet, vehicle og machinery, travel, employee, farm og agricultural, and other insurance produkter; pension produkter; og savings and investment produkter. In addition, selskapet tilbyr debit og credit cards, as well as mobile og online banking tjenester. Further, it tilbyr eiendom brokerage, consulting, og accounting tjenester. SpareBank 1 Ringerike Hadeland ble grunnlagt i 1833 og har hovedkontor i Hønefoss, Norway.",
    "description_length": 918
  },
  {
    "ticker": "MING.OL",
    "company_name": "SpareBank 1 SMN",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "SpareBank 1 SMN, sammen med sine datterselskaper, tilbyr various banking, accounting, og eiendom produkter og tjenester to private individuals og companies in Norway og internasjonalt. Selskapet tilbyr checking, current, buffer, savings, deposit, business, tax withholding, investment, og group accounts; green og fixed rate deposits; mortgage, car, consumer, green, vehicle, home, bygging, og business loans; debit, credit, virtual, deposit, og municipal payment cards; og pension tjenester. Selskapet also tilbyr car, housing, person, animal, vehicle, travel, valuable item, workshop, transport, housing association og condominium, bygging, property, trade og tjeneste, team og association, agriculture og small farming, consulting og tjeneste, machine, building og value, and employee insurance produkter. In addition, selskapet tilbyr refinancing, overdraft, leasing, factoring, agricultural operating credit, sales invoice, cash, stocks og investment, accounting, HR, tax og fee, transactional advice, IT, business, and rådgivningstjenester; bank guarantees; og online and mobile banking tjenester, as well as buys og selger properties. Selskapet distributes its produkter gjennom physical branches, customer tjeneste center, og digital channels. SpareBank 1 SMN ble grunnlagt i 1823 og har hovedkontor i Trondheim, Norway.",
    "description_length": 1328
  },
  {
    "ticker": "SB1NO.OL",
    "company_name": "SpareBank 1 Sør-Norge ASA",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "SpareBank 1 Sør-Norge ASA, sammen med sine datterselskaper, tilbyr various finansielle produkter og tjenester for personal og corporate kunder in Norway. Selskapet driver gjennom Retail Market, Corporate Market, SME & Agriculture, and Other Activities segmenter. Selskapet tilbyr savings, loans, insurance, og pension produkter. Selskapet also tilbyr account og payment, international cash forvaltning, foreign exchange, administrative securities, accounting, estate agency, HR, securities trading, og investment tjenester; green loans; credit cards; consulting; commercial properties for leasing; og banking tjenester. In addition, it facilitates og advises debt og equity funding; og selger eiendom properties, homes, og commercial properties. Further, selskapet is involved in the customer trading of interest-rate instruments; og purchasing of home mortgages. Selskapet serves retail og corporate, SME, small business, og agricultural kunder, as well as the public sector. Selskapet ble grunnlagt i 1839 og har hovedkontor i Stavanger, Norway.",
    "description_length": 1047
  },
  {
    "ticker": "SOAG.OL",
    "company_name": "SpareBank 1 Østfold Akershus",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "SpareBank 1 Østfold Akershus driver as a sparebank that tilbyr various bankprodukter og -tjenester in Norway. Selskapet tilbyr savings in funds; savings accounts; savings for children og retirement; and stocks og investment produkter. Selskapet also tilbyr mortgage, car, moving, consumer, vehicle, green, og transferring loans, as well as refinancing of mortgage og consumer debt; financing tjenester, inkludert overdrafts, leasing, business loans, bank guarantees, bygging loans, growth guarantee schemes, operating credit for agriculture, factoring, og invoice sales. In addition, it tilbyr pension produkter; car, home, personal, pet, vehicle, travel, machinery, building, employee og personal, and farm og agricultural insurances; og property tjenester. Further, selskapet tilbyr mobile og online banking; bank card og credit card; og pay and transfer tjenester. Selskapet ble grunnlagt i 1835 og har base i Moss, Norway.",
    "description_length": 926
  },
  {
    "ticker": "SPOL.OL",
    "company_name": "SpareBank 1 Østlandet",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "SpareBank 1 Østlandet tilbyr various finansielle produkter og tjenester to individuals, businesses, the public sector, clubs, og societies. Selskapet driver gjennom Retail, Corporate, and Organisation Market and Capital Market segmenter. The Retail segment tilbyr financial tjenester comprising of savings, money transfer, insurance, accident prevention, financing, money transfer, capital, og investment forvaltning tjenester. The Corporate segment tilbyr interest rate, currency hedging, og investment related tjenester, as well as insurance tjenester for property. The Organisation Market and Capital Market segment tilbyr risk based advisory løsninger to high-net-worth individuals og corporates, as well as driver med foreign currency tjenester. SpareBank 1 Østlandet ble grunnlagt i 1845 og har hovedkontor i Hamar, Norway.",
    "description_length": 829
  },
  {
    "ticker": "MORG.OL",
    "company_name": "Sparebanken Møre",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Sparebanken Møre, sammen med sine datterselskaper, tilbyr banking tjenester for retail og corporate kunder in Norway. Selskapet driver gjennom Retail og eiendom Brokerage segmenter. Selskapet tilbyr tjenester in the areas of financing, deposits og other forms of investments, payment transfers, financial advisory tjenester, eiendel forvaltning, insurance, og eiendom brokerage. Sparebanken Møre ble grunnlagt i 1843 og har hovedkontor i Ålesund, Norway.",
    "description_length": 454
  },
  {
    "ticker": "SBNOR.OL",
    "company_name": "Sparebanken Norge",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Sparebanken Vest, a financial tjenester company, tilbyr banking og financing tjenester in the counties of Vestland and Rogaland, Norway. Selskapet driver gjennom Corporate Market, Retail Market, Bulder Bank, Treasury, and Estate Agency Activities segmenter. Selskapet is also involved in investment banking, trading in securities for professional investors, leasing og sales mortgage loans, og eiendom agency business. Selskapet var tidligere kjent som Sparebanken Vest og change its name to Sparebanken Norge in May 2025. Selskapet ble grunnlagt i 1823 og har hovedkontor i Bergen, Norway.",
    "description_length": 590
  },
  {
    "ticker": "SPOG.OL",
    "company_name": "Sparebanken Øst",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Sparebanken Øst driver as a sparebank in Eastern Norway. Selskapet tilbyr savings accounts, retirement savings, guardianship accounts, og deposit accounts; car loans, home og green mortgage loans, og framework loans, as well as refinancing tjenester; og mortgage loans for new og used cars. Selskapet also tilbyr vehicles, houses og contents, boats, leisure, life og health, child, travel, og disability insurance produkter; shares og funds trading, og investment banking tjenester; placement og payment processing tjenester; og online and mobile banking tjenester. In addition, selskapet buys, selger, og stores cryptocurrencies; og driver, leases, og selger eiendom properties. Sparebanken Øst ble grunnlagt i 1843 og har hovedkontor i Drammen, Norway.",
    "description_length": 754
  },
  {
    "ticker": "SPIR.OL",
    "company_name": "Spir Group ASA",
    "sector": "Teknologi",
    "industry": "IT-tjenester",
    "original_description": "Spir Group ASA tilbyr programvareløsninger in Norway, Sweden, og internasjonalt. Selskapet tilbyr Samsvar, a system that helps consumers keep track of legal requirements related to privacy og information security; PixEdit, a software for automating the processing of scanning, data capture, digitalization og optimization, interactive editing, og converting all types of files/documents; Elements, Sak-Arkiv, a core system; Elements eByggesak, a software for bygging case processing; AIoT, a platform for data collection; Infoland, a data source for the eiendom marked; Propfinder, a map tjeneste for property developers; Byggesøknaden, a digital building application for professionals; data tjenester that include tjenester connected to the land registry og technical information; og digital settlement process in eiendom transactions. Selskapet also tilbyr Hjemla, a eiendom platform focusing on the value of residential properties; Boligmappa, a digital platform connecting all sides of the housing og eiendom lifecycle; Boligmappa.no, an online tjeneste that makes for homeowners to manage their property; Boligmappa Professional, used by craftsmen og other professionals to register work, documentation, og other data; ByggeBolig.no, an online forum for homeowners og enthusiasts; and Boligmappa Data Platform used by property appraisers, electrical supervisors, og others. In addition, selskapet tilbyr geodata og eiendom information tjenester; consultancy og analysis tjenester; IT utvikling og design, system drift, lifecycle forvaltning og support, forestry og eiendom valuation, IT support to administer forestry og felling, digital support, og validation and report of environmental data tjenester; og software-as-a-tjeneste løsninger. Selskapet var tidligere kjent som Sikri Group ASA og endret navn til Spir Group ASA in December 2023. Spir Group ASA ble grunnlagt i 2019 og har hovedkontor i Oslo, Norway.",
    "description_length": 1919
  },
  {
    "ticker": "SNI.OL",
    "company_name": "Stolt-Nielsen Limited",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Stolt-Nielsen Limited, sammen med sine datterselskaper, tilbyr transportation, storage, og distribution løsninger for bulk liquid chemicals, edible oils, acids, og other specialty liquids globalt. Selskapet driver gjennom five segmenter: Tankers, Terminals, Tank Containers, Stolt Sea Farm, and Stolt-Nielsen Gas. Selskapet also produces, processes, and markedsfører seafood, inkludert turbot og sole; and stores og handles chemicals, clean petroleum produkter, liquefied petroleum gases, vegetable oils, og biofuels, as well as alternative fuels og feedstocks. In addition, it holds investment in logistics, distribution, liquid natural gas, og land-based aquaculture businesses. Selskapet ble grunnlagt i 1959 og har base i London, the United Kingdom. Stolt-Nielsen Limited er et datterselskap av Fiducia Ltd.",
    "description_length": 811
  },
  {
    "ticker": "STB.OL",
    "company_name": "Storebrand ASA",
    "sector": "Finans",
    "industry": "Financial Konglomerater",
    "original_description": "Storebrand ASA tilbyr insurance produkter og tjenester in Norway, Sweden, the United Kingdom, Finland, Denmark, Germany, Luxemburg, and Ireland. Selskapet driver gjennom four segmenter: Savings, Insurance, Guaranteed Pensions, and Other. The Savings segment tilbyr retirement savings, defined contribution pensions, eiendel forvaltning, og retail banking produkter. The Insurance segment tilbyr personal insurance, non-life insurance, personal risk, og pension-related insurance produkter. The Guaranteed Pensions segment tilbyr long-term pension savings produkter, such as defined contribution pensions, paid-up policies, og individual capital og pension insurance produkter. The Other segment tilbyr life insurance produkter. Selskapet serves private individuals, businesses, public enterprises, og corporate and retail markedsfører. Storebrand ASA ble grunnlagt i 1767 og har hovedkontor i Lysaker, Norway.",
    "description_length": 909
  },
  {
    "ticker": "STRO.OL",
    "company_name": "StrongPoint ASA",
    "sector": "Industri",
    "industry": "Business Equipment og Supplies",
    "original_description": "StrongPoint ASA driver med the utvikling, salg, og implementation of integrated teknologiløsninger to retailers in Scandinavia og internasjonalt. Selskapet tilbyr e-commerce logistic løsninger, inkludert order picking, automated fulfillment, warehouse forvaltning, home delivery, og various click og collect pickup løsninger; in-store productivity løsninger, such as electronic shelf labels, scales og wrapping systems, og ShopFlow Logistics, a cloud-based mobile logistics system for managing routines such as receiving goods, inventory, balance adjustments, label printing, og waste forvaltning. Selskapet also tilbyr payment løsninger comprising checkout efficiency løsninger, inkludert self-checkout; Vensafe, which automates in-store sales of restricted og high-theft produkter, such as tobacco, pharmaceuticals, og other high-value items; self scanning; og POS systems, as well as multiple CashGuard models: Core, Premium, Unico, and Compact. In addition, selskapet is involved in equipping retail og tjeneste shops with necessary equipment, fixtures, og fittings, as well as refurbishing checkouts; og implements, personalizes, og maintains an enterprise resource forvaltning løsning. Selskapet var tidligere kjent som PSI Group ASA og endret navn til StrongPoint ASA in September 2015. StrongPoint ASA ble grunnlagt i 2000 og har hovedkontor i Oslo, Norway.",
    "description_length": 1365
  },
  {
    "ticker": "SUBC.OL",
    "company_name": "Subsea 7 S.A.",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "Subsea 7 S.A. delivers offshore projects og tjenester for the energi industry globalt. Selskapet tilbyr subsea field utvikling produkter og tjenester, inkludert prosjektledelse, design og engineering, procurement, fabrication, survey, installation, og commissioning of produksjon facilities on the seabed og the tie-back of its facilities to fixed or floating platforms or to the shore. Selskapet also tilbyr remotely operated vehicles og tooling tjenester to support leting og produksjon aktiviteter og to deliver full life-of-field tjenester; procurement og installation of havvind turbine foundations og inner-array cables, as well as heavy lifting drift for renewables structures og heavy transportation tjenester; og engineering and advisory tjenester to kunder in the olje og gass, renewables, og utilities industries. In addition, selskapet tilbyr engineering, procurement, installation, og commissioning of subsea olje og gass systems in deep waters; fabrication, installation, extension, og refurbishment of fixed og floating platforms og associated pipelines in shallow water environments; inspection, og reparasjon and vedlikehold tjenester, forvaltning of subsea infrastructure, og remote intervention support; og karbonfangst, utilization, og storage tjenester. Selskapet ble stiftet i 1993 og har base i Luxembourg, Luxembourg.",
    "description_length": 1341
  },
  {
    "ticker": "TGS.OL",
    "company_name": "TGS ASA",
    "sector": "Energi",
    "industry": "Olje og gass Equipment og Services",
    "original_description": "TGS ASA tilbyr geoscience data tjenester to the olje og gass industry in Norway og internasjonalt. Selskapet tilbyr geophysical data, such as multi-client seismic data; geological data comprising well data produkter, og interpretive studies og tjenester; and interpretation produkter og data integration løsninger. Selskapet also tilbyr imaging tjenester, which include 2D og 3D seismic imaging løsning in depth og time domains; marine, land, og ocean bottom nodes; og transition zone, multi component, og 4D time-lapse processing. Selskapet var tidligere kjent som TGS-NOPEC Geophysical Company ASA og endret navn til TGS ASA in June 2021. TGS ASA ble grunnlagt i 1981 og har hovedkontor i Oslo, Norway.",
    "description_length": 704
  },
  {
    "ticker": "TECH.OL",
    "company_name": "Techstep ASA",
    "sector": "Teknologi",
    "industry": "Communication Equipment",
    "original_description": "Techstep ASA driver as a mobile teknologi company in Norway, Sweden, Denmark, and Poland. Selskapet tilbyr device lifecycle forvaltning; mobile data capture og workflow; mobile device forvaltning; procurement, logistics, og lifecycle; and mobile teknologi consultancy løsninger. Selskapet also tilbyr mobile devices og accessories; and device forvaltning og security produkter. Techstep ASA ble grunnlagt i 1996 og har hovedkontor i Oslo, Norway.",
    "description_length": 446
  },
  {
    "ticker": "TEKNA.OL",
    "company_name": "Tekna Holding ASA",
    "sector": "Basisråvarer",
    "industry": "Spesialkjemikalier",
    "original_description": "Tekna Holding ASA driver med the utvikling, manufacture, og salg of micron og nanopowders, and plasma process løsninger in North America, Europe, Asia, og internasjonalt. Selskapet tilbyr spherical powders, such as titanium, nickel, og aluminum alloys, as well as tungsten og tantalum; and nanopowders, inkludert nickel, silicon, og copper nanopowders, as well as boron nitride nanotubes for use in additive manufacturing, metal injection molding, thermal spray, binder jetting, og hot isostatic pressing. Selskapet's plasma systems include Spheroidization to produce spherical powders; Synthesis of nanopowders to produce nanomaterials; Deposition to produce coatings; PlasmaSonic, an enthalpy plasma wind tunnel, Food devices for flow fluctuation, og ENTHALPIC PROBE to measure plasma parameters. Selskapet serves aviation, aerospace, medical, mining og boring, energi storage, og microelectronics industries. Selskapet ble grunnlagt i 1990 og har hovedkontor i Sherbrooke, Canada. Tekna Holding ASA er et datterselskap av Arendals Fossekompani ASA.",
    "description_length": 1051
  },
  {
    "ticker": "TEL.OL",
    "company_name": "Telenor ASA",
    "sector": "Kommunikasjonstjenester",
    "industry": "Telecom Services",
    "original_description": "Telenor ASA, sammen med sine datterselskaper, driver as a telecommunication company globalt. Selskapet driver gjennom four segmenter: Nordics, Asia, Infrastructure, and Amp. Selskapet tilbyr mobile og broadband telecom produkter og tjenester, inkludert mobile, broadband og TV tjenester; other tjenester, inkludert løsninger for business kunder like managed tjenester, virtual private networks, software defined networks, og network as a tjeneste; IoT løsninger; and mobile maritime communication for cruise og ferry, fisheries, og olje og gass industry. Selskapet also tilbyr hardware comprising mobile phones, broadband modems, og TV boxes; wholesale tjenester, such as national og international roaming og interconnect, and løsninger for mobile og fixed virtual network operators og tjeneste providers, as well as leased lines og colocation at towers og data centres. In addition, selskapet tilbyr cloud storage tjeneste for private use og businesses that allows to back up, store, synchronize, og share files over the Internet. Telenor ASA ble grunnlagt i 1855 og har hovedkontor i Fornebu, Norway.",
    "description_length": 1102
  },
  {
    "ticker": "TRMED.OL",
    "company_name": "Thor Medical ASA",
    "sector": "Helse",
    "industry": "Bioteknologi",
    "original_description": "Thor Medical ASA produces og supplies alpha-particle emitters for cancer therapy in Norway. Selskapet utvikler Ra224, an isotope of radium; Pb-212, a radioactive isotope of lead; og Th-228, a radioactive isotope of thorium. Selskapet ble stiftet i 2009 og har hovedkontor i Oslo, Norway.",
    "description_length": 287
  },
  {
    "ticker": "TIETO.OL",
    "company_name": "TietoEVRY Oyj",
    "sector": "Teknologi",
    "industry": "IT-tjenester",
    "original_description": "TietoEVRY Oyj driver as a software og tjenester company. Selskapet driver gjennom five segmenter: Tietoevry Create, Tietoevry Banking, Tietoevry Care, Tietoevry Industry, and Tietoevry Tech Services. The Tietoevry Create segment tilbyr digital agenda to create competitive produkter, as well as uses design, data, og cloud technologies for data-driven businesses. This segment also tilbyr software og data ingeniørtjenester. The Tietoevry Banking segment tilbyr Banking-as-a-Service platform og software produkter for digital transformation og financial institutions. Tietoevry Care segment tilbyr modular og interoperable software, reinventing Nordic health, og social care tjenester. The Tietoevry Industry segment tilbyr software og data løsninger to various industries, such as public sector, pulp og paper, and utilities. The Tietoevry Tech Services tilbyr enterprise-wide transformation to kunder' business processes, applications og infrastructure; and deep customer knowledge, global cloud & data competencies, automated drift, og multi-cloud platform tjenester. Selskapet var tidligere kjent som Tieto Oyj og endret navn til TietoEVRY Oyj in December 2019. TietoEVRY Oyj ble stiftet i 1968 og har hovedkontor i Espoo, Finland.",
    "description_length": 1235
  },
  {
    "ticker": "TOM.OL",
    "company_name": "Tomra Systems ASA",
    "sector": "Industri",
    "industry": "Avfallshåndtering",
    "original_description": "Tomra Systems ASA tilbyr sensor-based løsninger for optimal resource productivity globalt. Selskapet driver gjennom four segmenter: TOMRA Collection, TOMRA Recycling, TOMRA Food, and TOMRA Horizon. Selskapet utvikler, produces, sales, leases, og tjenester reverse vending machines og related data forvaltning systems; og tilbyr pick-up, transportation, og processing tjenester of empty beverage containers on behalf of beverage producers/fillers. Selskapet also utvikler, produces, salg, og tjeneste sorting og processing teknologi for waste forvaltning companies or plant builders; og tilbyr sorting systems for waste og metal material streams, as well as ore sorting sensors for mining companies. In addition, selskapet tilbyr post-harvest food løsninger for fresh og processed food industries. Tomra Systems ASA ble grunnlagt i 1972 og har hovedkontor i Asker, Norway.",
    "description_length": 871
  },
  {
    "ticker": "TRE.OL",
    "company_name": "Treasure ASA",
    "sector": "Finans",
    "industry": "Asset Management",
    "original_description": "Treasure ASA, gjennom its 11% interest in Hyundai Glovis Co. Ltd., tilbyr transportation og logistics tjenester in South Korea. Selskapet driver gjennom 119 vessels in the ro-ro og bulk cargo segment. Treasure ASA ble stiftet i 2016 og har base i Lysaker, Norway. Treasure ASA er et datterselskap av Wilh. Wilhelmsen Holding ASA.",
    "description_length": 329
  },
  {
    "ticker": "TRSB.OL",
    "company_name": "Trøndelag Sparebank",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Trøndelag Sparebank, a sparebank, tilbyr bankprodukter og -tjenester to private og corporate kunder in Norway. Selskapet tilbyr savings og retirement accounts; car, motorcycles, motorhomes, boats, ATVs, og consumer loans, as well as refinancing; og mobile banking, online banking, og insurance produkter. Selskapet also tilbyr business bankprodukter og -tjenester, inkludert bank guarantee, business loans, bygging loans, factoring, overdraft, og leasing produkter; agricultural loans og investments; insurance og pension produkter; og cards and payment løsninger. Selskapet var tidligere kjent som Hemne Sparebank. Trøndelag Sparebank ble grunnlagt i 1864 og har base i Kyrksæterøra, Norway.",
    "description_length": 692
  },
  {
    "ticker": "VEI.OL",
    "company_name": "Veidekke ASA",
    "sector": "Industri",
    "industry": "Ingeniør- og entreprenørvirksomhet",
    "original_description": "Veidekke ASA driver as a bygging og property utvikling company in Norway, Sweden, and Denmark. Selskapet driver gjennom bygging Norway, Infrastructure Norway, bygging Sweden, Infrastructure Sweden, and Denmark/Hoffmann segmenter. Selskapet executes civil engineering drift with projects in the road vedlikehold, railways, power produksjon, og airport segmenter; og infrastructure, extractive og heavy industries, energi, og recycling facilities/landfill projects, as well as asphalt-laying. Selskapet also driver as bygging contractors for apartment complexes og non-residential buildings, such as schools, healthcare facilities, cultural buildings, office buildings, hotels, og shopping centres; og tilbyr bygging og renovation tjenester for public, commercial, og residential buildings. In the addition, selskapet produces asphalt og aggregates. Veidekke ASA ble grunnlagt i 1936 og har hovedkontor i Oslo, Norway.",
    "description_length": 916
  },
  {
    "ticker": "VENDA.OL",
    "company_name": "Vend Marketplaces ASA",
    "sector": "Kommunikasjonstjenester",
    "industry": "Nettinnhold og informasjon",
    "original_description": "Vend Marketplaces ASA, sammen med sine datterselskaper, driver as a media company. Selskapet driver gjennom Mobility, eiendom, Jobs, Recommerce, and Delivery segmenter. Selskapet driver online classifieds that provide teknologi-based tjenester to connect buyers og sellers, and facilitate transactions, inkludert job tilbyr, eiendom, cars, travel, consumer goods, og others; used car marketplace; og recommerce marketplaces. Selskapet also tilbyr Jobs marketplace; door-to-door deliveries for second-hand goods sold gjennom marketplaces; løsninger for consumers to sell their cars to dealers; og delivers fresh baked goods, food, og flowers directly to customer doors, as well as manages media distribution og ecommerce parcel deliveries. Selskapet tilbyr its produkter under the FINN, Blocket, Bytbil, Bilinfo, Bilbasen, Tori, DBA, Tise, Nettbil, AutoVex, Oikotie, Qasa, Helthjem, Morgenlevering, HomeQ, Remppatori, Scrimba, Hjemmelegene, Insurello, Bookis, Gire, Maja, Campanyon, Unlock, pej, FundingPartner, compricer, SYD, Demando, Hygglo, advized, torn, Wheelaway, Mittanbud, Inzpire.me, Di, Mindler, Yepstr, plick, SAVR, Dintero, Tibber, 3byggetbud.dk, Linear, nomono, knips, homely, Firi, turnr, fixrate, Askin, The Mindfulness App, tillit, Zoopit, Hypoteket, Albert, and Servicefinder brands. Selskapet driver in Norway, Sweden, Finland, Denmark, og other Europe countries. Selskapet var tidligere kjent som Schibsted ASA og endret navn til Vend Marketplaces ASA in May 2025. Vend Marketplaces ASA ble grunnlagt i 1839 og har hovedkontor i Oslo, Norway.",
    "description_length": 1561
  },
  {
    "ticker": "VENDB.OL",
    "company_name": "Vend Marketplaces ASA",
    "sector": "Kommunikasjonstjenester",
    "industry": "Nettinnhold og informasjon",
    "original_description": "Vend Marketplaces ASA, sammen med sine datterselskaper, driver as a media company. Selskapet driver gjennom Mobility, eiendom, Jobs, Recommerce, and Delivery segmenter. Selskapet driver online classifieds that provide teknologi-based tjenester to connect buyers og sellers, and facilitate transactions, inkludert job tilbyr, eiendom, cars, travel, consumer goods, og others; used car marketplace; og recommerce marketplaces. Selskapet also tilbyr Jobs marketplace; door-to-door deliveries for second-hand goods sold gjennom marketplaces; løsninger for consumers to sell their cars to dealers; og delivers fresh baked goods, food, og flowers directly to customer doors, as well as manages media distribution og ecommerce parcel deliveries. Selskapet tilbyr its produkter under the FINN, Blocket, Bytbil, Bilinfo, Bilbasen, Tori, DBA, Tise, Nettbil, AutoVex, Oikotie, Qasa, Helthjem, Morgenlevering, HomeQ, Remppatori, Scrimba, Hjemmelegene, Insurello, Bookis, Gire, Maja, Campanyon, Unlock, pej, FundingPartner, compricer, SYD, Demando, Hygglo, advized, torn, Wheelaway, Mittanbud, Inzpire.me, Di, Mindler, Yepstr, plick, SAVR, Dintero, Tibber, 3byggetbud.dk, Linear, nomono, knips, homely, Firi, turnr, fixrate, Askin, The Mindfulness App, tillit, Zoopit, Hypoteket, Albert, and Servicefinder brands. Selskapet driver in Norway, Sweden, Finland, Denmark, og other Europe countries. Selskapet var tidligere kjent som Schibsted ASA og endret navn til Vend Marketplaces ASA in May 2025. Vend Marketplaces ASA ble grunnlagt i 1839 og har hovedkontor i Oslo, Norway.",
    "description_length": 1561
  },
  {
    "ticker": "VISTN.OL",
    "company_name": "Vistin Pharma ASA",
    "sector": "Helse",
    "industry": "Drug Manufacturers - Specialty og Generic",
    "original_description": "Vistin Pharma ASA, gjennom its subsidiary, Vistin Pharma AS, driver med the produksjon og salg of active pharmaceutical ingredients (APIs) globalt. Selskapet tilbyr metformin HCl APIs og direct compressive granulates for the pharmaceutical industry. Selskapet ble grunnlagt i 1969 og har base i Oslo, Norway.",
    "description_length": 308
  },
  {
    "ticker": "VVL.OL",
    "company_name": "Voss Veksel- og Landmandsbank ASA",
    "sector": "Finans",
    "industry": "Banker - regional",
    "original_description": "Voss Veksel- og Landmandsbank ASA tilbyr bankprodukter og -tjenester to private individuals og companies in Norway. Selskapet tilbyr saving accounts; car og other vehicle, home, small, og bygging loans; overdrafts facilities; leasing tjenester; bank guarantees; bank og payment cards; insurance produkter; og online and mobile banking tjenester. Selskapet ble grunnlagt i 1843 og har base i Voss, Norway.",
    "description_length": 404
  },
  {
    "ticker": "VOW.OL",
    "company_name": "Vow ASA",
    "sector": "Industri",
    "industry": "Forurensnings- og rensekontroll",
    "original_description": "Vow ASA, sammen med sine datterselskaper, produces, delivers, og maintains systems for processing og purifying wastewater, food waste, solid waste, og bio sludge in Norway, France, Poland, the United States, and Italy. Selskapet driver gjennom Industrial Solutions, Maritime Solutions, and Aftersales segmenter. The Industrial Solutions segment designer og tilbyr systems to valorise biomass residues og waste into renewable produkter, chemicals, og fossil free energi gjennom pyrolysis løsninger. The Maritime Solution segment tilbyr Scanship's drift og delivers technological løsninger for wastewater treatment, food waste processing, og waste forvaltning for the cruise industry. The Aftersales segment tilbyr spare parts og consumables; and tjenester on systems delivered to shipowners. In addition, selskapet tilbyr Biogreen, a patented pyrolysis process for converting biomass, plastics, og waste into energi; og Safesteril, a patented sterilisation process for food og pharmaceutical ingredients. Further, selskapet utvikler, designer, og fabricates industrial furnaces og equipment. Selskapet serves cruise og landbased industries. Selskapet has a strategic partnership agreement with Repsol, S.A. Selskapet var tidligere kjent som Scanship Holding ASA og endret navn til VOW ASA in January 2020. Vow ASA ble grunnlagt i 2011 og har hovedkontor i Oslo, Norway.",
    "description_length": 1368
  },
  {
    "ticker": "VAR.OL",
    "company_name": "Vår Energi AS",
    "sector": "Energi",
    "industry": "Olje og gass EogP",
    "original_description": "Vår Energi AS driver as an independent upstream olje og gass company on the Norwegian continental shelf in Norway. Selskapet produces crude oil og natural gas liquids. Selskapet var tidligere kjent som Eni Norge AS og endret navn til Vår Energi AS in December 2018. Selskapet ble stiftet i 1965 og har hovedkontor i Sandnes, Norway. Vår Energi AS driver as a subsidiary of Eni International B.V.",
    "description_length": 395
  },
  {
    "ticker": "WAWI.OL",
    "company_name": "Wallenius Wilhelmsen ASA",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Wallenius Wilhelmsen ASA, sammen med sine datterselskaper, driver med the logistics og transportation business globalt. Selskapet driver in three segmenter: Shipping Services, Logistics Services, and Government Services. Selskapet tilbyr ship forvaltning tjenester, inkludert crewing, technical, og forvaltning; insurance brokerage tjenester; agency tjenester; freight og liner tjenester; og marine produkter to vessels. Selskapet also tilbyr ocean transport of cars og RoRo cargo, as well as manufacturers, bygging, og other high og heavy equipment. In addition, selskapet tilbyr vehicle processing center, equipment processing center, og inland distribution network og terminal tjenester; og ocean transport for breakbulk og vehicles. Selskapet serves agriculture, automotive, aviation, boats og yachts, breakbulk, commercial vehicles, bygging, machinery og machine tools, mining, olje og gass, power og energi, and rail industries. Selskapet driver gjennom a fleet of 125 vessels sailing on 15 trade routes. Selskapet ble grunnlagt i 1861 og har base i Lysaker, Norway.",
    "description_length": 1072
  },
  {
    "ticker": "WSTEP.OL",
    "company_name": "Webstep ASA",
    "sector": "Teknologi",
    "industry": "IT-tjenester",
    "original_description": "Webstep ASA tilbyr information teknologi (IT) konsulenttjenester to public og private businesses in Norway and Sweden. Selskapet tilbyr consulting, digitalization, .Net, Java, open source, full stack, front og back end, user experience, integration, Artificial Intelligence, mobility, cloud apps, machine learning, business intelligence, big data, data warehousing, Internet of Things, virtual robotics, devops, application tjeneste forvaltning, data science, og project and test forvaltning tjenester. Selskapet also tilbyr ISTQB, PMP, Prince 2, ITIL, scrum, delivery projects, CRM, ERP, process forvaltning, prosjektledelse methodology, facilitating, controller, program coordination, contract forvaltning, offshoring forvaltning, og mentoring tjenester; mobility, cloud computing, cloud tjenester, integration, sensor teknologi, produkt utvikling, tjeneste utvikling, beacons, enterprise user experience, web analysis, design team, amazon web tjenester, azure, big data, prediction, mobility, predictive modelling, workshops, hackathons, business analysis, og search engine optimalisation tjenester. Selskapet serves banking, finance og insurance, public administration, agriculture og food produksjon, IT og telecommunication, commerce, og transportation industries. Selskapet ble grunnlagt i 2000 og har hovedkontor i Oslo, Norway.",
    "description_length": 1336
  },
  {
    "ticker": "WWI.OL",
    "company_name": "Wilh. Wilhelmsen Holding ASA",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Wilh. Wilhelmsen Holding ASA tilbyr maritime produkter og tjenester globalt. Selskapet driver gjennom Maritime Services, New Energy, and Strategic Holdings and Investments segmenter. Selskapet tilbyr pumps, accessories, og spares; cleaning, water treatment, og fuel oil chemicals, as well as test kits, reagents, og marine chemicals equipment; air tools equipment, accessories, consumables, og spares; accessories, consumables, og spares for electric tools; mobile og stationary high-pressure cleaners og systems, vacuum cleaning equipment, circulation cleaning unit, cargo hold cleaning, ultrasonic part og filter cleaners, og workwear/PPE, as well as application, dilution, og mixing equipment; og gases, spangases, regulators, refrigerants, offshore racks, og gas distribution systems. Selskapet also tilbyr refrigeration equipment tools, package equipment, secondary refrigerants og lubricants, and system equipment og spares; arc welding equipment, consumables, og storing; gas welding, brazing, og cutting; cold reparasjon systems; oil spill equipment; mooring ropes, rope stretchers, accessories, og rope protection; mineral grease og oil, synthetic oil, og EAL grease og oil; and emission control chemicals og test kits. Selskapet also tilbyr ship agency tjenester og logistics to the merchant fleet, as well as ship forvaltning tjenester, inkludert manning for various vessels. In addition, selskapet driver med the drift of supply bases for the offshore industry; utvikling og drift of eiendom properties on og off the supply bases; og vedlikehold of rigs og handling of logistics related to international pipeline projects og windmill parks. Further, it tilbyr technical og crew forvaltning tjenester, og digital løsninger; marine og non-marine insurance tjenester; og training, supply chain, finance, HR, and IT tjenester. Selskapet ble grunnlagt i 1861 og har hovedkontor i Lysaker, Norway. Wilh. Wilhelmsen Holding ASA er et datterselskap av Tallyman AS.",
    "description_length": 1968
  },
  {
    "ticker": "WWIB.OL",
    "company_name": "Wilh. Wilhelmsen Holding ASA",
    "sector": "Industri",
    "industry": "Skipsfart",
    "original_description": "Wilh. Wilhelmsen Holding ASA tilbyr maritime produkter og tjenester globalt. Selskapet driver gjennom Maritime Services, New Energy, and Strategic Holdings and Investments segmenter. Selskapet tilbyr pumps, accessories, og spares; cleaning, water treatment, og fuel oil chemicals, as well as test kits, reagents, og marine chemicals equipment; air tools equipment, accessories, consumables, og spares; accessories, consumables, og spares for electric tools; mobile og stationary high-pressure cleaners og systems, vacuum cleaning equipment, circulation cleaning unit, cargo hold cleaning, ultrasonic part og filter cleaners, og workwear/PPE, as well as application, dilution, og mixing equipment; og gases, spangases, regulators, refrigerants, offshore racks, og gas distribution systems. Selskapet also tilbyr refrigeration equipment tools, package equipment, secondary refrigerants og lubricants, and system equipment og spares; arc welding equipment, consumables, og storing; gas welding, brazing, og cutting; cold reparasjon systems; oil spill equipment; mooring ropes, rope stretchers, accessories, og rope protection; mineral grease og oil, synthetic oil, og EAL grease og oil; and emission control chemicals og test kits. Selskapet also tilbyr ship agency tjenester og logistics to the merchant fleet, as well as ship forvaltning tjenester, inkludert manning for various vessels. In addition, selskapet driver med the drift of supply bases for the offshore industry; utvikling og drift of eiendom properties on og off the supply bases; og vedlikehold of rigs og handling of logistics related to international pipeline projects og windmill parks. Further, it tilbyr technical og crew forvaltning tjenester, og digital løsninger; marine og non-marine insurance tjenester; og training, supply chain, finance, HR, and IT tjenester. Selskapet ble grunnlagt i 1861 og har hovedkontor i Lysaker, Norway. Wilh. Wilhelmsen Holding ASA er et datterselskap av Tallyman AS.",
    "description_length": 1968
  },
  {
    "ticker": "YAR.OL",
    "company_name": "Yara International ASA",
    "sector": "Basisråvarer",
    "industry": "Agricultural Inputs",
    "original_description": "Yara International ASA tilbyr crop nutrition og industrial løsninger in Norway, European Union, Europe, Africa, Asia, North and Latin America, Australia, and New Zealand. Selskapet tilbyr ammonium- og urea-based fertilizers; compound fertilizers that contain nutrients, such as nitrogen, phosphorus, og potassium; coatings; biostimulants; organic-based fertilizers; green fertilizers are nitrate-based mineral fertilizers, as well as foliar og fertigation løsninger; and nitrate, calcium nitrate, micronutrient, og fertigation and urea fertilizers. Selskapet also tilbyr digital løsninger, such as variable rate application løsninger; N-sensors, a tractor-mounted hardware; N-Tester, a handheld nitrogen measurement tool; YaraFX Insight, an agricultural API; and Atfarm, a digital toolbox for farmer; Yara FarmCare, a mobile app for farmers; Yara AllFarm, a farm forvaltning platform; YaraConnect, a mobile app for retailers; Yara E-commerce, a platform that enables customer access to nutritional løsninger; Tankmix, an app that tilbyr guidelines. Further, it tilbyr Yara Crop Nutrition Recommendation System. Selskapet selger its produkter under YaraBela, YaraMila, YaraLiva, YaraVita, YaraAmplix, YaraRega, YaraTera, YaraSuna, and YaraVera and brands. Yara International ASA ble grunnlagt i 1905 og har hovedkontor i Oslo, Norway.",
    "description_length": 1333
  },
  {
    "ticker": "ZAL.OL",
    "company_name": "Zalaris ASA",
    "sector": "Industri",
    "industry": "Staffing og Employment Services",
    "original_description": "Zalaris ASA, sammen med sine datterselskaper, tilbyr full-tjeneste outsourced personnel og payroll tjenester. Selskapet driver gjennom two segmenter, Managed Services and Zalaris Consulting. The Managed Services segment tilbyr a range of payroll og human resource (HR) outsourcing tjenester, inkludert payroll processing, time og attendance, travel expenses; og cloud-based HR functionality tjenester, such as talent forvaltning, digital personnel archive, HR analytics, og mobile løsninger, etc. Its Zalaris Consulting segment driver med the implementation of SAP HCM and Payroll, and SuccessFactors; og provision of AMO tjenester, which assists kunder with vedlikehold og support of on-premises SAP løsninger. Selskapet also tilbyr business processing outsourcing; and rådgivningstjenester. Selskapet driver in Norway, Sweden, Denmark, Finland, Spain, France, Ireland, the United Kingdom, Germany, Latvia, Poland, Hungary, Czechia, India, Singapore, the Philippines, Australia, og internasjonalt. Selskapet var tidligere kjent som Zalaris HR Services AS og endret navn til Zalaris ASA in May 2014. Zalaris ASA ble grunnlagt i 2000 og har hovedkontor i Oslo, Norway.",
    "description_length": 1167
  },
  {
    "ticker": "ZAP.OL",
    "company_name": "Zaptec ASA",
    "sector": "Sykliske forbruksvarer",
    "industry": "Auto Parts",
    "original_description": "Zaptec ASA driver med the utvikling og salg of chargers, charging systems, og tjenester for electric car charging in Norway, Sweden, Switzerland, Denmark, Iceland, rest of Europe, og internasjonalt. Selskapet tilbyr Zaptec Go and Zaptec Pro alternating current walls charging station for indoor og outdoor use; Zaptec Portal, a cloud platform that monitors, balances, og optimizes the load between charging stations, while displaying real-time power usage; og Zaptec Sense for automatically adjusting the charging speed in the buildings. Selskapet also tilbyr accessories, inkludert covers, charging cables, cable holders, RFID tags, og load balancers. Zaptec ASA ble stiftet i 2012 og har hovedkontor i Stavanger, Norway.",
    "description_length": 722
  },
  {
    "ticker": "ZLNA.OL",
    "company_name": "Zelluna ASA",
    "sector": "Helse",
    "industry": "Bioteknologi",
    "original_description": "Zelluna ASA utvikler T-cell receptor (TCR) cellular immunotherapy produkter for the treatment of solid cancers. Selskapet ble grunnlagt i 2016 og har base i Oslo, Norway.",
    "description_length": 170
  },
  {
    "ticker": "PLT.OL",
    "company_name": "poLight ASA",
    "sector": "Teknologi",
    "industry": "Electronic Components",
    "original_description": "poLight ASA utvikler optical lens for consumer devices og professional applications in Europe, Asia, og the United States. Selskapet's lens replicates the lens of the human eye enabling the implementation of autofocus functions for various applications. Its produkt portefølje includes TLens, a tuneable optical lens for autofocus camera applications; Packaged TLens that facilitates integration of a TLens on a fixed-focus camera module; driver ASIC is designed to drive capacitive loads, such as the TLens autofocus actuators; og evaluation kits that allows to test og evaluate the optical og electrical performance of the TLens in new produkter and/or applications. Selskapet serves smartphones og wearables, industrial, augmented reality, healthcare, og webcams markedsfører. poLight ASA ble grunnlagt i 2005 og har hovedkontor i Tønsberg, Norway.",
    "description_length": 851
  }
]